{"platform":"reddit","community":"r/blackladies","post_id":"1n9nmp4","author_hash":"45f1ed22359c3a87f6af673e4a2cab2c98190d4469c3de89067ae2d39d1fc08c","created_utc":"2025-09-06T02:04:23+00:00","title":"I’m pregnant and very sad I’m choosing to get an abortion","text":"I’m 22 years old, only four weeks along. The father is a guy I’m friends with benefits but nowhere near close to being in a relationship with, he’s also not aware that I’m pregnant, and I’m not interested in one with him at the moment. I work night shifts. I’m planning on going back to school to pursue nursing. I still haven’t moved out or gotten my drivers license.\n\nIt’s just not the right time. This is a recipe for disaster, the exact thing everyone warns young women about. I’m nowhere near prepared for a baby. It was so unexpected. My mum was around my age when she had me in similar circumstances. She has been very open about her life being filled with stress and depression ever since due to the weight of being a single mother in poverty with multiple kids. I don’t want that for myself.\n\nBut a part of me is sad. I’ve always wanted a child and I know I’ll be able to have one in the future. I’ve also always been very pro choice. A part of me still wishes the timing could’ve been better, or that I could’ve been more prepared. I had a steady income or a better support system. I don’t know why I’m so attached to something that hasn’t even got a body yet. But no one will win if I have a baby so unprepared. Not my future child, not the father and not me either. It’s the best decision for us all. Still, if only.\n\nEdit: Honestly the overwhelming love and support I’m receiving is bringing me to tears. You are all so sweet and so kind. Thank you, your words are very needed. ❤️❤️❤️❤️","score":628,"num_comments":196,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1i0tsd6","author_hash":"c668eae380fff0855f9f4f2f4bc8521d40308416720e9c11b318844f5bb41400","created_utc":"2025-01-14T00:53:12+00:00","title":"NOW WHO GOT GRANNY PREGNANT??? 😭😭","text":"","score":907,"num_comments":294,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1n143u4","author_hash":"addc8172ffbcc2941d8ba0a65ca615971c60e83d7e78d8876c168fb4b5bbfd87","created_utc":"2025-08-27T01:34:51+00:00","title":"Dont get pregnant for a loser ladies","text":"I’ve never posted in this forum but let this be your reminder to not get pregnant for a loser ladies!! \n\nI shared an apartment with a single mother for a while trying to save up money and this experience has been the most effective type of birth control and I’m not even kidding. If you see the signs early on the relationship that he’s not as supportive as you’d like, please, do yourself a favour and leave him!! \n\n Even if it takes a while, the least you can do for yourself is limit intimacy with him. Ladies on this forum you have your whole lives ahead of you, and one mistake can ruin it all. please save yourself from the experiences other ladies are going through. I promise pregnancy and raising a child becomes a thousand percent easier when you have an emotionally mature and supportive man by your side. ","score":1165,"num_comments":82,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1l7r6qo","author_hash":"43c3142dcdf7f128ff217b1d2d13b40291cf868fc4f010d7c2b2aeb98cece2aa","created_utc":"2025-06-10T05:53:08+00:00","title":"I just found out I’m pregnant.","text":"I’m 25 and have been married for 2 months. We went out a few weeks ago to celebrate a work event … ended up with a little don julio….\n\nOne thing led to another and we were acting too grown. \n\nWe followed up with emergency contraceptive shortly after but didn’t realize it doesn’t work during your fertile window… which I was in. \n\nMy period is one day late. We took a couple of home tests about an hour ago and received positive results. \n\nI’ve never been pregnant or come close to being pregnant. I don’t know what to say outside of “what the fuck” and sounds between hyperventilating. \n\n\nEDIT: \n\nThank you all for the amazing feedback. There was a reason I chose to post in THIS sub rather than a pregnancy sub or any other sub. I am happy to be able to turn to communities like these that allow me to release. \n\nYou are all amazing! \n\nFor those of you who felt it necessary to say unkind, condescending, and cruel things… I checked your Reddit profiles. You are the way you are for a reason… that’s yo business. ","score":638,"num_comments":195,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1gqgdsp","author_hash":"bb1c13eda3165705d43e310e5d453f1566e8b03274ffaf297b674db8803f6600","created_utc":"2024-11-13T16:08:40+00:00","title":"Since everyone seems to be pregnant, let me share the tweet that made me laugh ","text":"","score":1729,"num_comments":84,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1lsqre8","author_hash":"55838c51ca290a26bef09e8396488f35029ca624c4b8929eede43333ac323858","created_utc":"2025-07-06T02:42:33+00:00","title":"Getting back to myself postpartum","text":"I’m 30 days postpartum and am feeling like im built weird. Im breastfeeding my baby and am looking for tips to make my boobs appear smaller. I was more top heavy but not as disproportionate \nAs I am now. First two pics are b4 my sweet baby Maybe a new wardrobe I was thinking earthy black girl(locing) my hair soon. But I want some tips and advice on hair and wardrobe and feeling like me again after having a baby. Im 120 ish pounds im looking to build this booty so gym membership coming soon. And my mom said some plastic wrap and a waist trainer. But what else can I do? \n\nIm open to all positive tips and will post results in September b4 I go back to work ","score":1093,"num_comments":49,"likely_black_context":true,"matched_preg_terms":["breastfeeding","postpartum"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1lim7nj","author_hash":"f41d536e788e189c836af20e87c83cd00d677ed1ba8630d9cb08bba9a19a6526","created_utc":"2025-06-23T17:07:58+00:00","title":"Can we stop asking where’s the ring on people’s pregnancy announcements?","text":"It’s so rude and tacky. \nI keep seeing people do it on folks posts and it’s so unnecessary. \nSame with a woman posting pictures of her and her kids and people asking where’s the dad.\nSocial media is rotting people brains","score":196,"num_comments":217,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1j0znv1","author_hash":"c46d3cce3086c1f72c78385811b071dfdafd83208bdb1155cb8a400e1363bb18","created_utc":"2025-03-01T13:39:00+00:00","title":"How do you get pregnant “accidentally” if you never used a condom or BC","text":"I’ve always wondered about this—people say they got pregnant “by accident,” but if no form of contraception was used, isn’t that just the natural consequence? I get that mistakes happen, but if you never used a condom, birth control, or any protection, can it really be considered an accident?\n\nOf course, there are factors like lack of education, thinking you’re infertile, misjudging the timing of ovulation, or just being caught up in the moment. But at what point does it stop being an accident and just become an expected outcome?\n\nCurious to hear different perspectives on this!","score":239,"num_comments":124,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1fd2guc","author_hash":"299a304206a6a865e704ff1b64bc2f0d3274c60a80862e2668c6338dc4d10a5f","created_utc":"2024-09-09T22:28:42+00:00","title":"35F pregnant with twins","text":"Hi, I went into the clinic today for a medical abortion but then I found out I was pregnant with twins. I don't have any kids.\n\nFor some reason, I felt differently about the abortion once I found out it was twins, and I found it necessary to have a conversation with the father (he doesn't even know I'm pregnant). \n\nI wasn't going to tell him anything because I guess I'm a bad person but really it's because we're not together and I don't want to or plan on being with him due to other issues we've gone through. \n\nHe wouldn't be mad at all, probably really happy. He's also not a bad person. He wants to be with me, but we would need to fix a lot of things in our relationship that would take months of therapy but still possibly end in co-parenting.\n\nMy question is, has anyone found themselves changing their mind about an abortion once they knew they were having twins, and is it wrong to keep it from the father? \n\nMy fear is that he would want me to keep the pregnancy.\n\nPosted here because I'm black and our struggles are better understood amongst each other.","score":349,"num_comments":153,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"v7tkru","author_hash":"5eda35fb40bed7147633589014c3709e5f8b7f0098e31b67e46b7a551d556a7a","created_utc":"2022-06-08T16:25:09+00:00","title":"Third trimester 🥳!!! My little flower will be here in August 💕! I’m so excited for motherhood 🥰. Wishing light,love, and healthy deliveries on all of my pregnant mamas.","text":"","score":1445,"num_comments":120,"likely_black_context":true,"matched_preg_terms":["pregnant","trimester"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1ehquxv","author_hash":"91c9aad47c5685f404649dc354d4f873ed0ec81bf9ed2e691ce4419f51372bd6","created_utc":"2024-08-01T20:26:24+00:00","title":"How y’all feel about Cardi B “divorcing” Offset for the 10th time and her announcing her pregnancy? 🤔","text":"The news just dropped today, what’s y’all’s honest opinions? You think she’s going through with it this time? ","score":184,"num_comments":211,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1dwgl6u","author_hash":"4b036549ad1ba40b8cc6918457ff553b9dd844abb5f3f6314eca30af8e199025","created_utc":"2024-07-06T03:46:49+00:00","title":"People keep asking me if I'm pregnant and I am gonna scream. 😔","text":"This picture is a photo I took about 3 weeks ago on vacation.\n\nI've had at least 2 people ask me if I'm pregnant this week (coworkers). This makes me feel very sad. Another coworker asked me if I gained weight about a month ago. I am usually around 128lbs at 5'3\" and was on amitriptyline for bladder pain syndrome in March-April. I started to notice I was extremely hungry all the time, which is a direct side effect of SSRIs. I'm a vegan, and I enjoy and actively eat fruits and vegetables, nuts, seeds, every single day. That's the kind of food I eat on the regular, but gained 18lbs. Of course, I was not happy with this and decided to get off the stupid medication. I have already lost at least 2lbs, since I last checked about two weeks ago. But I'm feeling extremely sad right now. I want people to *stop commenting on my weight altogether.* At my usual weight, they even say weird things like, \"Your arms are so skinny!\" or \"you could fit into this bag! (A cashier said at a grocery story about a year ago.\"\n\nImagine how happy you would be if everyone was constantly asking you, \"Are you pregnant?\" Wtf?!?!? I feel very depressed now. \n\nI guess I just want reassurance thar I don't look obese? (I'm not actually in that weight range, according to BMI)","score":456,"num_comments":100,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"17auz9g","author_hash":"7efd1f5cef79575a2583a5a4ecc51eb09375c962595408e482170877582e9d69","created_utc":"2023-10-18T16:32:49+00:00","title":"what do you guys think about the current criticism Halle’s about her pregnancy with DDG?","text":"I’ve seen so many tweets where people are acting like it’s the end of times, which I kind of have a neutral stance on, since we don’t really know these people and she seems extremely happy and excited!Plus she's said multiple times that she would love to have children\n\nwhat do y’all think?\n\nedit; I want to reiterate that I opened this post to discuss the criticism itself on social media and not her being pregnant, because that is her choice and hers alone, so I’m not encouraging any hate towards that!!\n\nedit2: i also wanted to make a point that halle has made so many accomplishments outside of her personal life, where people can still look to that and feel inspired, and there will be more milestones for her i'm sure, but i feel like people who think her pregnancy will affect her career life have to understand that its also public perception and criticism that can make or break a career (in addition to how much of her personal life she wants to put out there), not just the action of having a child alone!","score":158,"num_comments":322,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1kwb6px","author_hash":"ea1e1b46b5fa18faedb993890d8fd3d76562a97593e1f3f6806f6c8921cd1117","created_utc":"2025-05-27T01:30:56+00:00","title":"I’m pregnant again, and remembering how I was treated during my first birth as a black woman","text":"I’m pregnant again, and I can’t stop thinking about how dismissed I felt the first time. My pain tolerance was being tested more than mine and my baby’s health was being prioritized.\n\nBlack maternal mortality is not just a statistic, it’s something I felt. In all the ways I was brushed off, and in every non-response, as well as every rushed interaction. I want to enjoy this pregnancy, but honestly I’m scared.\n\nOne thing that still sits with me from my first birth is how much more respect the doctors and nurses gave my husband than they gave me. I was the one pregnant. I was the one in pain. I was the one asking questions. Somehow they explained things to him because I was too “hysterical.” The one time the room quieted down and people started moving with urgency? When my white husband raised his voice after becoming angry about the lack of urgency that he picked on. It still messes with me. I know what I felt, and it wasn’t just me being emotional. It was them not taking me seriously until he said something.\n\nI now feel like I am carrying this silent fear, and just dreading the day I go into labor. ","score":245,"num_comments":31,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black","black maternal","black woman"]}
{"platform":"reddit","community":"r/blackladies","post_id":"16ge22x","author_hash":"b25a17ea4e7af46aaa8a1f874c85760f2777fb91e69d9e8762461d76c61ded76","created_utc":"2023-09-12T01:37:57+00:00","title":"We not..normalizing smoking while pregnant, is we?","text":"I am not drug shaming, I’m literally blown rn but I’m just wondering fr\n\nRight now (don’t judge me, i work a 9-5 dammit i need something lol) I’m watching Zeus and watching their show (bluface and chrsean), the episode literally opened with her smoking a Backwood. She pregnant \n\nWhen I be on tiktok, I see so many videos of Blueface and Chrisean on my fyp. There was one time I saw a video where she was going to live with Glorilla and was rolling a Backwood. \n\nUsually in the people in the comments that say things like “I had to smoke while I was pregnant too. I wasn’t hungry I could eat anything until I smoked” or “ my doctor told me to smoke weed”.\n\nI’m a stoner myself, but I know if I were to get pregnant and smoke weed, especially backwoods, it CAN have adverse effects on the baby. It wouldn’t be anything for me to stop and I don’t understand (well I do, addiction) why are some people can’t just stop for nine months? I feel like this common knowledge, but for some reason a lot of people don’t want to believe that. Smoking any inhaling any kind of smoke would affect the baby regardless of the origin. \n\nIono. If any of y’all were pregnant or knew somebody pregnant did they doctors tell them or y’all to smoke weed? Did this affect anything? Are there really no effects of smoking weed while pregnant?\n\nEdit: For context, I’m talking smoking throughout the entire pregnancy, not smoking and you didn’t know you were pregnant, found out, then you stopped.\n\nEdit: grammar fixes\n\nEdit: I want to add something. If these doctors are telling their pregnant patients to smoke marijuana off record, likely not noting this in their charts, would you not think this is weird? If something happens to the baby and the mother wants to take legal action, do you honestly think that the doctor would have noted them recommending Weed to the mother? Would you think that this phenomenon also contributes to the high mortality rate of black women and children during childbirth?","score":280,"num_comments":126,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"15j3mmc","author_hash":"c3897e1113069d3a20d2836b986548f9a7de6fe0b3afb32deb8e08046cc9e2aa","created_utc":"2023-08-05T18:58:36+00:00","title":"Male OBGYN questioning why women only want to work with a female OBGYN","text":"For the women that saw the TikTok video created by Dr. Johnson complaining about women only wanting to work with a female clinician, what are your thoughts?\n\nAll of my clinicians are female. The only reason my dentist is male is because female dentists are scarce. I’m currently trying to find a female orthopedist.","score":292,"num_comments":122,"likely_black_context":true,"matched_preg_terms":["obgyn"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1caiaa0","author_hash":"6b9e7539d88c3581f92e835c6c832010b5ad8bb231451448fc316d4a207772b0","created_utc":"2024-04-22T18:30:12+00:00","title":"IM PREGNANT! So happy🤰🏽🥰 👶🏽","text":"I’m so happy! I think it maybe an eclipse baby too! I’m only a month in so I haven’t told my family yet (only my sister and brother). But it’s so hard not to be joyful and bust out the good news. I had my first beautiful baby alone. I was trafficked and my trafficker impregnated me. Then after my C-section I was told I had a condition that makes it harder to carry again. So my family will be excited to hear that I’m expecting again and this time with a decent man, my fiancé. 🥰\n\nI’m finally going to have a legit family. I’m so happy idk how to feel. My baby is going to be a big brother 🥰\n\n","score":423,"num_comments":45,"likely_black_context":true,"matched_preg_terms":["c-section","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1kn9u4h","author_hash":"0dfa3b6e753a5c13651baf14022da6c1551d97ab8debfade030d9f118b7d9560","created_utc":"2025-05-15T14:38:07+00:00","title":"Concerns Regarding Getting Pregnant in the US","text":"Hi everyone. I really just need to pick the brains of folks who don't know me and can therefore be a bit more objective about this.\n\nSo I'm getting married soon and entering a new phase in my life. My fiance and I are looking forward to enjoying some time to ourselves, but ultimately have the goal of starting a family. Our original plan was to start trying for our first kid by the end of next year, but with the election results, our plan has sadly changed. Black maternal healthcare in the US already sucks on a good day with a decent administration, but feels especially scary under this one. Plus I live in PA, which isn't necessarily a red state, but also isn't a blue one.  \n  \nI've been bummed about it since I really want to be a mom and am worried about putting that off longer (I'm 29), but also don't want to put myself in danger of not delivering safely or getting in legal trouble if god forbid anything went wrong and I needed an abortion. My soon to be MIL has tried telling my fiance and I that we shouldn't let all that's going on deter us and put our lives on hold, but I take this opinion with a grain of salt considering she really wants more grandbabies and is an older white woman who doesn't seem to fully understand the dangers associated with black maternal healthcare in this country. That being said, my mother (who is an older black woman) ended up saying something similar and that she also does not want to see me put my life on hold, but to ultimately do what's going to feel right for me.  \n  \nSo I just want to ask all of you, what would you do if you were in my shoes? Or if you are in a similar boat with switching your plans/feeling hesitant, what are your thoughts about this? Would you hold off for this essentially unknown period of time or would you go forward with it? And for anyone who would go forward with it, what would make you feel safe enough to do so?","score":39,"num_comments":42,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black","black maternal","black woman"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1gltnup","author_hash":"52c7504ad74639c537f0bf3f3d571c7a22672e060117025de971481f8da7c380","created_utc":"2024-11-07T15:54:38+00:00","title":"I’m pregnant again after my 2nd abortion and I don’t know what to do ","text":"I hope I can post this here.. I just want advice from other black women who may have experienced the same. \n\nBefore you say anything, I know. I am stupid. How could I let this happen again?! My life plan has always been to get married first and then have my babies. I’ve always wanted to have babies, ever since I was a little girl. I was the little girl that said I would NEVER have an abortion. \n\nI‘ve lived a very sheltered life and was mostly homeschooled due to bullying. This brought on insecurities and I didn’t start dating/putting myself out there until I was 24 and experienced “a glow up”. The first guy to ever ask me out, I gave my all to. He was my first kiss and, to this day, my first and only sexual partner. He has 2 kids from a previous relationship, which I didn’t judge him for. I lost my virginity and found out I was pregnant shortly after. It all happened so fast and I decided I was not ready yet and had an abortion. The guy and I were more compatible as friends, but I could never seem to truly end things with him. I did NOT set healthy boundaries for myself. 80% of the times we had sex was because he would wake me up at 4am, pulling my underwear off and I didn’t say no. When I think back to how much shit I went through, it was sooo unnecessary. \n\nIn December of 2023, (now 28) I got pregnant again by him which was a huge wake up call. He was verbally abusive towards me and I just KNEW that I couldn’t have a baby with him. Sadly, I went through with a 2nd abortion and the depression that followed. I cut my ex off and was DONE. I somehow came out shining and started dressing up more and getting a LOT of looks from new guys. I fell hard for this new guy, but after telling him I wanted to wait to have sex, he suddenly stopped talking to me for weeks. This broke me, and of course my ex reappeared at this time. He needed a place to stay for the night and we had a long, forgiving talk. I made it clear that I want no romantic relationship with him and he understood. We smoked and fell asleep, and yet again, I was woken up at 4am to him kissing on me and pulling off my underwear. I remember thinking, “Fuck it. It’s been months without sex, I’m young and nobody owns me and we have protection.” And had sex with him. It wasn’t even enjoyable, but I felt empowered. Oddly enough, the guy I was talking to messaged me and apologized and we reconnected. I forgave him but felt confident knowing I’m a free woman and can date who I please. Wrong. \n\nYesterday, I found out I’m pregnant. I really REALLY don’t want to have another abortion. I’m 28 now and I feel like it’s time. I want this baby. But i also know I do NOT want a baby with my ex. Im not married yet. At this point in my life, he’s not even someone I want to be friends with and I was so self-neglectful I’ve made some horrible choices for myself. He’s not financially in a place to take care of the babe and he also has 2 other kids. I feel so ashamed and stupid right now, but mostly strong for this baby. I just didn’t want it to happen like this. What should I do? \n\nTLDR: pregnant by ex that I know I don’t want to co-parent with, but I really want this baby. I’ve barely experienced life tho or what it’s like to date other people ","score":0,"num_comments":79,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1gblqyx","author_hash":"7f9eec7a45f52cc5d87be17ccc7040d6c0f077f9c9f806c1ad37545c725bb577","created_utc":"2024-10-25T04:08:20+00:00","title":"My sisters pregnant and I’m not happy. Please tell me if I’m wrong (vent)","text":"Looking for advice, someone please tell me if I’m wrong…\n\nMy sister is pregnant. I’m 26 and she’s 21 and while babies are a blessing, I’m not going to pretend that I’m happy about being an aunt.\n\nFor one, my sister is with a man who is the same age as me. They haven’t even been together a year. He has told her multiple times that he hates her, calls her out her name, is controlling, and is already a deadbeat dad to a eight year old and as you can guess, told my sister he’s not going to be there for her.\nMy sister complains about him to me and my family but claims she loves him and makes no effort to leave him, even after he tried to kick her door down. My sister had a miscarriage in February and I told her that she really needs to use protection. I’ve told her this multiple times and told her that STDs are still very much a thing and she barely knows this guy but she always claimed that it’s fine because she was on birth control.\nThat aside, my sister lives in a tiny apartment with no furniture. Barely any cooking utensils and an air mattress. She has no stable job because she job hops and can barely afford to care for herself. She relies on me and my parents for help, even toiletries. And as much as I love her, she’s not mature enough. She’s still in her party phrase and has a lot of maturing to do. She said that my parents can help her and that she understands it’s her responsibility and she is mature because she’s 21 but she really isn’t. I know her and I know she’s not ready and me and my parents are basically gonna be the ones raising this child. She had a puppy that she ended up giving away because she couldn’t handle it even though I ended up raising it.\n\nThat’s really the core of why I’m so upset, if she was working/going to school and with someone who loved and cared about her I’d be upset but I’d be supportive because Ik mistakes happen. But because she’s doing nothing with her life and having unportective sex after I stressed to her how important it is and especially with a guy who said he hates her and is already a deadbeat, it just reinforced that my sister is still immature. After I told her how I felt about her decision I guess she told my mom and my mom told me I need to put my feelings aside and support my sisters because she wished she had a supportive sister when she got pregnant (she had me at 17 my dad 19). My mom even had the nerve to say that I don’t always listen to advice my parents give me and I’m not perfect but I never said I was and me not listening has never led to me bringing a child into this world when I know I can’t support it.\n\nBecause of all of this and because I know how this will end up, I can’t say I’m exactly supportive about the circumstances of me becoming an aunt. I know it’s no longer about me or my feelings, but my future niece or nephew. I know it’s my sisters life but I still find myself feeling disappointed that she’s accepting the bare minimum in her life like this. Please tell me, am I being selfish for feeling this way?","score":113,"num_comments":45,"likely_black_context":true,"matched_preg_terms":["miscarriage","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"brdyal","author_hash":"eb5bf3a2e4e26272f9784919efd41d92224719f22e23cd04f2cf94d74fb268e7","created_utc":"2019-05-21T18:25:44+00:00","title":"Black and pregnant? Bring on the hate","text":"I currently live in the Midwest and since I’ve gotten pregnant I’ve noticed the way that white people treat me has generally gotten significantly worse, particularly when I’m with my white husband and from older white people.\n\nWe used to go places and get some stares before my pregnancy but now pretty much everywhere we go we get old white people hate stares and comments. The worst was Mother’s Day (my first). We went out to brunch and the old white lady sitting behind us stared the entire time and said within earshot “disgusting, what a waste”. My husband didn’t hear it and I didn’t tell him until much later knowing that he would have gone off on her in that restaurant full of white people and I didn’t think I could emotionally handle it in the moment. \n\nWhen I’m alone it’s also bad, in my mostly black neighborhood and at work (all black, female co-workers which is incredible) I feel safe but when I have to drive out of the city to go to school or to my internship the staring and off handed comments begin. “Daddy’s not around I’m guessing?” And all the nasty staring and whispering. \n\nI’m just getting sick of this, this pregnancy has been super emotional for me so this is all hitting me much harder than it would be if I were not. Before getting pregnant we were planning on moving to a more progressive state but until I finish grad school we’re pretty much stuck here.\n\nI wish it didn’t get to me as much as it does.","score":368,"num_comments":124,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1gq7k5v","author_hash":"4bfc743f2a41da02738aa76a95ecaf50686f34143f6e270be686053da3d1a22e","created_utc":"2024-11-13T07:28:04+00:00","title":"these bum a** n***** gotta leave these young blk women alone!!","text":"they got flo milli yall 😔\n\nlike LEAVE EM ALONE\nGET A JOB!!\n\nwhy am I seeing so many young black female celebs getting pregnant by bum dudes. not even married 😔 just straight raw dogging 😔 at the height of their careers 😔 \n\n idk yall am I the only one seeing this trend? do yall see it too?","score":1096,"num_comments":444,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"110w2ov","author_hash":"67cc8f05855eca0a1d4ba4ae491a5332cd5f839e910b5326b7c6fe7563e7fd5e","created_utc":"2023-02-13T01:36:41+00:00","title":"Almost scared to ask but is Rihanna pregnant again?","text":"Y’all watching the halftime show? I know it’s tough to drop baby weight but that belly rub has me confused.\n\nETA: Her reps confirmed pregnancy! Congrats to the billion dollar baby! ❤️","score":231,"num_comments":73,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1fwhdfd","author_hash":"ae489857479287cd12b0f3989019d58563a4c17e876bcb34918ed52713c96247","created_utc":"2024-10-05T03:27:39+00:00","title":"My birth and postpartum care team are all Black women! ","text":"Ya’ll, I cannot tell you how much better of an experience I’m having. I feel like I’ve assembled the Avengers lol. My midwife, OBGYN, doula, and pediatrician are all Black women. It took months of searching and waiting lists but glory to God fr. I had a little scare today, I’m 23 weeks with my baby boy, and there wasn’t a moment where I didn’t feel respected or taken serious. Hell, we even giggled our way through the moments of stress together. My OB even printed out new ultrasound photos for me and my husband even though it’s technically against policy (she spent extra time making sure she got the cutest angles). Even during the exam, which was incredibly uncomfortable, I was repeatedly told I had full control to stop at any time and they made sure they had my consent with *every single step*. My baby and I are healthy, happy, and grateful.\n\nI hate that this is a privilege. I recognize that I’m in a position to be able to pay for practitioners outside of my network and make decisions without urgency. I saved up money for this and the peace of mind alone is worth it. I work within the healthcare field and definitely had to tap into my connections to get the referrals I wanted. \n\nThis experience only solidifies my passion for supporting and connecting other Black women to resources like this. I want this for every Black woman, pregnant or not. We deserve this type of care!! ","score":347,"num_comments":11,"likely_black_context":true,"matched_preg_terms":["doula","midwife","obgyn","postpartum","pregnant"],"matched_black_terms":["black","black woman","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1m4weer","author_hash":"1207da6adcb6cd57d038db338b3bd7c78a7278380efaf54d58f96b0ce1a8d633","created_utc":"2025-07-20T18:34:54+00:00","title":"Boyfriend wants the abortion","text":"I’m so upset cause I wasn’t trying to be another “stereotype”, but I recently found out I am 6 weeks pregnant. *nothing is wrong with being a single mom, my sister is. I just didn’t see it for myself* \n\nI have always been pro choice so I thought I could get an abortion if the circumstances happened. Now that I am, there’s this odd feeling stopping me. It was an accident, we were using protection (obviously not correctly or something) and we’ve only been dating 3 months, we are both in school while working part time, he still lives with his parents , I live with my sister (but she has expressed willingness to house me and baby) and so logically this isn’t the right choice. He wants me to have the abortion, and I’m trying to understand and do what he wants cause it is his child too, but it’s hard. I have so many conflicting feelings, I really don’t want to raise a baby alone, and I think I would be. I know I can do it, but my life would be so much harder. I heard it’s better to regret an abortion than a child (which makes sense), and so it’s seeming like that’s the best choice. I’m not sure what I need, maybe advice? Has anyone been in my shoes? Did you have the abortion? Keep it? Please help!","score":430,"num_comments":379,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1ehqm7z","author_hash":"abec06fbe8c7c9427cefb05201c1784ca6b0041ba068e11ac386759f51b59994","created_utc":"2024-08-01T20:16:39+00:00","title":"I'm pregnant again and my mother hates it. ","text":"EDIT FOR ADDITIONAL CONTEXT:\n\n- We are financially okay, in our 30's, and homeowners. I did have to quit my job, but only after discussing and planning it with my husband first. \n- This is baby #3 (and our last) which we wanted for a long time and it didn't happened for us, so we stopped \"trying\". Turns out, that's the best way to get knocked up.\n- Aside from PPA/PPD and a failed epidural during my last labour, pregnancy/labour/postpartum was okay. I'm not a fan of the newborn stage in the slightest but I know it's short lived. \n\nAs for my mom:\n- My mom does not babysit (at all), nor does she contribute financially. \n- My mom has always had weird control issues, but I don't know any other cousins that don't have moms with control issues too. \n- She wanted us to have two kids max. We didn't agree but we also didn't tell her we were trying so I thought it was a non-issue until it finally happened for us.\n\nOriginal post :\nEven though I'm a whole ass grown woman in my 30s, when I told my mom the news she basically berated me on why it was such a horrible thing to have happened to me and that my husband and I should have been more careful (we were trying, and this is our last).\n\nShe kept going on about \"why would you bring a baby into this world?\" and \"your body isn't strong enough to do this again, you're gonna die.\"\n\nLike I get it, you're a sassy African woman that always speaks her mind but WHO SAYS THIS TO THEIR OWN DAUGHTER? \n\nY'all I was so incredibly excited until I told her and now I just feel deflated and super sad...","score":88,"num_comments":42,"likely_black_context":true,"matched_preg_terms":["epidural","postpartum","pregnancy","pregnant"],"matched_black_terms":["african"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1mlg6y7","author_hash":"438468c6c76e980965e863c3f86c3fcbf5f79bff566e15051470ee62dc290c90","created_utc":"2025-08-09T04:10:22+00:00","title":"Positive pregnancy story following myomectomy.","text":"Just wanted to share my super positive black maternal health journey in hopes of spreading hope and information. \n\nIn 2023 I was diagnosed via a pelvic ultrasoind with a fibroid in my endometrial lining that was making me infertile by impeding implantation. A fee other fibroids were also detected but this one, due to its location, was deduced to be the cause of 2 years of excruciating pain and heavy hemorrhaging. I didn't wait 2 years to seek help, but it did take 2 years to find a doctor who would listen and investigate my symptoms as opposed to dismissing me with BC prescriptions. \n \nLuckily I qualified for a hysteroscopic myomectomy since my fibroids were small. I had surgery in December of 2023. My doctor advised that I consider planning for pregnancy after recovery due to my advanced age (36) and high likelihood that the fibroid would return in a year or two. My cramps did improve, and the bleeding was less heavy, but I still felt off. \n\n3 months later we became pregnant but lost the pregnancy around 7 weeks. Traumatized, I refused to try again without more insights about my health. The medical doctors said that I could get extra fertility testing if we didnt get pregnant afte.a year or had 2 more miscarriages. \n \nI pivoted to a Natropathic doctor who specializes in hormonal health. She ran a comprehensive blood panel and discovered that I had severely low progesterone. She determine that without hormone supplements I may have recurrent miscarriages. In addition to progesterone she prescribed DIM and other estrogen balancing supplements. \n\nThree months later, we successfully conceived on our first try. I continued the progesterone through 15 weeks of pregnancy. \n\nI live in a predominantly white and affluent part of San Diego where the local hospitals do not have black OBGYNS. Luckily I found a phenomenal birthcenter with a black midwife and black midwife apprentice who managed my care. They provoded the most empowering and nuturing medical care ever. My pregnancy was smooth and low risk. I worked until 39 weeks\n\n\nAt 41 weeks and 4 days I went into labor at 3am. Thanks to the support of our birth team, which now included our black doula, our son arrived 13 hours layer via unmedicated labor. He was 8lbs and 21 inches of perfection. I had no tears or complications. Every desire in our birth plan was met and exceeded.\n\nMy son and I are thriving under their care. I've had postpartum care the the comfort \nOf my home. They're also the baby's care provider  for the first 6 weeks of his life. My midwife encapsulated my placenta and has been on-call 24-7 for any questions or needs. \n\nBlackmidwives save lives! Their care was extremely comprehensive. I had ultrasounds, genetic testing, blood panels and vital screenings throughout my pregnancy. At every visit I was served herbal teas and encouraged to rest comfortably on a queen bed during our hour long sessions were they provoded emotional support, lifestyle counseling, and extensive education. My husband, who is typically weary of anything medical, loved the visits too! They treated us like family.  \n\nI highly encourage other to seek midwifery care for their pregancies. You can see them in addition to or in place of your MD. At a minimum, work with a doula in your final trimester and during labor to advocate for you and provide support. \n\nOur doula is providing postpartum support when I return to work, which will help ease my mom guilt and anxiety over leaving my little one.","score":31,"num_comments":1,"likely_black_context":true,"matched_preg_terms":["doula","fertility","midwife","postpartum","pregnancy","pregnant","trimester"],"matched_black_terms":["black","black maternal"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1fzu5yt","author_hash":"faac269c0486a4453f414322a11fc6e154d61e1c4f26c80cef6acde15544a6d3","created_utc":"2024-10-09T15:30:07+00:00","title":"Postpartum snap back for Black women vs white women","text":"I’m currently 2 month pregnant w my first baby, so my feeds on my apps are all pregnancy lol I just wanted to ask if anyone notices a difference in postpartum snap back for different races? Obviously it’s different for each individual person. But I notice that ethic cultures tend to use stomach binders, fajas, and wraps; and they really help with bringing your insides back in. But with white women, then don’t do that at all and tend to just workout like 6 weeks postpartum or do nothing at all. I just thought that was interesting cus I’m definitely wearing a wrap for postpartum. \n\nEdit: ok maybe the term snapback is different for each person. I’m not referring to losing baby weight after giving birth. I’m talking abt when u give birth, your stomach and body needs time to go back to its original form. So I’m talking abt binding just ur stomach to support that process. ","score":0,"num_comments":40,"likely_black_context":true,"matched_preg_terms":["postpartum","pregnancy","pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1523s29","author_hash":"7887e2b7234f41ddff6a5eecf27dd1b48f460985ca94501935dafc07f85815bd","created_utc":"2023-07-17T14:38:41+00:00","title":"Just casually thinking about the time my doctors almost let my appendix rupture during my pregnancy. Black women get the worse care.","text":"Hmm.  Going down memory lane today.  Very traumatizing experience. I have endometriosis and the doctors knew. For months while I was pregnant I was having this random, severe right flank pains.  It was horrible. I would be absolutely disabled and unable to breathe. To the ER I would go and they would run the same tests over and over again then pump me full of morphine and send me home. At some point I was afraid to go back to the dr because I felt like they assumed I was drug seeking.  It finally hit a head at 9 months when the pain was so bad I was projectile vomiting. I went to the ER and told the dr about my pain. She didn't even touch me. Immediately dismissed me as having sciatica, sent me home with tylenol and left the room.  I went home and cried all night, I even popped a vicodin and it didn't touch the pain.  I called the dr line and she yelled at me over the phone. I eventually went back to L&D where they made me wait overnight in pain for a doctor even though they had doctors on the floor.  I cried all night and all but one nurse was so rude to me.  My temperature was rising, my baby was in distress and I was starting to dilate. I rolled around in pain, a nurse came in and yelled at me for moving the band, she slammed my hand down to my side when I reached up to touch my belly.   Finally in the early am the doctor comes in saying it's appendicitis and they need to do a caesarian and appendectomy. I was terrified.  Turns out I had a rare condition called decidualized endometriosis.\n\nMy baby was ok. When I finally came to, the same doctor that dismissed me tried to come in and check on me. I just stared at her and she backed out of the room.  They all downplayed what really went on. They knew they fucked up but I was too wounded to fight back. I just wanted my baby. \n\nI believe my abuse came from me being in a relationship with an older white man.  What should have been a joyous birth is marred by the abuse at the hands of the ones that are supposed to heal and nurture. Even the lactation nurses were not kind. \n\nI have an appointment next week to talk to a doctor on that performed my hysto two years later. I asked for pictures and more detailed and got none. I have so many questions and got no answers, no apologies. I feel stronger and more confident now. \n\nI guess this a vent post honestly. I did eventually report the way I was treated but it was just a we'll do training type message and that was it. \n\nMoving to Kentucky was the worse mistake I could have made. Kentucky has not been kind to me since I've been here. \n\n&#x200B;","score":324,"num_comments":25,"likely_black_context":true,"matched_preg_terms":["lactation","pregnancy","pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1gcugm4","author_hash":"e4c1b347f8173a2e564a5c800f83ad3842d7133622145ac5fdec619e17054a31","created_utc":"2024-10-26T20:44:10+00:00","title":"My baby’s nursery is almost complete.","text":"I’m 5 months pregnant with my first child. A baby girl. Her name will be Sumaya. I’m so excited. My husband and I live in a small 500sft 1 bedroom home. Here’s our baby’s nursery so far. Any parenting tips or advice for a first time mom would be great. I can’t wait until my little mini melanin queen is here!! 👶🏽","score":1919,"num_comments":135,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1banpxy","author_hash":"167b3dc62c5217c51c01bae6863b546fe27e800fd81b510ee1ed7acaef25a7ac","created_utc":"2024-03-09T17:56:47+00:00","title":"my moms keeps rushing me to get pregnant ","text":"\nSo my (19f) mom keeps rushing me to get pregnant. At first I thought she was kidding but literally everytime I talk to her she asks if I have a boyfriend and if I’m still a virgin. I tell her no I don’t have a bf I’m focused on school and I’m still a virgin. She then goes on to say I’ll be a cat lady and she’ll never have grandkids. I told her you don’t even want to be a grandma. And then she got upset. My mom acts young which is so annoying as well. She had me at 19 too btw. I don’t have a close bond with mom at all. But the way she rushes me to get pregnant really really pisses me off. Should I talk to her or cut her off? \n\nEdit: I forgot to add she like to be shady and ask if I like girls/am I lesbian. Like what tf?\n\nEdit pt 2: thank you so so much for all the wonderful comments I appreciate it so much! \n","score":51,"num_comments":43,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1j7hd0g","author_hash":"5f12788d74bd297380868d7c1d659f797b210fe5e0299da75a572e770774a078","created_utc":"2025-03-09T20:51:51+00:00","title":"Subreddit for pregnant/black mums?","text":"Is there a subreddit for pregnant black women or black women that are already mums? \n\nI’m pregnant I already have kids, would just be nice to have a lil vent with other black mums as well as gain honest support and advice from a sister and not YT women who think they know it all! \n\nCan someone point me in the right direction please 🙏🏾 ","score":26,"num_comments":11,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1jui6z6","author_hash":"f41d536e788e189c836af20e87c83cd00d677ed1ba8630d9cb08bba9a19a6526","created_utc":"2025-04-08T16:44:46+00:00","title":"Any help or recommendations for pregnant moms with fibroids","text":"My best friend is pregnant and just found out she has a fibroid. Any help or stories about dealing with this would be appreciated. She is 12 weeks and they said if it doesn’t grow it’ll be ok but still worried ","score":2,"num_comments":8,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1jccfoh","author_hash":"26873e76f5beea8b3b7386f591198879359575197fe713c836fe41a761a93cb1","created_utc":"2025-03-16T03:17:07+00:00","title":"Calling all ATL ladies: Equitable OBGYN’s in ATL Metro","text":"Hey everyone! My husband and I are hoping to move to Atlanta metro, and as we do our research, one of our concerns is the maternal mortality rate for Black women in childbirth in Georgia. If you’re in the ATL metro area, do you have any recommendations for OBGYNs who provide excellent, compassionate, and equitable care? We’d love to hear about your experiences as we prepare for this transition!","score":5,"num_comments":6,"likely_black_context":true,"matched_preg_terms":["obgyn"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"12aq4av","author_hash":"87cb467aa2a196001e353398bda8153e358a660b5b2c104d7eb87b2b57349bd8","created_utc":"2023-04-03T16:47:28+00:00","title":"How can black women protect themselves during pregnancy and childbirth?","text":"I’ve read many places that black women are three times more likely than any other race to die during childbirth. My mom told me it’s because a lot of black women don’t have healthcare but I think there’s more to it. I want children in the future so I would like to know of ways to protect myself so I can have a good and healthy pregnancy","score":91,"num_comments":45,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"17t1pwe","author_hash":"c0a7c42b0b7d206ae5e6e5f896e284bddda283149113bf5aa324c106ccab6d51","created_utc":"2023-11-11T19:26:21+00:00","title":"Just found out I'm pregnant. I'm cautiously excited, but I need some guidance.","text":"Hey y’all. \n\nI just found out I’m pregnant with my first child. I believe I’m at least 3 weeks pregnant. I am 32 y/o, married, and live in the Metro Detroit area. I know there are other pregnancy subs and I plan to peruse and interact on those as well, but I figured I would turn to here first. \n\nThis was not a planned pregnancy, but my husband and I had discussed an openness to kids eventually. Guess fate had other plans in mind. \n\nI’m not freaking out as I am comfortable with becoming a mother, but I am also very aware of the uphill battle black mothers face in our healthcare system, especially regarding our maternal health. \n\nSo my question is… what now? My OB/GYN’s office isn’t open until Monday. My current gynecologist is a white woman whom so far I’ve no issues with, but I would prefer a provider who is a black woman to work with me through my pregnancy if possible. I’m not having much luck through Google thus far. \n\nI also plan to give birth in a hospital, explicitly not Catholic hospitals. I am not comfortable with any sort of natural birth. \n\nAre doulas effective advocates for pregnant black women? \n\nAnyone in the Metro Detroit area or SE Michigan got any recs? Any guidance in general? Help lol. ","score":51,"num_comments":37,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black","black mothers","black woman","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1ct85xp","author_hash":"6a1d7173ed37ad3f6ca0f96373bb25b7048143d3dc6fd9052eb4f6de8e84e5f7","created_utc":"2024-05-16T08:30:32+00:00","title":"Pregnancy Cravings and Boycotts ","text":"I’m in the first trimester and I just want a McChicken so bad. I haven’t had McDonald’s since the boycotts started and it’s all I can think about. \n\nPray for me y’all 😭🥹","score":19,"num_comments":28,"likely_black_context":true,"matched_preg_terms":["pregnancy","trimester"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1hehnic","author_hash":"7f4ab8344b3779cc5fd4be982fb27a599070fe4d626b012296893c907ce88039","created_utc":"2024-12-15T01:19:49+00:00","title":"Am I overthinking this about my friends pregnancy? ","text":"Did it affect you in anyway growing up when your siblings had a active dad and you didn’t?\nI need to know if im overthinking.\nMy closest friend is pregnant, my nephew ( her 7yr old ) never had a father. He left when he was a baby, never got to know him / meet him.\nThe new baby will have a dad , however her man isn’t really active in her current child’s life. They know each other but he isn’t around him much because he works.\nI’m curious how other people felt growing up cus I feel like im overthinking worrying about how my nephew will feel when new baby comes.\nMy friend isn’t worried too much.","score":10,"num_comments":9,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1bl9s0q","author_hash":"89d23b28b55ccbebb8bf069172d002cbee5c7ae448a4c15773c4342718eea222","created_utc":"2024-03-22T20:50:34+00:00","title":"It's official I'm studying to become a doula","text":"I'm officially walking the walk and going after my dreams of becoming a doula. I want to specialize in postpartum because my sister's journey has endeared me. I want to help black women recover from childbirth and hold them accountable to their goals while nurturing them. I also educate black fathers. No more neglected black new parents on my watch","score":132,"num_comments":15,"likely_black_context":true,"matched_preg_terms":["doula","postpartum"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"r89wyw","author_hash":"8b32f0445f8159b528c0743a994254e12c1472150582a23a424803e1c0ba6aab","created_utc":"2021-12-03T21:45:54+00:00","title":"So Mr Third Trimester has done it again. All I want to know is.... why haven’t her family told her she deserves better","text":"Genuinely curious. Cuz I don’t understand how this shit is happening and they haven’t told her she’s a good mom and her kid can still be happy if they aren’t together","score":114,"num_comments":57,"likely_black_context":true,"matched_preg_terms":["trimester"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"tp8ac3","author_hash":"f9229dc61c7cd7eabe0284a1e744c9a9c259e01dae61a4042c4b48602c672fa6","created_utc":"2022-03-27T00:18:13+00:00","title":"Posted several weeks ago about my sister’s pregnancy and Just wanted to show off how beautiful she looked at her gender reveal. When I tell y’all she fought like hell to become a mom all for it to pay off in the end. She will soon be a mom to 2 beautiful girls!","text":"","score":423,"num_comments":18,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1icir1g","author_hash":"16880c2cf901b8b00a3a052842705bcb0bb3b942dd830fc9c2788997e47a1a2a","created_utc":"2025-01-29T01:52:48+00:00","title":"Has anyone done IVF?","text":"Hey, I am about to have my egg retrieval tomorrow and during all my shots and stuff I never bruised. I don’t think I’ve ever bruised in my life. \n\nMy question is have any of yall done IVF and bruised or not bruised. Or just any IVF journey stories. It would be nice to hear tales from people similar to me. ","score":10,"num_comments":3,"likely_black_context":true,"matched_preg_terms":["ivf"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1eqexfm","author_hash":"71d66bcdf8d8fe5523f1c2d55203762fe2c65b59195affcb554e8e1f9c14f69a","created_utc":"2024-08-12T14:17:51+00:00","title":"My thoughts on Black American Women. ","text":"After years of observation, I cannot express how much I appreciate Black American women, and this is just about the American girlies. I do love my African sisters but we need to do better when it comes to supporting the ladies in America. \n\n1. American BW are true social justice warriors both in person and online. I have seen the most hidden ethnic groups make very racist, ignorant and stereotypical statements on social media about black people but there is always that one or two BW that speak up, fight and defend us no matter what type of black person is being abused. \n\n2.  American BW have paved the way for all black people in western countries and have positively represented us in all forms of media, sports and arts. For example, BW directing their own movies, assisting the country with going to space, changing the medical field to bring attention to the death rates of women during pregnancy and promoted / started black owned businesses. \n\n3. American BW started the natural hair movement, black girl magic and melanin appreciation. I remember this one specifically because even here in Australia, they started selling darker foundations and featured dark skinned girls in their campaigns with their natural hair. (Yes, you are that influential) \n\n4. American BW bring unity wherever they go. I live in Australia and it took a Black American woman to start a sisters group that brought women from all over the country to network through events, promote their businesses and even assist women who need help finding housing and flatmates. \n\n5. American BW are extremely creative and cultured. Despite the history of lost identity for some, BW have managed to hold onto lots of African culture and have moulded it into a way that blends in with their culture, creating something timeless yet unique. Some examples: hair braiding, music, clothing, dance styles, slang, cooking etc. \n\nThese are just a few things I wanted to call out, there’s heaps more where that came from but I’m sure you all have better things to do. Please feel free to add more positive things about Black American Women that you know or appreciate. I’m so grateful for this reddit group and I hope all the women here have a lovely day, stay safe and always remember that black women (all of us) are the epitome of ethereal beauty, resilience, influence and femininity. 🖤","score":1124,"num_comments":152,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["african","black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1hrmfao","author_hash":"ae489857479287cd12b0f3989019d58563a4c17e876bcb34918ed52713c96247","created_utc":"2025-01-02T05:16:24+00:00","title":"husband made sure I got my hair done before giving birth","text":"This is 100% a *my man, my man, my man* post lol. I’m 9 months pregnant and in early labor. I’ve had to slow down and really take it easy to prepare for the main event (which is not my style). But my husband has been in full Dad mode. Cooking, cleaning, organizing, laundry, walking the dog… but most importantly, he made sure I got my hair done haha! Deposit? Paid. Bundles? Secured. Washed and detangled? He made sure to oil my scalp too. I didn’t even have to explain why this was such a priority for me, he just loaded my big ass into the car and made sure I was taken care of - contractions and all. \n\nWe’ve come a loooong way! I would throw it back if I could but I booked him a massage as a thank you instead. ","score":1510,"num_comments":77,"likely_black_context":true,"matched_preg_terms":["contractions","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"181f5jo","author_hash":"0dd6e30da9ac4daf6d882dde96768a9d4e9661ddcf38b03152d1d64f7f71fd50","created_utc":"2023-11-22T17:51:00+00:00","title":"What was your experience like with a black vs white OBGYN?","text":"I can be completely honest here because it’s anonymous. Yall I’m absolutely terrified.\n\nI’m 6 months pregnant with massive fibroids and I’m being told a vaginal birth is likely completely out of the cards for me (fibroids blocking birth canal). I’m in a Podunk town two hours away from a real city and everyone here is white. I’m scared to have a C-section. I’m scared my doctors are going to let me die on the table or dismiss my concerns because I’m black. \n\nThere’s a women’s clinic about 1.5 hours from me with 2 black OBs while my current provider is less than 10 minutes from me. I don’t have any tangible reason to believe that I would receive less than optimal care from them, but we know the statistics of black maternal mortality. How do I know if I’m just hormonal/dramatic, or if my concerns are valid? Is trying a new provider so far away worth it? Did you find a difference in the care you received just based on race? \n\nMy first visit was with a black OB and we really connected. That was the most comfortable I’ve ever been at the doctor. Then we moved states, and now it just feels like I go through the motions with the current provider (only a midwife so far).","score":20,"num_comments":29,"likely_black_context":true,"matched_preg_terms":["c-section","midwife","obgyn","pregnant"],"matched_black_terms":["black","black maternal"]}
{"platform":"reddit","community":"r/blackladies","post_id":"10cd05v","author_hash":"798778c9511844c98752e1f5bf1f95f8493ac854ee58f1d10d2bdf6220f6214f","created_utc":"2023-01-15T06:45:52+00:00","title":"TW: Fertility talk. What age did your mom have you? Does it give you relief or worry you?","text":"There's a lot of talk in the manosphere about women 'expiring' at 35, and most of it has to do with fertility which includes a lot of different factors that are often glossed over. Of course, most people talking the loudest are degreeless and particularly unqualified in the areas they choose to speak (health, biology, genetics etc). And no reading Dr. Sebi and Queen Afua doesn't count.\n\nAnd they don't include themselves when the studies finally show that AGING men aren't ideal. So all the 40-somethings who dream of impregnating a 20-something because she's more f*ertile and in her prime* aren't the best candidates either.\n\nWhether I want to or not, whenever I learn one of my friends is pregnant, I ask questions about how long it took. Because the closer you get to 30, at least for me, there's been much more focus on fertility. My brother-in-law and his wife were subtly telling me over Thanksgiving to hurry up and find someone because they are having issues  (they are almost 10 years my senior and have been trying for  5 years).\n\nNow in my head, I say their story doesn't have to be mine. **My mom had me at 36 and my sister two years later, so that has always been a sense of comfort (I don't know if it is a false sense of hope). Also, I don't have endo or PCOS, and I've never used BC (that's another topic). I've met women from all over the world via university (nursing students), and they usually don't share the same stress regarding age and pregnancy.** \n\nPart of me wants to say I don't care, but it is on my mind more often whether I want it to be or not because I'm just at that age where all my friends are getting married and having kids so the question is always asked about children and when I'm going to start.","score":26,"num_comments":44,"likely_black_context":true,"matched_preg_terms":["fertility","pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"16e5mnq","author_hash":"864938d6782279e40806cfd2c5bfccc2f39bd3fda0a5a7642d38f24eafe2550b","created_utc":"2023-09-09T13:20:37+00:00","title":"What do you guys think of this idea For black pregnant women","text":"Hey everyone, I'm constantly thinking of different business ideas. I went to school for culinary and pastry and I have two babies they are Irish Twins, I just had my son 3 weeks ago. \n\nSo I have been trying to find my niche in pastry and what I want to do specifically with it. But I was  thinking about how much I love nutrition. I loved the class, and I still have a good interest in it now. When I became pregnant with my daughter I was I looking at different cultures and how they do the postpartum period. Like the postpartum hotels in Asian countries and people who hire a woman to come to their home and help for a month with breastfeeding, and cooking nutritious food, and the mom's care. I also looked into African customs on this but I felt I couldn't find a lot. There is also the new, one and only boram care in NY that is a postpartum hotel. \n\nI have also have a big interest in pregnancy and birth. Even before I was in a relationship, even when I was a teenager it interested me and I loved learning about how a woman's body works. Since I've gave birth in a hospital being induced and in a birthing center with a spontaneous labor my interest in other women's care has grown even more. I know how for black women pregnancy and birth can be scary because of bad medical professionals not caring about us. I feel it's good to have a strong community to protect ourselves. \n\nNow that I've gone through all that background history, I had an idea to start this business that is geared towards pregnancy/postpartum nutritional health and offers birth doula's and other postpartum care. It can have a kitchen there to make meals for families after having a baby, have birthing classes, night doula's for when parents need some rest,\nAnd breastfeeding support. I am already looking into doing more schooling for nutrition and I have looked into doula training already.  \n\nI just want to know what other black women would think of this. Or am I crazy? I just needed to get this idea out of my head lol","score":63,"num_comments":21,"likely_black_context":true,"matched_preg_terms":["breastfeeding","doula","postpartum","pregnancy","pregnant"],"matched_black_terms":["african","black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1es49jk","author_hash":"0fef9f87ec700c189c19ce4bbff2c3c4f3c6d533941b4a3eaad418ba22240afd","created_utc":"2024-08-14T15:16:22+00:00","title":"Ohio Officer Is Charged With Murder in Shooting of Pregnant Ta’Kiya Young","text":"","score":34,"num_comments":4,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1dvjnja","author_hash":"0fef9f87ec700c189c19ce4bbff2c3c4f3c6d533941b4a3eaad418ba22240afd","created_utc":"2024-07-04T22:57:22+00:00","title":"In a scathing dissent, Justice Ketanji Brown Jackson says Idaho abortion ruling is 'not a victory for pregnant patients'","text":"","score":57,"num_comments":3,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1dqsato","author_hash":"0fef9f87ec700c189c19ce4bbff2c3c4f3c6d533941b4a3eaad418ba22240afd","created_utc":"2024-06-28T19:40:20+00:00","title":"Pregnant Eboni K. Williams Embraces Being a 'Single Mom by Choice'","text":"","score":24,"num_comments":6,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1cu2lwp","author_hash":"dd2a0de4a66c7f3526188bdf6d93c510dc505639554196057886071e4fab1ac6","created_utc":"2024-05-17T11:15:48+00:00","title":"C-section vs. natural birth ","text":"so i’m pregnant and trying to get an insight on ladies who have both had a c-section and natural. how did you feel after? how is the healing? and which did you prefer? TIA","score":5,"num_comments":10,"likely_black_context":true,"matched_preg_terms":["c-section","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1enya1h","author_hash":"fbe7bbf5bac340d7ea27ca9e60a6a2d5e267a89228f1e0413ffcf062b84fc07b","created_utc":"2024-08-09T12:21:46+00:00","title":"Pregnancy Acne: Tips/Advice?","text":"Hi everyone, I am abt six weeks pregnant (I can’t believe it) and my skin is starting to act up.\n\n I have never been into skin care cuz my skin has always been pretty good but now that I think I might need it, I’m learning that a lot of ingredients in skin care are not safe for pregnant women. \n\nMy face constantly looks pretty ashy despite my usual lotion and it feels rough to touch like tiny tiny bumps.\n\nAny recommendations or advice? Weather it’s natural stuff or products that have worked for you guys. \n\nFor a little more context I have a caramel skin complexion and my skin is usually oily but now it’s always dry.\n\nThank you! ","score":9,"num_comments":5,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"18xltcn","author_hash":"aa30d000cf2fcee6a03bdbc5259bdd113559bbba4667be2037e3ffa8f3d1dd39","created_utc":"2024-01-03T15:20:23+00:00","title":"Breastfeeding and intimacy","text":"So I’ll be a new mom in July and I plan on breastfeeding my baby. Something I always thought about, even before being pregnant myself is if it feels weird being intimate with your man using your breast when you also use your breast to feed your baby? I think I always wondered this but never knew how to ask the older woman in my life, especially another black woman lol!","score":9,"num_comments":17,"likely_black_context":true,"matched_preg_terms":["breastfeeding","pregnant"],"matched_black_terms":["black","black woman"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1k6bh1c","author_hash":"66ee66193b5432264025943fe59d3e3871a6f040cc5ad4b50de88e136930c0fb","created_utc":"2025-04-23T21:50:20+00:00","title":"Am I a weirdo for wanting to play with dolls as an adult?","text":"I’m in my 30s and played with dolls as a little kid. Of course by my teen years, I stopped. Became an adult, got married, had a kid, realized I’m “one and done” when it comes to getting pregnant. I finally feel sexy again, body snatched, health is good, life is good, my kid is an awesome preteen. \n\nBut every now and then, I wish I had a baby doll! Like a reborn, lifelike doll. To play with, hold and dress up. The stigma behind those dolls is that they’re for “sad moms” and being black, I can see my family and friends not getting it. & I don’t want it if I feel the need to hide it. So I just forget about it until the next time I think of it again. They’re so cute! 🥰 Why can’t adults play with dolls in peace?? ","score":326,"num_comments":160,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1g8y551","author_hash":"9fd6164fea17e30dac8b4797d506605fe4350bd8d731d165dec1f22a86c4c3e5","created_utc":"2024-10-21T19:17:38+00:00","title":"I Might Be Pregnant or Stressing Myself","text":"So, I don't know if I'm just stressing myself or if I'm actually pregnant. (19F) The last day of my period was October 8th, and either the next day (oct9th) or the day after that (oct10th) I had sex. He didn't pull out, and I have a 29 day cycle. I really don't know if I ovulated or not, because I don't really understand how the ovulation part works tbh. Also, yesterday my body started acting very wonky and weird. That's what caused me to start stressing about it.","score":1,"num_comments":0,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"12i8iur","author_hash":"cd889010e0b45df8535227b3dbd70a111af0336b911bd2ce716d78051d5d02c3","created_utc":"2023-04-11T04:38:14+00:00","title":"Training to be a Black Doula!!!!!","text":"I am excited to say I have registered for training with National Black Doulas and start my training in June!!!! I am crying tears of joy right now. I was inspired when talking to my best friend and we were discussing having children and being a Black woman in need of medical attention. I decided to become a doula to assist her in her birthing to make sure she does not become another statistic of the negligent health care system. I also plan on doing postpartum training as well after i complete my certification in birthing! Just wanted to share this Black joy!","score":190,"num_comments":9,"likely_black_context":true,"matched_preg_terms":["doula","postpartum"],"matched_black_terms":["black","black woman"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1eci5g2","author_hash":"ae489857479287cd12b0f3989019d58563a4c17e876bcb34918ed52713c96247","created_utc":"2024-07-26T07:30:27+00:00","title":"Pregnancy protective style? Pls help! ","text":"I’m in my second trimester and it is *tough*. I loved short cuts these past few years but I’m not allowed to cut my hair while pregnant/postpartum and my curls have grown out so fast. Currently rocking straight backs but I’m so sweaty and itchy, they’re terrorizing me. I hate the feeling of them on my neck and I’m very uncomfortable.  \n\nAny style recommendations? I’m a 4a/4b mix. Looking for something breathable and looks cute above the shoulders. My cousins keep calling me Cleo and giving me directions to banks lol. ","score":4,"num_comments":5,"likely_black_context":true,"matched_preg_terms":["postpartum","pregnancy","pregnant","trimester"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"15c4jpn","author_hash":"b3e1390a3e7eb2e3a5cb437c2d99941a18dc9a44d718f67ad908e0b1fc6bc336","created_utc":"2023-07-28T18:02:24+00:00","title":"I had my first pain free pelvic exam with a Black OBGYN","text":"Ever since 2015 (I’m about to turn 29 this year) I’ve been having a slew of health issues. It’s been a struggle to find doctors who genuinely care and are attentive and empathetic. I have a diverse team of doctors now that are great but my OBGYN visits have always been traumatic. I was diagnosed with vaginismus and hypertonic pelvic floor dysfunction and I’ve had this since I was 9 y/o. I would scream during pelvic exams, avoided using tampons, avoided relationships (I’m asexual but not sex averse) because I know I wouldn’t be able to meet my potential partners intimate needs. My old OBGYN referred me to a uro-gynecologist who suggested I get pelvic floor therapy. It need help me control my own pelvic muscles and they’re spastic I have a lot more work to do. But I transferred over to a Black female OBGYN near my school and I was still so nervous about pain. But I saw my mother and the other women in my family have horrific pregnancies and reproductive care and knew it was time to have the right OBGYN on my care team. \n\n I asked her with such embarrassment to use a the smallest speculum and use a lot of lube and she actually did it and I experienced no pain just slight discomfort which I was to breath through (something I learned in pelvic floor therapy). I nearly cried. She listened to me, and my whole story, included me in my care was honest but empathetic. I told her that and I know it touched her too. \n\nI’m almost 30 and just know had a pleasant experienced at an OBGYN and that’s tragic but I’m also proud of how far I’ve come. Ever since my cancer diagnosis I’ve been more deliberate of who I have around me and who is handling my care and I’m so glad I took the time to find the right OBGYN. Idk if I have the courage to ever be pregnant one day due to the trauma of seeing my mother and other family members suffer horrific pregnancies but for once in my life I feel safe with an OBGYN enough to have that discussion in the future.","score":175,"num_comments":6,"likely_black_context":true,"matched_preg_terms":["obgyn","pelvic floor","pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1jyuqmw","author_hash":"ae489857479287cd12b0f3989019d58563a4c17e876bcb34918ed52713c96247","created_utc":"2025-04-14T09:30:25+00:00","title":"I fractured my pelvis giving birth and nobody listened","text":"TW: medical racism \n\nI am in the US and kept insisting that my pain was not normal but it was dismissed repeatedly by the White doctors I’ve had to see postpartum. They plainly stated that they thought that I was exaggerating my pain levels and to try calming down to see if that helped. My husband had to step in and strong arm them to give me comprehensive exams. They even remarked that they were caught off guard that “the whole family” attended my appointments. Well, lo and behold, my pain is not normal and I fractured my pelvis during birth. I haven’t been able to walk, breathe, or sleep comfortably for weeks. Sometimes the pain is so bad it radiates down my legs and makes them numb. I am frequently in tears and morale is pretty low some days. And they did not care until my White husband made them do their job. \n\nI’m so upset, but not surprised, that this is how I was treated. I carefully selected my medical team for this reason but insurance would not approve “specialized” postpartum care or imaging referrals from my midwife so I had to switch providers. I’m looking at months long wait lists for the type of PT I need, possible surgery, and my job is at risk as I’m temporarily disabled but no longer a protected employee - all *while* still being in debilitating pain and keeping my child alive. I fear I have a long road ahead of fighting to get the care I deserve.\n\nYa’ll get it. I’m exhausted.","score":918,"num_comments":60,"likely_black_context":true,"matched_preg_terms":["midwife","postpartum"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"zdk9zd","author_hash":"7491283f004c6ae30a3b3d42ffc48d0cf0e26394d8d172d347c6a1de723a759a","created_utc":"2022-12-05T21:25:33+00:00","title":"My toxic african mom accused me of being pregnant at 16","text":"I've always had straight A's, loved by all teachers, never had physical contact with another male or relationship (God knows I haven't!) and anti social + shy. But that doesn't stop her for being bewildered like always. \n\n\n\nToday I woke up feeling nauseous and extremely bloated with burning stomach pain and weird rotten eggy belching. I got dressed for school but I knew my gut was telling me that I should stay home and see a clinic. (I've been absent for 2 days last week because of it)\nThe symptoms would come and go which bothered me and made my anxiety worse. \n\n\nI made up my decision to just return to school tomorrow and to tell my Dad about the recurring symptoms. He called my Mom and that's when my soul dropped.\n\n\nShe looked very aggravated as always, she hated the thought of me not going to school, and being sick was usually not an option for me to stick around at home. (Only when I'm experiencing pretty nerve racking gastrointestinal issues)\n\n\n\nBefore I could even say a word- she throws in a lot of hurtful things.\nShe starts shaming me on missing school for almost 4 days, and that I should immediately go to urgent care to get a PREGNANCY TEST and starts spewing that I'm probably doing sexual intercourse with guys at my school, and that I apparently keep it a secret and don't wanna tell her.\n\n\n\nI keep on reassuring her that I never had sex, nor even been in a relationship- but she ignores me while my Dad has already scheduled an appointment for an actual urinary test for pregnancy. Her special saying is \"Well you never know, you can always be lying and being dirty\"\n\n\n\nThe whole process was just painful, I ended up going to the urgent care full of a bunch of stares and looks, my results came back negative and the doctors and nurses were surprised that I was so young while doing something like this.\n\n\nI felt ashamed of myself for simply being there, I don't know if I suffer a food intolerance or IBS- because i've been eating less but nothing seems to change. The next available appointment for actual lab work and blood tests with a pediatrician would be in January ): so I'm stuck going to school and suffering until then.\n\n\nI just wish that I had the luxury of being loved and cared for by a black mom, I envy those who have caring moms that they can hang out with or spend quality, beautiful time.\n\n\n\nIt hurts everyday being neglected like this, my Dad is 58 but still working hard, and I have 4 other younger siblings (youngest is 6M infant) that he usually takes care of most of time.\n\n\n\nI use the opportunities I have in education to seek a career and a happier life, but I'm just in a very dark and painful situation, I have one great friend that helps me through times like this. But my Mom is one of my greatest enemies, and sadly I'm still living in the same roof as her.","score":47,"num_comments":27,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["african","black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1l5pu8m","author_hash":"d8da2aa73d5d1f301a42027c26e4ffabf76cad4645cb5f28bd6bc3afdbed3b65","created_utc":"2025-06-07T17:10:15+00:00","title":"Thoughts on the Halle Bailey/DDG situation?","text":"DV & PPD mentioned ‼️\n\nI find this entire situation so incredibly sad. We all suspected/knew that DDG is not a good man, but I didn’t want us to be right. Seeing those texts was absolutely heartbreaking and to see Halle be called “crazy” by men all over the internet when she was/is suffering with postpartum depression is awful and I cannot imagine how that feels. What I see in those texts is a woman suffering and crying for help. And to see people constantly denying the abuse she’s faced is even worse, but sadly expected because of how cruel people on the internet (and irl)  are.\n\nUltimately, we as Black women and women in general have to want better for ourselves as well. IMO, the Rubi Rose situation should’ve been the last straw and I really wish it was because she has a baby and is tied to this horrible man for life. \n\nI want so much better for us.","score":205,"num_comments":162,"likely_black_context":true,"matched_preg_terms":["postpartum"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"18kqjrs","author_hash":"4fa41bd6db7706222900277722c0214cc68a6fe57a7288c671362d93fd71cc42","created_utc":"2023-12-17T20:34:27+00:00","title":"Early pregnancy fears","text":"At 33, I’ve finally gotten my first positive pregnancy test ever. While I’m excited for what’s to come, I’m also extremely worried about a miscarriage. \n\nWhy post here? My friends just take for granted that everyone they know are super fertile and never have issues. My mom and a few aunts only had 1 or 2 when they were much much younger, and the other aunts struggled with fertility. I’m grateful finally knowing that I can get pregnant, but don’t feel like my immediate circle can help right now.  \n\nDoes anyone have any tips on quelling the anxiety in the early pregnancy stages?","score":13,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["fertility","miscarriage","pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"smyyd0","author_hash":"f9229dc61c7cd7eabe0284a1e744c9a9c259e01dae61a4042c4b48602c672fa6","created_utc":"2022-02-07T19:45:42+00:00","title":"I’m a 29 year old woman with 2 children (7 and 3) with a 33 year old older sister who has struggled with infertility. She has had countless miscarriages and thought she would never be able to conceive.","text":"She has been such a constant source of support and love even though I know that it hasn’t been easy for her to watch me enter into motherhood. Last year she had an ectopic pregnancy and had to have one ruptured fallopian tube removed. She thought that was the end of her chances of being able to conceive, but a couple weeks ago she found out she was pregnant. Today she found out she is having TWINS!! I’m so excited to support her through this journey and watch her finally get to live her dream of being a mother!","score":186,"num_comments":17,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1bb1yil","author_hash":"e24bf2433940365b5bc09de24dd400f5e283408547fad16398a05ddb205c3716","created_utc":"2024-03-10T04:52:12+00:00","title":"The grades I earned 7 months pregnant-my Junior year","text":"I just came across this. At first I thought it was the report card my stepmother DELIGHTED in showing my kids (20+ years later-to prove how awful I used to be 🙄) . That one was really bad, from my freshman year when I failed everything but math and art (I only passed art bc I wrote fake grades in the teacher's grade book while she was in the hallway gabbing). \n\nThen I saw them 90's boy! This was a while different resort card, and I was killing it! \n\nThis dope report card was after I was sent back to NY bc my uncle found out I was pregnant and wasn't trying to keep me anymore 🫤. I really appreciated the opportunity he gave me and took my schooling seriously. My first two semesters (w uncle) I earned near perfect grades, but they didn't count when I came back to NY bc I earned them in another state. \n\nThat 75 was in a 10th grade English class that I could do with my eyes closed, but the teacher just handed us worksheets every day, didn't even talk to us. No idea why he gave me a 75. I did his stupid worksheets in 5 minutes every day. \n\nThey busted me down from honors and \"regents\" Classes to 'school level' Bc I was pregnant.  But I figured I needed to kill the classes to turn my life around, and I did. \n\nNot sure of the point, but wanted someone to see my olld a$$ report card 😁\n\n","score":49,"num_comments":5,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"c0vxg8","author_hash":"bfa994e4c2fd50b4a0dd191955b94a8d3a5b9517560b1b57aab6d625045aaee6","created_utc":"2019-06-15T10:29:27+00:00","title":"EXCESSIVE police force/gross misconduct toward black family! After leaving dollar store, AZ police pull gun on family whose 4 year old took Barbie doll from the store unbeknownst to parents. Police also threaten pregnant mother with guns as she holds her baby. When is this going to stop???","text":"","score":192,"num_comments":36,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1f5c1qb","author_hash":"c6c365c9281c1fd6136299eabcd8826dc8982f0ce8fc9f056d7c76ec48c153c7","created_utc":"2024-08-31T01:41:36+00:00","title":"Any Doulas Here? Would love to hear from you!","text":"I've never posted on here but it's been calling on my heart... \n\nI currently work as a diet tech for a local hospital and have fortified milk for little ones in the NICU. The interactions and lack of knowledge that come from RNs is alarming. I've been thinking about becoming a doula for a while now and wanted to combine the knowledge I have in nutrition and personal experience with yoga/meditation to aid black women during and after pregnancy. What's the best organization to go through for schooling? Any book, youtube, or podcast recs that I can gain knowledge from would be great too! \n\nAppreciate you ALL <3","score":3,"num_comments":0,"likely_black_context":true,"matched_preg_terms":["doula","pregnancy"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1jhghd1","author_hash":"0dca7f9abb85a2d441cb61a1275663b71b7f87f7699ecabc6a956b1f0e4e1bcb","created_utc":"2025-03-22T19:28:01+00:00","title":"Women with Kids Are Really Pressed At Women Who Don’t Have Them on TikTok","text":"I’ve been scrolling and watching these videos where (mostly) BW are losing their shit about the “21 with no kids” challenge saying things like:\n1. “You can’t keep a man that’s why you ain’t got no kids”;\n2. “I love my kids, being a mom was why I was put on this earth;” or my favorite \n3. “At least I didn’t abort my kids like you did”. \n\nWhy’re we acting like preventing pregnancy is something mythical concept? Or that having a kid by a man means he’s going to stick around??? If you love your kids and being a mother, this shit shouldn’t phase you. It’s giving heavy projection. \n\nTheir anger is even more incredibly weird considering (mostly) BW are engaging in the trend and society already lauds some many negative stereotypes towards Black single mothers. \nThere’s no shame in having kids at 21 (IF THAT IS WHAT YOU CHOOSE TO DO). So why is it a capital offense if women on the opposite side of the spectrum celebrate making the best decision FOR THEM??\n\nAlso, I wasn’t “born to procreate”. Let’s stop that anti-woman bullshit. Women are more than vessels to birth babies. We deserve to have and live full lives. And lastly, can we please stop acting like having an abortion is some big gotcha/ooo snap moment in 2025 when over half of the women in this country support some form of access???\n\nHaving an abortion 2 years ago was the best decision I made. If I didn’t I would’ve been 1) depressed and trapped in a relationship with a man who contributed nothing to the household, and 2) with a kid I would’ve most definitely resented as stopping me from getting out of said relationship and advancing my career. I made the best decision FOR ME. ","score":372,"num_comments":138,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"18bl44p","author_hash":"aa30d000cf2fcee6a03bdbc5259bdd113559bbba4667be2037e3ffa8f3d1dd39","created_utc":"2023-12-05T20:13:53+00:00","title":"Pregnancy tips around the globe 🌍","text":"I’m currently 8 weeks pregnant with my first child! The main issue I’ve been having is food aversions. I’m able to move, work and carry conversations but the smell or thought of most foods make me feel nauseous. \n\nI’m really interested in tips/ foods other black women ate during their pregnancy. \nI’m a Southern US woman, and a lot of my usual foods are just not working out. I like Nigerian foods like Okro stew and egusi plus alot of Ethiopian dishes. Jamaican food is my favorite. But I really don’t know how to prepare them myself where it actually taste the same to be honest lol.\nAnything would be appreciated!!","score":16,"num_comments":13,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"9vkgik","author_hash":"9b6203a563076ee36ec4fd9feb5df6492a967ead310d720d48187c4be533c550","created_utc":"2018-11-09T13:34:50+00:00","title":"Michelle Obama suffered miscarriage, used IVF to conceive Malia, Sasha","text":"","score":373,"num_comments":19,"likely_black_context":true,"matched_preg_terms":["ivf","miscarriage"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1d733as","author_hash":"f8408bbb7f7b50ea9b484885c85bca03b8b8db18441dd8de302b1863aa6db710","created_utc":"2024-06-03T12:22:31+00:00","title":"Pregnancy Later In Life","text":"To my sistahs who had babies young and also when you were 34+ how was it? I've been told that it's so different having a child when you are in your 20s vs late 30s and even early 40s. Please tell me how it all went down 💕 Thanks. ","score":14,"num_comments":2,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1banpu6","author_hash":"167b3dc62c5217c51c01bae6863b546fe27e800fd81b510ee1ed7acaef25a7ac","created_utc":"2024-03-09T17:56:41+00:00","title":"my moms keeps rushing me to get pregnant ","text":"\nSo my (19f) mom keeps rushing me to get pregnant. At first I thought she was kidding but literally everytime I talk to her she asks if I have a boyfriend and if I’m still a virgin. I tell her no I don’t have a bf I’m focused on school and I’m still a virgin. She then goes on to say I’ll be a cat lady and she’ll never have grandkids. I told her you don’t even want to be a grandma. And then she got upset. My mom acts young which is so annoying as well. She had me at 19 too btw. I don’t have a close bond with mom at all. But the way she rushes me to get pregnant really really pisses me off. Should I talk to her or cut her off? ","score":6,"num_comments":8,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1e9fm5b","author_hash":"0fef9f87ec700c189c19ce4bbff2c3c4f3c6d533941b4a3eaad418ba22240afd","created_utc":"2024-07-22T14:25:45+00:00","title":"RAPPER DIAMOND OF CRIME MOB IS PREGNANT!","text":"","score":1,"num_comments":1,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1j8kn9z","author_hash":"ae489857479287cd12b0f3989019d58563a4c17e876bcb34918ed52713c96247","created_utc":"2025-03-11T06:39:58+00:00","title":"My grandmama keeps telling me not to worry about having a White baby","text":"Ya’lls nibling arrived safely and is the cutest thing. But if I wasn’t lucid my entire pregnancy I would swear baby wasn’t mine lol. Takes completely after my husband and our pediatrician thinks the blue eyes are going to stick around since they’ve only gotten lighter. But my 92 year old grandmama, bless her heart, has dementia and we go through the same thing weekly - I tell her how old I am now and that she has a great grand child. She‘ll then see the baby, ask if the White baby is mine, I confirm, and she tells me not to worry, baby will, “darken up real nice, we just have to pray on it.”\n\nLove you girl, but the punnet square says otherwise lol. Sometimes when she says this she’ll get real quiet for a moment and then go, “no matter, I got room in my heart my new baby.” Honorable mention of all of cousins constantly yelling, “whose White baby is this?!” They all play too much but we are beloved nonetheless :) \n","score":841,"num_comments":62,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"vnpbqv","author_hash":"8b9148f54605afde8abb0c741cf1394480ffd4d0433b629dc3c9fc8c270f631a","created_utc":"2022-06-29T20:26:35+00:00","title":"Getting body checked while 6 months pregnant in the middle of the store by a man.","text":"I’m literally my find my own damn business at target looking for items for my classroom. This grown man probably about 200lbs , who happened to be white, ran into me and starts yelling “ did you see what she did ?!!” . I’m thinking what is happening right now. I think unconsciously I refused to move not only because I can’t move very well being this pregnant but I’ve noticed this especially with men in particular that they will expect you to jump out of the way for them . I don’t know if this would be considered a micro aggression or if I’m reading into it . But I am betting if I was a petite white woman this wouldn’t have happened. My shoulder is aching really bad right now . I would appreciate some support.","score":99,"num_comments":19,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"111o9cr","author_hash":"8f80cfcc1ab45d3eedc18f08ce4691fea864eb5548ba235f68d78a8fe1b17f1d","created_utc":"2023-02-14T00:02:21+00:00","title":"Found out I’m pregnant and want to move back home.","text":"My husband (32m) and I (30f) moved to the Bay Area in December to experience living away from our families for once (who mostly live in Dallas, Tx). Neither of us have had the experience, as we both stayed close to home for college. However, we found out that we’re expecting our first child (and rainbow baby) and are considering moving back. \n\nI feel so very lost having to make the decision, but (1) I really want our baby to have their grandparents, aunties, and great grandparents; (2) the cost of living is much lower in Dallas; (3) the Bay Area crime stats are getting increasingly worse.\n\nI’m struggling with feeling like a failure for not really wanting to make it work here, especially since Texas politics are ass-backwards. But California doesn’t have its shit figured out either.\n\nAre there any other factors you all would consider before making the decision to move back or stay? And would it be smarter to wait out our lease or just say fuck it, and find someone to sublease?","score":15,"num_comments":20,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"66b9pt","author_hash":"6fe6d5fc8e77eb766dc967691264b9cb1b9369f85ea4926386d48c2250b599ad","created_utc":"2017-04-19T16:24:04+00:00","title":"SERENA'S PREGNANT","text":"","score":203,"num_comments":34,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"110wb9w","author_hash":"4c613fb7efae972c99d993813853b95e072c01dd273d79b14b3ef4788ab81d23","created_utc":"2023-02-13T01:49:20+00:00","title":"Y’all, is Rihanna pregnant again?","text":"","score":53,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"jyigva","author_hash":"3ab004666a08c90bac5f04441e061bfb618df6fdb795580b68e6dcac8e6bd4eb","created_utc":"2020-11-21T20:59:54+00:00","title":"Mary Adegoke Oluwabukola - 6 month pregnant Nigerian woman poses after running the entire 10km (~6 miles) Lagos run","text":"","score":438,"num_comments":1,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1mztq0d","author_hash":"6b9db6e88e2a0ef89f9f83bfa7e0d10c89239edef295293d1464442f4a802660","created_utc":"2025-08-25T15:32:41+00:00","title":"Is it okay for a mother to leave?","text":"I am tired. I just found out my husband is cheating on me again. It’s not the first time, not the second, or even the third. After our last separation, he found a way to slither back into my life. I honestly thought we were doing well for a long time, and then, on our anniversary, a woman called to wish him a \"happy anniversary\" and ask when he would be done so he could come over. 😵‍💫\nAnd It was a really good anniversary too, we were having a wonderful time 😪. Any way since that moment a few months ago. It has been a world wind of discovery. Like something supernatural. Every other week something new back to back. Like if it was spread over years the blows would be better but its a few months. \n\nThis time,  I've discovered that many of the women he's involved with are fully aware of me and his family obligations. So he is upfront with them and he has been able to hide so well.  One of them has been in his life for at least 10 years; I was told she was gone, but he simply saved her under a man’s name in his phone. He also has weird a sexual relationship with two women. Doing things that I didn’t even know existed in our city.  And these two women are moms so I am shocked that they have the time for these events 😮 Another is a prominent woman in our city with money who is willing to wait for him to leave me so they can get married. He told me he's keeping her around because of her money.She's the kind of person that if he wasnt my husband and just a friend I would say good catch go get her.  I am honestly shocked that he pulled that person but we never know how people really are behind the public eye. And these are just the main four, there are so many other women he texts, calls, and DMs.\n\nWe recently bought a rental property. So he has the ability to leave. He said he would, but now he refuses to go because he doesn’t want a custody agreement. He also says its not fully furnished so he cant bring the kids. He wants to see our seven kids, who range from toddlers to college students, whenever he feels like it.\n\n I carry the entire weight of our household, both financially and emotionally. We've been married for almost 20 years, and I have no friends. I'm not from here, so I don't have any family nearby. His family has been my only source of support. My life has become a routine of going from home to work to the kids' activities.\n\nHe constantly tells me that no one else will want me. He says I’ll just go out and find a worse man who will abuse me and the kids. He promises he'll change, comparing himself to someone on drugs and asking me to give him time and work with him. But I know it's a lie, he always lies. And I feel like I can’t depend on any of these women to have morals. But as some of them say, I shouldn't be mad at them I should be mad at him. True. \n\nI just want to leave. But is it wrong to just disappear and leave him with the kids? I love my babies more than anything, and they say I’m the responsible parent, which is true. But I am at my breaking point. I truly feel like there's no way out.\n\nUPDATE:  I didn't end up leaving. I just got a hotel for two nights. Came home to a completely junky house.  But the kids were taken care of. He was definitely scared I wasn't coming back but I can't leave them to gain this type of behavior. In my short time away, I have a lawyer on deck, and I am plotting quietly. \nAlso, just a point of clarification: yes I have 7 kids but the 2 oldest who are in college are my bonus kids. I have been in their lives since they were toddlers. So they are around me like they are mine. I have 5 biological kids with 2 of them being twins. So I have technically only been pregnant 4 times. The twins are the toddlers who have a 6-year gap from the one that is next to them in age. So BC is not an issue the last ones are surprise babies. ","score":158,"num_comments":96,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1avif2q","author_hash":"7f4ab8344b3779cc5fd4be982fb27a599070fe4d626b012296893c907ce88039","created_utc":"2024-02-20T14:05:12+00:00","title":"Pregnancy loss & current pregnancy","text":"Anyone else had a 3rd trimester lost \n\nTW: \n\nPrevious st!llb!rth.\n\n& tend to poke your belly daily? Trying not to be obsessed with kick counting but it’s hard.\nI also immediately poke my belly until she kicks in the morning because I fear something will happen in my sleep 😔 \nWent to the ER because i thought she was in fetal distress whole time she just had hiccups. They thought i was crazy. 😔 im only 25 so they overlook that.","score":13,"num_comments":2,"likely_black_context":true,"matched_preg_terms":["pregnancy","trimester"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"pbface","author_hash":"f2cbfe6ad66462dfb8c1dfe54fa527b61dea276a11509af1de6b27d3d02c5c7c","created_utc":"2021-08-25T16:54:04+00:00","title":"Black women are more likely to die from pregnancy complications than any other demographic group, the CDC says. Advocates fear the pandemic could make it worse","text":"","score":152,"num_comments":16,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"a21esw","author_hash":"d76d080a22374f8f28fd2516dabd582ce67d5c800bf76f56f7cb11653a16006b","created_utc":"2018-12-01T08:29:55+00:00","title":"Does anyone else feel rushed to have children with the statistics of black women dying during pregnancy / birth knowing that complications only get higher with age?","text":"I’m only 21 and I feel like I should not be as stressed as I am about having kids... but I am. ","score":84,"num_comments":42,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1kyol9d","author_hash":"8b32f0445f8159b528c0743a994254e12c1472150582a23a424803e1c0ba6aab","created_utc":"2025-05-29T22:48:10+00:00","title":"How old were you when you realised people weren’t using protection?","text":"This sounds very silly to say but until a couple of years ago I genuinely believed people weren’t using protection. I believed the pregnancy epidemic where girls are dating a guy for a short time and make a pregnancy announcement was because the condom or birth control failed. \n\nI know I sound stupid but it never once crossed my mind that these people were having unprotected sex. I think it’s because it was always so fast and given the way BM are openly mocked within our community people were taking precautions.  I remember a 28 year old woman telling me she was “usually very careful” and not sure what happened because they always “pull out”.  My mouth dropped. \n\nAre people okay? ","score":310,"num_comments":94,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"13bf1vw","author_hash":"e7d19ae660a796a1cd40dfe4f6bc29d63f626dad8e559ca26d1ec251bdd51394","created_utc":"2023-05-08T05:28:15+00:00","title":"Pregnancy talk.","text":"Hello👋🏽\nMy boyfriend and I have been doing “long distance” for a year now (iykyk). I’m 33, turning 34 on the 15th and he’s 30. Anyways, he wants to wait to have kids until he’s financially stable which I appreciate and completely understand. This would be both our first. \nBut he doesn’t fully understand my concern about having a geriatric pregnancy. I haven’t even got into the harm black women face in hospitals in general, let alone with pregnancies. \nI’m not sure how we come to a comprise or an agreement.","score":2,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"s2k1st","author_hash":"2df0dec59eccc17c35f53a59c723beee5ec2a0233cb1ceebcdff8008d4a2d0a1","created_utc":"2022-01-12T23:20:30+00:00","title":"I finally enrolled in a doula course!","text":"I’m SO excited! There’s a big focus on POC and I cannot wait to be a guiding force in helping my kin bring their children into the world! The maternal death rate is so much higher for black people, and the thought of being able to advocate for us in a time of great need?? I’m really nervous about building clientele and probably quitting my current job, but I’m ready to be free from traditional American capitalism, doing well over my 8 hours a day, not being able to afford the life I want AND to have something to call my own. I just wanted to share how happy I am to be taking the next step in bettering myself and my life with you all! Maybe 2022 won’t be as bad as the last two years :)\n\nAlso if there’s any birthworkers in here I’m open to advice and any words of wisdom!","score":160,"num_comments":10,"likely_black_context":true,"matched_preg_terms":["doula"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"12rx10i","author_hash":"d0f78ef3c0f2f2aab410e93978a984b252b5e7f2c68e8d00484af75269483b66","created_utc":"2023-04-19T15:18:25+00:00","title":"Would I be at fault if I got pregnant?","text":"So I’m going off birth control in a month. My husband has been aware of this for a year and is supportive. He also knows it’s condoms or he needs to get a vasectomy from now on because I will not being going back on birth control. \n\nHere is the thing I’m 50/50 on a kid. It’s not 50/50 if I want one or not. I do want one but I’m also totally cool not having one. But lately I’ve been thinking having another baby (my son is 2 years from college) wouldn’t be a bad idea. My current husband isn’t the father of my teenage son. He doesn’t have kids and is also like me. He can have one but is cool if we never have one. \n\nBut he also doesn’t want one until we are “ready”. But I don’t think we will ever be ready. Because every time we meet a goal we just add new ones and it feels like stalling. \n\nOur state banned abortions so if we have sex and he doesn’t strap up or calls a doctor and schedules a vasectomy and I get pregnant we are keeping the baby. If he nuts in these guts it’s on him. \n\nBut would I be at fault? Because the responsibility to not get pregnant has been on me and now it’s his turn to shoulder that burden for awhile. I’m done with birth control! \n\nAny advice welcomed! Thank you!","score":2,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1bfawoi","author_hash":"13618a1b3d166e98dc6ff8243c2158cc0bf0f7fcd6ca5065eb2b5707d8ff535e","created_utc":"2024-03-15T10:36:28+00:00","title":"Heres your reminder to keep those boundaries with men STRONG","text":"A year ago my ex and I broke up. He wanted to have a baby but I was not getting pregnant without a ring on my finger. After I made that very clear he became distant and things ended shortly after. \n\nHe’s been hovering around me ever since and yesterday when I got home from work he was conveniently standing in from of my apartment with a new baby. Like literally standing in front of my assigned parking spot. Other than the fact that he’s borderline stalking me, I think he was trying to let me see he found another dummy to be his baby mama? According to a mutual friend he did not marry her, I figured considering we didn’t break up that long ago… I’ll be honest I am a little sad because I thought we had something solid, but this confirms he was just looking for a surrogate so I’m glad I got away.\n\nCongrats to them I guess, better her than me. Dont let these men make you a baby mama if that’s not what you want because they will! \n","score":818,"num_comments":124,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"e41385","author_hash":"6fece41e92715570f94be1c2d808b89ac6abd343b8fc69a7bf6f6658577dc82e","created_utc":"2019-11-30T18:33:06+00:00","title":"Black Mothers Get Less Treatment For Their Postpartum Depression","text":"","score":250,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["postpartum"],"matched_black_terms":["black","black mothers"]}
{"platform":"reddit","community":"r/blackladies","post_id":"1kde96n","author_hash":"5885706e53d17750a86f800b6fd828503678f581b4cd341633ea597d1a442312","created_utc":"2025-05-02T22:52:32+00:00","title":"The Idea of Oral Seems Disgusting to Me","text":"I (22F) am a virgin. I've never had sex before, and my reasons are just not wanting the risk of pregnancy while in college and just being scared to trust a man having that level of access to me. \n\nI understand to say that a lot of guys want oral and I'm wondering how that could impact my dating experiences. I know this is something I'd be better off asking men but everytime I do I get creepy dms 😭. I am very disgusted by the idea of putting a 🍆 in my mouth. \n\nMaybe it's because I'm a virgin, but oral really seems gross on another level.\n\nWould you guys say I'd be limited in dating because I'm not interested in blowjobs?\n\n\nEdit: I appreciate all the input from everyone. It's nice to hear other perspectives. ","score":269,"num_comments":106,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"broxob","author_hash":"eb5bf3a2e4e26272f9784919efd41d92224719f22e23cd04f2cf94d74fb268e7","created_utc":"2019-05-22T13:41:20+00:00","title":"Received this lovely response to my post about being black and pregnant","text":"","score":64,"num_comments":36,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"u75sku","author_hash":"5437f655aff6409baf26c9f04231c55904b91e00798d0c4f122546cd1bbecc0e","created_utc":"2022-04-19T13:57:54+00:00","title":"Allyson Felix's 'Saysh' is offering every customer a free pair of sneakers if her shoe size increases during pregnancy","text":"","score":161,"num_comments":6,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1diunp9","author_hash":"c0a7c42b0b7d206ae5e6e5f896e284bddda283149113bf5aa324c106ccab6d51","created_utc":"2024-06-18T16:19:29+00:00","title":"Damn, Black people can't like root beer? ","text":"Something silly that just happened:\n\nI ordered Hopcat for lunch through DoorDash because I was too lazy to make my own at work. I'm currently 35 weeks pregnant and my energy is just in the ground. Anyway, part of my order was a root beer because that's part of what I'm craving right now. My Dasher pulls up and apologizes because the restaurant didn't give him the root beer.\n\nOkay, slightly disappointing, but not the end of the world. I should be drinking more water anyway.\n\nThen this dude says, \"I ain't gonna lie, I saw the root beer and I thought you was gonna be White. I didn't know you were gonna be Black.\" Y'all. My name is very nonwhite. Literally of Swahili descent. I *promise* you no White woman has my name.\n\nI just raise my eyebrow at him and go, \"Well, clearly I am.\" Thanked him for the food and went back to my desk.\n\nBy no means am I appalled or anything, but it's just like... why lol? Like damn, it's \"white\" to like root beer? Black people don't drink root beer? What a dumbass comment.\n\nETA: I promise I'm not losing sleep over this. I just thought this was a silly interaction and wanted to share. Enjoying the comments here, y'all have a great day. ","score":302,"num_comments":238,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"16gwgfz","author_hash":"003bfdef9cc45ee1828395cdba84dcb6635fa2819229ca5fe99da4d5ad757ab0","created_utc":"2023-09-12T16:50:51+00:00","title":"The Black Girl Joy Series: Nothing Like Pregnancy Aftercare From A Black Grandmother...","text":"","score":41,"num_comments":1,"likely_black_context":true,"matched_preg_terms":["pregnancy"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"xq1gsd","author_hash":"181e5e470918c5c262347665ca4150a27ead46e305523b17d9752a1833e59314","created_utc":"2022-09-28T03:27:15+00:00","title":"Miscarriage - Pained - Trigger Warning","text":"Today, I lost my 9 week fetus. I miscarried. I’ve never experienced miscarriage before. I’m 33YO and literally never thought it could happen to me. Never crossed my mind. I just thought I had a healthy body. My fiancé had to leave for a preplanned work event. I can definitely take my pain and hurt out on him, so I’m trying not to. He came to the hospital with me today and was in and out because it’s a huge work week. I feel like he should’ve dropped every fucking thing but I know he feels a lot of pressure. He sent his mom to stay with me while he’s gone so that im not alone. My issue is I want him to suffer like I am, but I know it isn’t fair. My best friend has a bridal shower I’m supposed to attend in Maryland on Sunday, 10/02, I’m in NC. Im honestly not up for it but I think im going to force it. I truly don’t want to. I feel useless and incomplete rn. We have a 3YO boy. We love him dearly. But I was actually looking forward to this unplanned pregnancy. Things were going very well, until they weren’t. I felt the small item plop into the toilet. I held it in my hands. It looked like a bean. I feel very alone. I’m unsure of the purpose of this post or what I’m looking for.","score":41,"num_comments":12,"likely_black_context":true,"matched_preg_terms":["miscarriage","pregnancy"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"1n18ziy","author_hash":"62080a186d4130f44abf4f3f8300459c2521ce7ca5582e56a203bb3a740e0fcc","created_utc":"2025-08-27T05:50:57+00:00","title":"My friend wants to become a “second babymama” to a man who just had a baby… I am disappointed","text":"Hey ladies, I really need to vent and get some perspective.\n\nSo my close friend is trying to get pregnant by a man who already has two kids. His youngest baby is only 4 months old, and he is still with his first babymama. They live together and are very much a family.\n\nShe only found out about his family situation later (because he lied and hid it), and back in April when the baby was born, she actually cut him off completely. She even told us she didn’t want contact anymore. But he kept showing up at her house and calling us constantly, begging us to tell her to answer his phone calls. She told us she didn’t want a relationship with him anymore… and now suddenly she’s back with him.\n\nYesterday she even asked me, “What were your first pregnancy symptoms?” because she’s been having migraines, stomach pains, sneezing, etc. And then she admitted: “Yes, we’re back together, I have to tell you so much… I stopped taking my pill, I’ve been trying for so long to get pregnant.”\n\nI just don’t understand it. She’s financially stable, has a good job, a car, owns an apartment she rents out, and lives with her parents for now. She doesn’t need his money. But I honestly think part of why she clings to him is because he has money too.\n\nIt’s so frustrating to see, because she deserves so much better. I’m a single mom myself, and I know how hard it is when the father isn’t fully present. My child goes to their dad on weekends, and I just want better for her.\n\nOn top of that, she constantly puts down his first babymama, calling her ugly, just to feel better about herself. That really bothers me because I’m a girls’ girl. I don’t believe in tearing other women down for a man, especially not a man who is already lying and creating chaos and broken homes🫠.\n\nI’ve sent her voice notes explaining my perspective, told her I find it disappointing, and that she’s ignoring all the red flags. But she’s still in her own delusion, thinking that if she has his baby, he’ll be loyal to her. She also calls herself delulu.\n\nAm I wrong for feeling disappointed? How do I keep supporting her without draining myself? Has anyone dealt with a friend being totally delusional over a man?","score":128,"num_comments":78,"likely_black_context":true,"matched_preg_terms":["pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"ll6u1u","author_hash":"1767d157233ef27f5b1694907cc8431af623f1bb8bee75dc464e3dc28a364976","created_utc":"2021-02-16T15:59:40+00:00","title":"Meghan Markle to be stripped of her remaining responsibilities while pregnant just in time for Black History Month.","text":"","score":0,"num_comments":26,"likely_black_context":true,"matched_preg_terms":["pregnant"],"matched_black_terms":["black"]}
{"platform":"reddit","community":"r/blackladies","post_id":"xiptqo","author_hash":"003bfdef9cc45ee1828395cdba84dcb6635fa2819229ca5fe99da4d5ad757ab0","created_utc":"2022-09-19T21:47:47+00:00","title":"Black Women In Period Dramas: Leonie Elliott as Lucille Anderson in 'Call The Midwife'...","text":"","score":72,"num_comments":4,"likely_black_context":true,"matched_preg_terms":["midwife"],"matched_black_terms":["black","black women"]}
{"platform":"reddit","community":"r/blackladies","post_id":"108bioq","author_hash":"2f8ad7b8ad8836d4a4bdd469815dcf5e1c1a786d03486ac719a74b6d25290839","created_utc":"2023-01-10T14:44:52+00:00","title":"I haven’t told my family about my pregnancy yet and I’m nearly 6 months along","text":"I keep putting it off… I’m not showing yet. I see them almost every day… \n\nI’m feeling increasingly excited to tell them but I’m a bit emotionally scarred from a miscarriage where I handled the loss by spiraling into depression and resentment over the way things occurred (medical malpractice) and the way an aunt responded to what happened (didn’t rly acknowledge what happened to me as medical malpractice but did say how that doctor had delivered her kids just fine, went on to lecture me and say it was a blessing in disguise… a white nurse and a white doctor at different facilities pulled me aside to tell me that they couldn’t give me legal advice but that they would be suing in my position… but my family side eyed me when I said what happened). \n\nI was also shook from my lack of privacy during that time (I am a very private person) since my partner immediately told everyone about the pregnancy when I wanted to wait just until 12w… so everyone knew what happened, from neighbors (they’re like family) bc I had to be hospitalized to mutual friends I’m not even close with to people I’m merely aquatinted with but have known all my life (his friends- we grew up together and not all of our friends were mutual growing up but we knew a lot of the same people… it felt like almost everyone I knew of, knew)… I felt violated, disregarded, disrespected and then exposed in my vulnerability….\n\nAnyway here I am pregnant again and even my household doesn’t know I’m carrying the next member of our family. \n\nI told a couple of friends for practical reasons (but would have told them after family if not for extenuating circumstances that would have made my not telling them super inconsiderate [group vacation planning was happening, money involved]). Ideally I would have announced to them after announcing to family… and I wanted to tell family after my anatomy scan (didn’t want to deal with anything major being found out that would mean losing the baby bc I could Not Deal with any “blessing in disguise” discussions repeated without severely disrespecting my elders)… at Thanksgiving, on Christmas, on New Years… it just keeps extending bc I’m not ready even though I want to tell them?\n\nAnother (and in reality the most significant) layer of this is that I lost my mom and she is the only one I want to talk to about this anyway. I trusted my aunt as my go to person last time because my mom had passed the year before but I was so disappointed and hurt by her response I just know I was wrong for trying to look to anyone else.\n\n… I guess I just needed to get this off my chest.","score":20,"num_comments":6,"likely_black_context":true,"matched_preg_terms":["miscarriage","pregnancy","pregnant"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"14i62oc","author_hash":"f93b30819c2f88e4b3d210892d6f40a3e40382c3f2a6081ea1402aed4b5355c1","created_utc":"2023-06-24T22:53:46+00:00","title":"Any ladies doing ivf","text":"I'm going through it myself and was wondering if any of yall were.","score":1,"num_comments":3,"likely_black_context":true,"matched_preg_terms":["ivf"],"matched_black_terms":[]}
{"platform":"reddit","community":"r/blackladies","post_id":"kw35i3","author_hash":"cdcf5dd5c41d6acdf8bffe6a8160ef9a79dba576d31fce23b7b48773a94e629d","created_utc":"2021-01-12T23:05:14+00:00","title":"Saw the one and only black female obgyn in the area - and it didn’t go well","text":"Little background bout me - I’m 22 years old, and pretty anti western medicine to begin with. I’m also pro-choice and needed someone to talk to about BC options for me. Had a bad experience with white male docs last summer and I wasn’t trying to subject myself to that again.\n\nI don’t want to get too deep into it, but basically I live in a very predominantly white + Asian area (bay area CA) and needed to see an obgyn. I searched all over the internet to find this woman, and I guessed judged a book by its cover.\n\nWent in last week and the first thing I saw in the office were mommy magazines and tiny figurines of what I assume was the birth of baby Jesus on the front desk. I should’ve known from that point that I didn’t need to be there. 😅 When she saw me it was like the nice act immediately dropped once it was clear I wasn’t looking to have a baby anytime soon. She was very cold and matter of fact with me, and wasn’t very welcoming or understanding. Didn’t show any compassion when I told her my story. I even tried to hint at how hard it is to find the right doctor as a black woman and she didn’t really pick up on that. She did my Pap smear (didn’t warn me about the discomfort either) and then had her nurse tell me days later I had BV and needed to pick up a prescription that has since been giving me terrible nausea. \n\nNow I know not all black women are the same, and that maybe I shouldn’t have expected a grandmotherly experience just because we share skin color. But I just feel like given the context of this past year alone, the statistics around black women and reproductive health, and the fact that she’s the only black female obgyn in the area.... like am I wrong to have wanted a little more warmth from her?? I’m very disappointed and honestly have had better experiences at my local underfunded planned parenthood 🥴","score":57,"num_comments":14,"likely_black_context":true,"matched_preg_terms":["obgyn"],"matched_black_terms":["black","black woman","black women"]}
