{"platform":"reddit","community":"r/BabyBumps","post_id":"1ijf9i4","author_hash":"7f52f4ed4442b12a7a3bf332ca9559d8cd772ade2c5d4add0620aafec963b0d0","created_utc":"2025-02-06T22:21:01+00:00","title":"Suffering from postpartum anxiety and my mom left this for me…","text":"Aaaaaand now I’m crying again. \n\nShe brought this to me yesterday but I didn’t even notice or read it until this morning when I was feeding my 3 week old son. \n\n\nThis shit is hard. \n\n","score":6876,"num_comments":157}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1kgahqp","author_hash":"a67e823d9af00fdaf1f22d98fa4f4c388ecd2cad6b3c878d29ee27bec7b87813","created_utc":"2025-05-06T17:33:44+00:00","title":"Went in for GBS swab and had a male doctor last minute, said I wasn’t comfortable and he got mad","text":"I’m fuming. Had an appointment with my regular OB and for whatever reason, they passed me off to a man whom I had never met with before. When I told him that I was not comfortable with him doing the swab, he listed all the male doctors at the practice, told me I ‘should’ve known’ and then said he could send me to an all-female practice before prancing off angrily. They already know I prefer women. They already gave me shit because I refused a cervical check. Everyone says to advocate for yourself but nothing prepared me for how hard that actually is. I’ve already had my junk spread open for multiple people during this pregnancy and I do NOT think I’m high maintenance or problematic for at least wanting to limit that to the female gaze. I’m so goddamn mad. \n\nEdit: I’m not discriminating against men. His attitude was off the charts and uncalled for. Were it not for that, this would’ve been a simple hiccup. \n\nAnother edit: this is quite the little controversy. To clear things up…yeah no shit I might get a dude when labor comes. At that point, I don’t care. This is technically an elective test that I wanted to complete myself in the first place, was not allowed to do so and then subsequently came under fire. I don’t know if they have my ‘preference’ listed but at my first appointment, I told them no men and they said that’s fine. No I do not think a male OB is looking at me with anything but a clinical eye. I am just not…comfortable…with…it. Why is that so hard to comprehend? You don’t know my background. It doesn’t need to be for religious reasons or because of past trauma. It doesn’t need to be because of anything. It is what it is. And I don’t feel bad for this choice. I’m not carrying a baby to coddle a doctors feelings. Point in fact, I should be coddled. ","score":964,"num_comments":284}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1kof0nj","author_hash":"f6324e6ec07a7fd67c8b6871daac4313eda755336dee8d40223f13d9db7fe5f6","created_utc":"2025-05-16T23:30:00+00:00","title":"Turned away from postpartum checkup because my baby was with me","text":"I’m seven weeks postpartum today with my first baby and was turned away from my postpartum checkup with my OBGYN because I brought my baby to the appointment. Apparently they have an office policy that children are not allowed in appointments and since I didn’t have anyone with me I had to reschedule. On the one hand I can understand that having your baby or a child of any age may be distracting or potentially disruptive (although my guy was fast asleep), but on the other hand…seriously??? This baby is the whole reason I’m here, what else am I supposed to do with him? At the very least I think they should tell you that’s the policy when they book you for this type of appointment, as I imagine many new moms would assume they can bring their new babies to the doctor who brought them into the world lol. Oh well. I’ll be back next week and my husband will take the morning off work.","score":953,"num_comments":272}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1ldybl4","author_hash":"77c9421c40370052a049e36969e69b66d97136f2f48f2bbe0e585211fde933d1","created_utc":"2025-06-17T20:43:10+00:00","title":"For those who were induced, did you deliver vaginally or did it end in a c-section?","text":"Anecdotally, almost everyone I know who was induced ended up having an emergency c-section due to prolonged labor. Docs are recommending I be induced early but are letting me decide. Would love to hear about your personal experiences with induction.","score":244,"num_comments":1348}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1lmb5vv","author_hash":"5aa40ec2ea7184a59737d92208db9651604392eebc89f2980b61db18c941218d","created_utc":"2025-06-28T01:47:59+00:00","title":"I wish C-sections weren't so normalized that people forget how serious they are.","text":"\nI'm pregnant with my second child. With my first, I labored for a full 24 hours, 8 of them at cm with rolling thunder contractions. No sleep for two full days and nights, no food. Baby tried to come before I was ready, got stuck. C-section. I watched in the exhausted haze as they took out my uterus and plopped it on my chest and took out my baby all in the reflection of the light above me. The nurses behind me were too busy talking about their plans for the weekend to hear me mention I was going to puke. And puke I did, all over my hair. A humiliated mess, they sewed me back up and without cleaning me up put me in the room next to the nurses station for the night (apparently I was bleeding a lot and needed to be monitored more closely. They kept me up all night giggling and talking really loudly. The pain felt unmanageable, especially once I finally got home. I was hysterical.\n\nAnyways, here we are 32 weeks with #2, measuring at 37 weeks. No gestational diabetes, no other medical condition to explain why baby is so big. He's just huge. C-section is inevitable, he's already nearly 6lbs. I have people constantly invalidating what I've been through and what pain I expect to suffer. Saying stuff like \"how can you take x pain medication (that's prescribed) while breastfeeding!? That's irresponsible! You should go unmedicated for your baby.\" Or \" your fiance shouldn't take off more than 1 week of work to help you.\" I'm so incredibly fortunate to have a fiance who sees me. Saw everything my body did and had to go through. Helping me pull up my diapers and being patient with me every step of the way.\n\nHe wants me to be done working because I'm on my feet all day and I'm not just uncomfortable, I'm in pain. My pelvis hurts so bad. I'm starting to become incontinent. I'm fine, really I guess...and we need the money bad. I just get so much shit from EVERYONE when I mention being done soon. Even my doctor wants me to keep working. I exercise (lots of walks) regularly so I'm not like lazy. I don't know. I get I need to do what's best for me and my family, but I need everyone to shut up and be supportive and validate my needs. I dont want baby to come early but I'm out of energy. Working part time while raising my toddler, no daycare. I want my energy back. I want my body back and I know I'm far from both. Wish me luck these next 7 weeks. SEVEN WEEKS. Or, you know.. emergency c-section instead of a planned one. \n\nEdit: I think too many of you are focused on the title rather than my actual issues. Didn't say people shouldn't have them. I just want them to be recognized as a major surgery. People love to hate though, welcome to the internet. Thank you for all the kind supportive comments. ","score":658,"num_comments":245}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1lt3zv0","author_hash":"e769bc14b3f905907743dc9027d60c9f95d2cfeb4d88d43e4132a0e47a201921","created_utc":"2025-07-06T15:30:05+00:00","title":"We broke up because of my postpartum body..","text":"Im honestly not sure where to post this but just came across this forum while researching, and it’s I felt like the safest place to go. \n\nLong story short, by boyfriend of a little over a year broke it off saying he doesn’t find me attractive anymore. We met when I was 3m postpartum from my twins (bio dad is in prison for DV and I spent my whole pregnancy without a partner). I honestly thought he was the one.. he came in when my boys were young and has been here for so much. But last Friday, after not being able to “get off” during s*x again (it’s been 3-4 months like this). He finally said it’s because I am too loose down there.. what…? It’s been over a year since I had my boys, isn’t it suppose to go back?? \n\nI don’t understand why he could at the beginning of our relationship but not now.. I have lost almost 40lb  since then, have some pelvic floor therapy (though could do more), and I even put my hand there to inspect and it feels fine... I was very fit prior to pregnancy so trying to get back, but he didn’t even know me then. \n\nI’m both hurt and confused… i guess my question is, has anyone experienced this? It is true that I won’t be able to find someone now that I’ve had kids bc of this? \n\nETA: first off, woah.. I didn’t expect to get this much traction. I admittedly wrote this post in a bit frenzy this morning and just getting a chance to really read comments. Thank you to everyone (esp. my women and mamas friends 🫶)  who took the time to share your stories, relationship wins PP, and encouragement. I cried tears of relief reading everyone’s comments; it helped heal my heart that I admittedly have been ignoring.\nSecondly, for those that asked, a synopsis of my PF journey: I did go 40 weeks with my boys (I am incredibly grateful but DAMN it was a lot). I had a vaginal birth with second degree tear. I did do half of MUTU PF therapy but admittedly stopped a while ago.\nLastly, I believe most you are right about the porn addition and (newly learned term) “death grip.” I did ask him about his porn habits and his medicine usage last Friday, and he ignored me.\nAnyways, idk if I’ll get back on here to add again. Once more I am incredibly grateful for everyone who shared their stories as parents of many kids, solo moms, and many more. What a cool community you all make it 🫶","score":687,"num_comments":211}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1fz0eyw","author_hash":"7945d89ad5968ea742462a2cee101868e327e7bffa605098697e6f4cd7f32f17","created_utc":"2024-10-08T13:57:14+00:00","title":"I was charged over $200 for telling my primary care doctor I am pregnant.","text":"Just a vent because I'm fuming. \n\nI had my yearly physical with my doctor at the end of August when I was 13 weeks. She asked if anything was new and I told her I'm pregnant. She was so nice about it and happy for me and we talked about it for probably 5 minutes max. Then I get a bill for my appointment which is odd since it's preventative care and insurance should cover it. I had to call the billing department and I come to find out that since we discussed things \"not included in a typical physical\" that it was not covered by insurance and now I have to pay $211 out of pocket. \n\nFor perspective, the cost of the covered physical was billed at $290.44 and the cost of the not covered physical was billed at $245.01. For telling my doctor im pregnant. I hate the healthcare system in the US.","score":1246,"num_comments":318}
{"platform":"reddit","community":"r/BabyBumps","post_id":"glj1b9","author_hash":"5ac8aab2b2ae25952c57d5088b3d932f98fde1de64062392e49a2137578f834e","created_utc":"2020-05-17T17:07:15+00:00","title":"Some very “WTF” things they don’t tell you about pregnancy.","text":"25 weeks, first-time mom. Here is a list of things that NO ONE bothered to tell me about being pregnant:\n\n1. You haven’t actually stopped peeing until you try it once, stand up, sit down and then pee a second time. Leaving the house without doing this will bring you a world of regret (especially since public restrooms aren’t a thing right now.)\n\n2. Your nipples will leak without telling you and then they will dry, and you’ll look down the next morning and immediately think you have cancer or a rare nipple disease oh my god. \n\n3. Speaking of nipples, they are permanently erect now and they feel like fire at all times. You can cut glass with them. You are now Andy Bernard in that episode of The Office with the rabies fun-run. \n\n4. Your baby can, and WILL, kick you square in the butthole from inside the womb. They do not apologize. Do not expect flowers. \n\n5. First kicks don’t always feel like butterflies or a fun little goldfish. They can also feel like your bladder is trying to off itself one explosion at a time. It will launch you off the couch in a panic and there is nothing you can do about it. \n\n6. You won’t know where your stomach is anymore now that your organs are all squished around. Your doctor doesn’t know. Your midwife doesn’t know. Nobody fucking knows but you’ll still get reminded that it’s there by the HOT LAVA heartburn that happens if you even THINK about a banana before going to sleep. \n\n7. Doing the dishes takes three sessions because standing up is impossible for more than two minutes. You will feel like you need an oxygen tank. Or a priest. \n\n8. Constipation is more difficult than normal because, as you may remember from #6, you don’t know or understand where your organs are anymore. Your body is just trying to poop but your liver and kidneys suddenly have to voice their shitty opinions, as well as whatever the hell is in your ribcage at the moment, and you more than likely will google “AM I DYING?” at four AM. This will happen more than once. \n\nHave I missed anything? I’m only 25 weeks so I guess I get another full trimester to find out. Pregnancy is such a BEAUTIFUL MIRACLE.\n\n\n(Edited to change acronym ‘FTM’ to ‘first-time mom’ to avoid confusion.)","score":4384,"num_comments":1006}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1li4kei","author_hash":"b34d7b11bf62ffce0e93b2f33d0a058d376df420025a6fffe0067e2ca568a197","created_utc":"2025-06-23T01:47:23+00:00","title":"PSA: Pregnancy is not a public performance to stay thin for public approval","text":"So I'm 17 weeks pregnant and I'm not showing yet. My grandmother saw a recent picture of me in our family whatsapp group and privately texted me this: \"I am so impressed that you are keeping your weight down.  You look absolutely lovely!  💞\" What kind of 1920s bullshit is this?! Being extremely generous, I do think she meant well with her comment, but I hate it. At this stage in my pregnancy it's actually hard not to worry about not having \"popped\" yet because it would be a comforting sign that my baby is growing. This is so frustrating. Growing a baby is literally the most important thing happening to my body right now. This is not some kind of public performance where I’m supposed to keep looking thin to win points. I don't want her to be impressed by that - I'm not trying to impress anyone. If anything she should be impressed with the fact that I'm growing a human and the amount of care I'm putting into my pregnancy and my baby's health. Ugh.\n","score":847,"num_comments":167}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1nawina","author_hash":"3a2ea163fa071e693b98d8222621aac6f80550af50c8a7f67c8722f8669b3539","created_utc":"2025-09-07T15:42:32+00:00","title":"Most uptight email I’ve ever read about postpartum “prep and rules”","text":"This came from a friend (36F) , and honestly, I’ve (34F) never seen anything like it. I really do appreciate boundaries and clarity, but this wasn’t warm or welcoming - it was a cold, corporate-style manual. It was LONG. I felt like I had just studied for an exam after reading it. Absolutely no stone was left unturned- There were multiple lengthy attachments covering everything from “helping before baby” to “rules for visiting postpartum.” With all the documents included plus the email itself it had to have been at LEAST 40-50 pages. I’m just doing my best to convey the highlights. \n\nIt started out reasonable with expected boundaries: no kissing the baby, wash your hands, don’t visit if you’re sick. Totally fine. But then it went way beyond:\n\t•\tAdvice clause: “If we’ve not asked for advice, keep your comments to yourself.”\n\t•\tBaby prep help: A sign-up sheet with tasks that were mostly just home renovation projects - landscaping, rebuilding parts of the yard, even electrical work. The list was LONG. My partner and I were cracking up- especially because these people are loaded. Get professionals to help! \n\t•\tMeal prep binder: A 20+ page document with strict dietary rules, photos from cookbooks, specific recipes, and detailed instructions for how to act in their kitchen.\n\t•\tNotifications spreadsheet: If you wanted to be told when the baby arrived, you had to sign up and agree to a list of what would/wouldn’t be disclosed and what you could/couldn’t ask.\n\t•\tMeeting baby: Required booking through a professional scheduling link. Personally, I wanted some flexibility postpartum, but hey. \n\t•\tOvernight visits: A separate link with rules about how to “book this”, instructions for remaking the bed when you leave, and an agreement that overnight guests must bottle-feed but can’t change diapers (you must wake up parents for this throughout the night since no one but parents are allowed to do so).\n\t•\tChores: excessive instructions for laundry (exact pumps of detergent, scoop measurements, machine settings), dishes, errands, pet care, etc. Plus: “Don’t ask us to get up. Don’t ask us to show you anything. Don’t use our dishes, bring your own water bottle.” LOL. They even included their Peet’s coffee orders.\n\nSome highlights that stuck with me:\n\t•\t“Clear the room and find something else to do if mom is breastfeeding.”\n\t•\t“Please don’t raise conflict with us about anything until at least 6 months postpartum.”\n\t•\t“Ask for consent before bringing gifts - no toys, no stuffed animals. We are not accepting gifts at this time.” \n“Don’t get offended if we ask you not to hold the baby. Only people we deem to be in good vision/ overall health are allowed to hold the baby.” \n\nI had been planning to drop by for a visit, but after reading this, I no longer feel comfortable. My partner joked we should just bring our own toilet paper and use the bathroom in the yard to avoid breaking a rule.\n\nMy takeaways:\n\t1.\tThe people who actually overstep boundaries and need micromanaging probably won’t read 4+ attachments/ links anyway.\n\t2.\tEveryone else who’s “normal” just ends up feeling put off. I’ve heard from multiple people  that this email was super off-putting. \n\t3.\tWith this many rigid expectations, resentment feels inevitable.\n\nDon’t get me wrong, I respect boundaries - I think they’re healthy. But this wasn’t just boundaries; it was micromanagement in the form of a policy manual. And it made people feel more like employees than loved ones.","score":480,"num_comments":194}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1m70s09","author_hash":"2815290e3216544e0acfa357f50d56f3d939bc0c0c581e7a7a5372c3bf93c092","created_utc":"2025-07-23T05:19:57+00:00","title":"Husband frustrated with postpartum sex life","text":"I’m 20 days postpartum & for the past 15 days my husband has asked me to do something sexual with him. I did give him head the first night he asked & then I said no a few nights and he got angry. Like very angry. Wouldn’t talk to me or make eye contact. Locked himself in his office and just played his Xbox and ignored me and the kids (we have 3 now). I keep telling him I am just in pain and trying to rest and heal from childbirth but he says I’m selfish and is saying I must not be attracted to him anymore and that it’s insane I can’t take a few minutes to “help him”. He ordered a bunch of new toys for us and I guess my reaction wasn’t good enough and he got PISSED. he said I was ungrateful and that I just prove that I’m not attracted to him. \n\nI am attracted to him. I just don’t have any desire to do anything sexual right now. And I feel like I’m drowning trying to take care of myself and 3 kids and now I feel so isolated and alone because he’s upset with me for not “helping him”. \n\nI really don’t know what else to say to him for him to understand my point of view. Am I wrong? Cause I feel like something is wrong with me now. He’s made me feel terrible about myself idk what to do. ","score":383,"num_comments":306}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1lmkkr2","author_hash":"cb46befa1bde964fd4dd84ee69667f897833b2e30c390a1e506801f57654cd50","created_utc":"2025-06-28T11:28:31+00:00","title":"Friend insensitively announced pregnancy. AITAH for cutting her off?","text":"So I have a friend, or should I say girlfriend of my partners friend, who I had opened up to about my infertility and previous losses. I cried to her after my recent ectopic pregnancy when I lost my right tube. I recently started IVF and she knows I am struggling physically and emotionally. \n\nI had sent her a message earlier in the week making general conversation to which she never replied. I woke up early this morning to a text message from her. It was a photo of a glaringly obvious positive pregnancy test, and the message read “I need a second opinion… am I going insane or does this say positive “\n\nMind you, this girl has other children and would be very aware of what a positive pregnancy test looks like. Not to mention, a simple google search would provide the answer in under 30 seconds.\n\nI responded with “yes that’s very positive, congratulations!!”, to which she said “The timing is … 💀💀”\n\nI’m happy for her and her partner, but AITHA here for wanting to cut her out of my life? I just feel it is such an insensitive thing to say, especially given that she has plenty of other friends who she could have asked, some of which who are also pregnant. My partner thinks I’m overreacting but I’m really upset that someone could be so cruel and insensitive. \n","score":440,"num_comments":291}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1my69fz","author_hash":"0ff32603f254658b8719d1f5cbf7b233c340a79c3e9c75bdef6beba4889b6774","created_utc":"2025-08-23T16:40:31+00:00","title":"Pregnancy myths/expectations you were shocked to learn weren’t true?","text":"Before I got pregnant with my first baby, I never knew that not every woman gets morning sickness. I thought it was a given, and even planned to graduate first and have my ducks in a row in case I get really really sick (my mother was sick all three kids, all nine months)\n\nNope!! Never threw up once. Didn’t even feel ill. Turns out 1 in 4 women just don’t. \n\nAnother was your feet growing a shoe size. I’ve heard that for years, and even asked my ob during our appointments. She laughed and said feet don’t grow unless you gain a lot of weight, and it’s the weight gain, not the baby that causes the change. I’m on my second baby and there’s been no change. None of the women in my real life has had a size change either. Might just be an internet story.\n\nThird is cravings. My husband was excited for late night store runs for pickles and ice cream. Nope. Nothing fun, just thirsty all the time.\n\nSo was there anything you were surprised at?","score":286,"num_comments":311}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1l3a5hv","author_hash":"42af6a2080b47a662200b2c73f6f2ad05b43d89e44ad0b9705645da22e9836bb","created_utc":"2025-06-04T16:33:04+00:00","title":"After pregnancy","text":"I always see people talk about things they are excited for after pregnancy and usually it’s things like being able to drink again or to eat certain foods. Which I 100% get but I wanna hear something that seems to totally insane to be excited for to a non pregnant person but every pregnant person knows the feeling. Mine is finally being able to feel like I fully emptied my bladder because no matter how often I go I always feel like I have to pee ","score":326,"num_comments":472}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1gbbmwo","author_hash":"3a493e1c77f42ea780e46e6874de3365400f6d8548c594d103ff79764b85ed60","created_utc":"2024-10-24T19:51:12+00:00","title":"She’s drinking throughout her pregnancy","text":"I have a family friend who is currently in her 7th month of pregnancy. I found out she’s been drinking a fair amount. Her doctor told her that it was fine to drink wine and even hard liquor, just as long as it’s in its pure form?? Seems super odd for a doctor to say. I get that there’s this notion that one glass of wine every once in a while is okay. To me, it just doesn’t seem worth it at that point. \n\nAnyway, I feel like she feels like it’s given her the green light to go ham. She openly does it too. She took shots and drank champagne/beer at all the showers, weddings, and social events that we’ve been together. I heard through the grapevine that she’s drinking during her work happy hours. Her coworkers spoke up and she got mega pissed about it. Said her doctor told her it was okay. She drank an entire bottle of wine by herself weeks ago. It’s the talk of the town and her reputation is trashed. \n\nI soo want to figure out who her doctor is and report this somehow. I worry that if this baby comes out totally healthy, it’ll give her the okay to do it again on future pregnancies. \n\nDo I just leave this alone? If I speak up, she will just bitch me out and tell me her doctor approved it. Can CPS get involved?","score":727,"num_comments":506}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1jmufse","author_hash":"87f11a2e5290cf3111e516734e31577e777c9e9ac2992757655b52e85788c055","created_utc":"2025-03-29T19:43:04+00:00","title":"I finally finished making my postpartum freezer meals!","text":"Took me two weekends to cook and had help from a friend.\n\nChicken noodle soup \nChicken enchilada soup \nLemon orzo soup \nMinestrone soup \nBeef enchiladas \nLasagna \nBeef and shrimp stir fry \nBeef and shrimp friend rice \nChicken fajitas \nSteak and bean burritos \nPork in salsa verde \nBreakfast burritos (potato, bell peppers, onion, bacon and egg)\n","score":1226,"num_comments":139}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1hx4szf","author_hash":"0fceb14cb121b15505b4c21c21acb2aaad748c9dc35fa30f5bd00416ffc50d18","created_utc":"2025-01-09T04:31:55+00:00","title":"Cinnamon bun pregnancy rage","text":"I’m 17 weeks pregnant. I bought a cinnamon bun today with extra cream cheese frosting thinking I’d have it at the end of the night with a glass of milk. I had a day full of errands; grocery shopping, farmer’s market, cleaned the house, cooked my husband lunch, prepped lunch for work, and made us all dinner. Walked the dog. Blah blah blah. A shit load of shit. Then I said hey, I’m going to shower now and enjoy that delectable cinnamon bun that I’ve been thinking about all day. I get out of the shower and the bag is no where to be found. My husband, trying to be “helpful”, blindly just throws shit away without checking what’s inside first. He threw away my cinnamon bun, and the everything bagels I planned on having for breakfast tomorrow with 2 eggs. Let me just tell you all, pregnancy rage is real and this is my first experience with it. I don’t know if I want to cry, punch him in the head, flip all of the furniture in this damn house, or all 3. I’m so sad. I’m so angry. I also feel silly for being this angry and sad. But man, if you saw that cinnamon bun…it was like cinnamon bun p0rn. The most perfect bun I’ve ever seen. And now it’s gone. Sitting in the garbage. I want to sleep on the couch tonight. Sigh. There’s always tomorrow. RIP cinnamon bun. ","score":1047,"num_comments":218}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1jzp01y","author_hash":"cf3f0dd663a6c6a6344487bedbcd4d67520d14f66179ff0e6e7a035558fea713","created_utc":"2025-04-15T11:01:58+00:00","title":"Really dumb rant but are there any words/terms related to pregnancy that you hate?","text":"Im 32 weeks pregnant. This is probably my hormones talking because who even cares about this, but my sister saying she thinks babies \"are pretty much done cooking\" by X number of weeks just, for zero reason that's at all deep, made me go, \"ew, 'cooking'? No!\" \n\nI'm probably alone in this but I also get super irritated (privately) when people say \"we're pregnant\" and I'm sure there are plenty of great, well-intentioned reasons for it, but at the end of the day, I am fucking pregnant, not my husband. \n\nFinally, I'm certain I'm alone in this, but I really don't like \"baby\" used without an article or possessive pronoun. \"Look at baby!\" \"When baby comes...\" (NO! \"The\" baby, \"your\" baby, \"my\" baby) \n\nBTW this post is meant as lighthearted, I promise that while I'm coming off like I am throwing bricks through windows at the mere question of how \"baby\" is doing, I am slightly more composed/restrained than that. It's just a pebble here or there.","score":355,"num_comments":566}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1l5ks04","author_hash":"a798bd94df40e29555a60b582b6f8a9e3704ab8f92673e159d58211c7a426a17","created_utc":"2025-06-07T13:24:41+00:00","title":"My obgyn made me cry","text":"It could just be hormones but I burst out in to tears in my car yesterday  after my appointment my ob told me I’m having a geriatric birth and idk I just wanted to cry I know I want another baby after this and he made it seem like the risk are just so high even with this birth for context I turn 35 July 5th I’m due July 22nd  am I crazy or is a second baby realistic and did I royally screw up waiting this long to get started ? ","score":255,"num_comments":535}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1fu393h","author_hash":"ad85a9d5d323786a977de284b5121f0ddbe6e688620c252fcaf09bdacc869d88","created_utc":"2024-10-02T00:14:07+00:00","title":"“A large baby isn’t a reason for an induction/C-section!”","text":"Also: “your body won’t make a baby you can’t push out!”\n\nCan we stop with these bullshit, uneducated, parroted comments? Fetal macrosomia, especially at extremes (most providers say 11lbs and above) can increase risk of severe complications like shoulder dystocia. When babies reach a certain estimated size, the risk of these severe complications greatly increases. Is a risk a guarantee that it’ll happen? No, but as with anything, each individual needs to do their own risk assessment and decide how much risk they are willing to accept. However, childbirth is still a leading global cause of death in women, particularly in low resourced areas that do not have access to appropriate medical interventions. Managing risk is essential to a safe delivery.\n\n\nIf you really want a vaginal birth and know you might end up with an emergency c-section, that’s fine! But listen to your medical providers about the risks and options. Their job is to literally KEEP YOU AND BABY SAFE AND ALIVE. They are not recommending an induction or c-section because they have plans, they are recommending it because they believe the outcome will be better for you and your LO. Don’t listen to strangers on the internet who have maybe had a couple kids—listen to your providers who have likely delivered hundreds or thousands. If you want a second opinion, ask someone who is QUALIFIED.\n\n/endrant","score":887,"num_comments":342}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1kuz97d","author_hash":"1ccb7f193c390e44ca4ae505dd55d98bfb72b5213944aeb5f73c9d13b1c3bbf5","created_utc":"2025-05-25T10:18:18+00:00","title":"What’s one pregnancy symptom no one warned you about?","text":"Just when you think you’ve read every pregnancy book out there, your body throws you a curveball. What’s that one weird or unexpected symptom that totally caught you off guard?","score":157,"num_comments":909}
{"platform":"reddit","community":"r/BabyBumps","post_id":"mrga10","author_hash":"30b7305398c837d0bb98ca827ee14d84578492fc99f6b864ae16a236f8a3195f","created_utc":"2021-04-15T14:51:16+00:00","title":"It's cruel, late-stage capitalist slavery to force pregnant people to work until the end of their pregnancy and then to come back after only 6 weeks of maternity leave.","text":"This applies to America since I know other countries do it differently:\n\nI get it - We chose this. We chose to reproduce or we chose to keep the pregnancy.\n\nI get it - we have laws in place to protect women. But ultimately, the business has a certain amount of choice over how they treat a pregnant person. We all heard the stories where the business kept to the letter of the law but you still felt shitty asking for a day off.\n\nI get it - we want equal rights among genders and to not be treated as lesser for being pregnant. But how messed up is it that our society had to make LAWS to protect pregnant people against employers. What is WRONG with us as a country that we are so money-hungry that the most basic human right of reproduction, the thing that guarantees our country will continue on and thrive, is seen as a burden to MaKiNg MoNeY?\n\nI get it - many of us want to keep going, keep working, because we are dedicated to our work and believe in what we do. But where did you learn this? Where did you learn that your health and the health of your unborn child is less important? We DIDN'T learn it - we are forced into it every day. You do what you have to to survive. You cry and you go back to work after 6 weeks. It's considered unethical for puppies to be separated from Mom before 8-9 weeks before they are weaned, but it seems to be perfectly effing fine to do it to our own children.\n\nI cried this morning for the first time BEFORE work. Don't get me wrong - my job has been excellent in how they have treated me. I can take time for my appointments without question and they have slowly taken things off my plate. But I had such a shitty night and I am in pain and I'm tired. Maybe I should have taken the day off, but I also don't want to take it too far since I already took a lot of time off recently. Pregnancy is so hard and I don't need to be coddled.\n\nBut I wish we lived in a society where what we are going through was more understood.\n\nEdit: Didn't think this would blow up this much. Don't post on reddit while hangry, apparently. Glad that we are outraged together, though <3","score":3630,"num_comments":425}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1m9gly6","author_hash":"e96ecdf0f6e17ab2f255566f090c2914f26374cae90545249ee2defa23941011","created_utc":"2025-07-26T01:17:31+00:00","title":"Am I crazy to prefer a C-section?","text":"Edit: Wow this post blew up! Seems like every single person is different in how they experience a c section or vaginal birth. Sometimes the recovery is smooth, sometimes it sucks. Both types of births can cause longterm pain and complications, and both have the potential to be super smooth and stress free . Emergency C sections seem to have the worst outcomes, while scheduled ones can provide a sense of control and comfort.\n\nAnd it also seems like people have different experiences with c sections and having their arms tied down, not experiencing golden hour, etc. Those are NOT universal and plenty of women have said they weren’t tied down and were given their baby right away, etc.\n\nI completely understand the women for whom birth is a magical empowering experience, but I just don’t personally see it that way. I’m in this for the baby — not the birth itself. Whatever is the safest way for me and my baby to come home is just fine with me. I certainly don’t think that a c section is the “easy way” but nor do I think that a vaginal birth is completely safe and pain or complication-free in all cases. \n\nI really appreciate all of the insights on all sides of this issue, it’s revealed to me that, like most things, it’s very subjective and comes down to personal preference. Much love ladies, thanks for sharing! 🙏\n**********************************************\nFTM due in October. I’m not gonna lie, some of these birth stories are really making me want to ask for a c section. The crazy long labors, the tearing, the unpredictable nature of vaginal delivery… and the fact that you may end up with a c section anyway, so you get the worst of both worlds- exhausting labor and c section recovery. A planned c section just sounds so much less… stressful? And so much more predictable. I get that recovery is no joke but honestly, some of the things I’ve read about vaginal recovery sounds absolutely awful too. Am I missing something or just crazy to almost prefer a scheduled c section? ","score":149,"num_comments":476}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1dbe4dy","author_hash":"c32bfa56ff131749d4b4ad894dec2c1e206b47626120bf3cae46630bb9917a13","created_utc":"2024-06-08T22:08:08+00:00","title":"Fell down the stairs at my OBGYN's office, broke my ankle and went into labor.","text":"Yesterday morning I had my 36 week appointment with my OBGYN. My OBYN said that everything was going well and assured me I should have a smooth delivery. I was huge but otherwise feeling great.\n\n Then it happened. I was walking down the stairs after my appointment, missed about 2 steps and fell hard and awkwardly onto my leg. I was laying at the bottom of the stairs in excruciating pain and knew instantly that I had broken my ankle/leg. I tried to crawl and get up but couldn't. I can't describe it but I was both panicked and calm at the same time. I tried several more times to get up but couldn't move. I pulled my phone out and called my OBGYN's office. \"Hi, this is \\_\\_\\_\\_\\_\\_\\_\\_\\_. I just had an appointment with Dr. \\_\\_\\_\\_\\_\\_ and I just fell down the stairs and I think I broke my leg.\" The receptionist stayed on the phone with me until my OBGYN and several other doctors and nurses got to me. She kept asking me questions and I told her I was going to get sick and my stomach was cramping really bad.\n\nMy OBGYN and several other doctors and nurses rushed to me with a wheelchair. They quickly realized that they weren't going to be able to get me into the wheelchair. I was going into shock and honestly didn't realize that I was going into labor until I overheard my OBGYN order one of the nurses to get me a stretcher and get more help because I was going into labor. Everyone tried to keep me calm and comfortable, but the contractions were coming very quick. I threw up at one point. There was also no way I was going to be able to get transferred to the stretcher and into a room either. I suddenly realized that I was going to give birth right there. \n\n  \nThey blocked off the stairwell. Needless to say, I was in excruciating pain. Someone propped up my ankle on some pillows and stabilized it in an aircast boot while my OBGYN ordered someone to call my husband. They told him to get here ASAP. I got some heavy duty pain meds in an IV and my vitals were being monitored. Within an hour and a half, my husband made it and our baby girl was born. What a whirlwind. That was an experience that I will never forget, but I am so happy to have a healthy baby. Baby and I are still in the hospital. I need to follow up with an orthopedist on Monday to see if my broken ankle will just require a cast or if I will also need surgery.\n\n It's going to be an interesting 6-10 weeks being on crutches and taking care of a newborn, to say the least. Any advice would be much appreciated! Thank you.","score":2011,"num_comments":158}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1lz8y34","author_hash":"843a67932bd5467f775a2f4ab2473a27b47be60572876737048da4285941a905","created_utc":"2025-07-14T00:54:46+00:00","title":"Worst Pregnancy Announcement Reactions?","text":"I’ll go first, today I told my entire family that I am pregnant and due in January. This is my second pregnancy, we lost our first at 12 weeks a few months ago, but my family doesn’t know that - in their minds, this is our first pregnancy. They have no idea the grief and suffering we’ve dealt with, but it’s taken a toll. I was excited and happy to share the news and right after my mom starts talking about how she’s so happy I’m pregnant because she was about to have an intervention. I was like huh? She then starts looking around at everyone else in my family saying, “right? weren’t we all about to sit her down and say something about all that weight gain? I talked to you guys about this”. Thankfully, everyone else in my family looked mortified. So I said, “excuse me? That’s not very nice to say at all…” to which she starts trying to defend what she meant and tap in other family members to support what she was trying to say. Needless to say, I began crying in a room full of all of my family, excused myself to another room where my husband came and sat with me while I cried. My husband was so shocked, I think he sees my family in a whole different light now. My mom came and apologized but I know this will be burned in my memory forever and make me want to not include her on more when it comes to this pregnancy. My joy and my “first” pregnancy announcement feel completely stolen and tainted. Anyone else have similar stories? How did you navigate these people moving forward? Also just general tips on dealing with a mom who became a mom herself during the height of 90s diet culture and assigns 100% of self worth to body image while trying to protect my peace while pregnant would be great. \n\nGosh, I swore reactions like this only happened in movies!!!","score":504,"num_comments":165}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1n7n7n9","author_hash":"a3e9693e073383c663e95c20e376fe86367f1374daff15fad476cccc16c70d97","created_utc":"2025-09-03T18:43:32+00:00","title":"Not quite the pregnancy I expected","text":"I’m a 31yo FTM. I got pregnant about 3 months after coming off birth control and everything was good. Nausea and fatigue in first trimester but controlled with unisom and B6. Get my NIPT drawn at 11w and it comes back as low fetal fraction. Weird but everyone told me it was probably just a mistake or slightly too early so went back for a redraw. \n\nThis is where things go off the rails. It comes back as unable to detect due to multiple aberrant chromosomes which may be maternal neoplasia. Get to see a genetic counselor and get told there is about an 80% chance I have cancer but there’s no telling where because I have no symptoms and my bloodwork is fine. They were able to squeeze me in for a US that day and baby was looking great for 15w. \n\nI end up getting into a NIH study and go to Maryland for a whole body MRI and work up. It’s confirmed - I have a colon wall thickening and an 8cm liver mass (about the size of a baseball!!) \n\nThings go quick from here - I got in with the local cancer center. I got 2 more MRIs, a sigmoidoscopy, a colonoscopy, and a liver biopsy to confirm colon cancer with liver met. Then a port placed for chemo. \n\nSo now I’m currently on round 5 of chemo at 30w. I go every other week for chemo and OB. Growth scan of baby is looking good and my liver met is shrinking. They’re planning on me delivering at 35w then I go back for more chemo, radiation, and a liver and colon surgery. \n\nBut pregnancy wise? I keep saying I’ve felt pretty much fine this whole time. Still no symptoms other than fatigue and chemo stuff but I would’ve had such an easy pregnancy otherwise so I am so lucky in that regard. \n\nTLDR getting pregnant may have saved my life from asymptomatic stage 4 colon cancer ","score":1038,"num_comments":62}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1n1n8p7","author_hash":"0017b4ec98632600926f9109a17a4cb5582d4da862bf70068a4435cd896cd63b","created_utc":"2025-08-27T17:22:17+00:00","title":"My doctor keeps fat shaming me?","text":"Hey guys.. so I’m 28 weeks pregnant with my rainbow baby. My husband and I are beyond excited but lately my doctor has been making comments about my pregnancy weight gain.\n\nI started my pregnancy at 160lbs and I was very lean due to a strict calorie deficit and heavy weight training. I’ve been on that regimen for 5 years and when I found out I was pregnant I stopped lifting (I’m scared to due to my losses in the past) and obviously that calorie deficit went wayyyy out the window. I have gained 30 pounds so far this pregnancy and this is the reason she’s been making comments.\n\nAnyway, my most recent doctors appointments have gone very similarly. My doctor comes in and tells me I’ve gained more weight (no shit ma’am I’m pregnant). She has threatened me with gestational diabetes if I don’t stop eating- and when the glucose test came back “perfect” (according to the nurse staff) she seemed like she got more bothered. She said I’ve gained 30 pounds already and I was supposed to gain that the entire pregnancy.\n\nNow she’s telling me if I keep eating I’ll paralyze my baby during childbirth and tells my husband to stop feeding me so much- I don’t even eat that much lol I don’t know why I am gaining as much as I am.\n\nI can’t help it, if I’m hungry I’m eating. I’m not going to starve my son and not eat to try and fit into a specific number.. but I can’t help but cry and feel like a horrible mom already before he’s even born due to her comments","score":191,"num_comments":275}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1lkijay","author_hash":"2b057edb9a882f20c40bcc70911eb750f80c6ef460506a68cb94e7bd4844ccc7","created_utc":"2025-06-25T21:45:19+00:00","title":"Whatever you do don’t let your husband convince you that you can host your in-laws two weeks postpartum.","text":"I gave birth two weeks ago. I’m feeling pretty good but still recovering. Before giving birth I told my husband that I didn’t want to host anyone for at least a month. We also live in a small house and don’t have space to hosts. And if they do want to come then they should stay not in our house. \n\nWell.. guess what happened. As soon as our daughter was born, she sends the dates she wants to come and he runs them by me. What am I supposed to do with them? Say no? It has been depressing me all two weeks returning home that MIL will be staying with us for a week. All so that she can see the baby. And it coincides with my birthday. \n\nWell. The day came and she bursts into our house and pries the just breast fed baby out of my hands without even acknowledging me. Not even a hi. I’ve never felt more disrespected and  furious. Now every time I see her with my child it makes me so mad that I have to lock myself in my room. It’s about her experience over mine and it drives me insane. \n\nAfter a while she asks me how I’m doing. And I’m just sitting there thinking “how do you think I’m doing after two weeks? I haven’t even stopped bleeding yet. And my boundaries and one wish I had of staying home alone without guests staying over has been crossed because of you”. My family lives near by so they have visited but she’s my mom. She cares about me first. She brings food, she hugs me first before my baby. \n\nNow I’m depressed the I have to deal with this for a week and my husband doesn’t have the guts to set boundaries with his mom. I don’t ever want her staying with us in the future. I know she’s going to try to come during Christmas too and I really really want that to be just us three at least in the morning. \n\nAm I just being a bitch? Am I the problem? \n\nEdit: I fully acknowledge that it was my fault for not saying no when asked. Otherwise my husband would have told her no those dates don’t work. I’ll have to work on being more assertive in the future. \n\nFWIW my husband did communicate that I didn’t want visitors for a month before I gave birth and she (an extrovert) didn’t understand where I was coming from (an introvert). Then asked for specific dates that was within the first month two days postpartum. \n\nBut thank you for all the advices and support and telling me to grow some balls.  ","score":599,"num_comments":143}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1cl1adb","author_hash":"ff8632b49df4b082134481476ad3ca9fc7dcca7659893e8685e21551d8a6ffae","created_utc":"2024-05-05T20:57:33+00:00","title":"I am so glad that I did NOT have a birth doula","text":"Pregnant with our first child, my husband and I kept hearing endless benefits of hiring a birth doula. We were planning on a natural unmedicated birth, and it sounded like a good idea to help us navigate the process- lots we didn’t know about.\n\nWe ultimately decided against it. The cost was about $2k and we didn’t love any of the candidates we were talking to. Despite friends and family recommending a doula, we weren’t feeling that the benefits were strong enough to outweigh the cost. We decided that my husband would fill the role of mediator between me and the hospital staff, advocate for our preferred birth plan, and coach me through the pain management techniques we had identified beforehand. \n\nBirth was INTENSE, but everything went well. My husband filled his role as “daddy doula” magnificently. He’s naturally a very caring, mindful, and competent person; he felt up for the tasks, and after it was all over, we both agreed that a doula would have just gotten in the way and taken energy away from us. We’ve always had great communication and even through the intensity of birth, that held true.\n\nWith all the pro-doula content out there, I felt it was worthwhile to mention that it can be even better to go without one. Depending on your unique situation:) \n\nImportant edit: Our entire maternity and birth experience was with a hospital that’s widely known for its excellence in birthing protocols, particularly with midwifery. Their staff and protocols were fantastic- they perfectly adhered to my birth preferences that I submitted in writing beforehand and did not push their own agenda. Thank you for the comments! Having a doula may be helpful for advocacy in a less supportive environment.","score":1191,"num_comments":265}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1nafj8w","author_hash":"ec9d8ac5d36c361483d85fc769b782d02acc3a509682c1e3ae512788d15666ff","created_utc":"2025-09-07T00:38:33+00:00","title":"Why is it so hard to find actual facts about alcohol and pregnancy??","text":"I just found out I'm pregnant but I drank VERY heavily in the last month. Whatever, I was the most depressed I've ever been in my life and I thought there was no chance I could be pregnant. I'm 35 and have never been pregnant before.\n\nI just can't believe how hard it is to find actual statistics with heavy alcohol use in the first five weeks??\n\nAll I'm finding over and over is \"there is NO safe amount of alcohol\" Yes, no shit. I'm trying to decide whether I drank too much and should abort or whether it'll be safe to continue. \n\nIt all feels so condescending. Like we can't let women have hard facts or they might decide to drink or something.\n\nI'm about to choose to have an abortion because I don't want to risk FASD and I don't even know if I'm over reacting. \n\nEdit: Thanks everyone for the reassurance and recommendations. I have a lot to think about.","score":198,"num_comments":228}
{"platform":"reddit","community":"r/pregnant","post_id":"1imbp8p","author_hash":"174435dd38f9957e83031d1a0fdae592121b20d6100e38108de09323749ee228","created_utc":"2025-02-10T17:31:04+00:00","title":"Please appreciate your pregnancy","text":"Tw: Stillborn\n\nI just wanted to let it out because I’m broken. I had a great pregnancy and nothing was wrong even until 2 days before I gave birth. She was moving and kicking and I did a stress test with perfect results. 2 days later when I arrived at the hospital in labor they couldn’t find a heart beat. \n\nWhen I say I have never felt this much pain in my life I mean it. I love that little girl with my whole heart. She is my first baby and I know life will never be the same. I honestly can say I wouldn’t be upset if I died because hopefully I could see her again. \n\nI’m saying all of this to say PLEASE love the baby in your belly and enjoy every second you can. Every kick, every pound you gain, just everything!!!! Even if you have the baby already please give them some extra love and enjoy the sleepless nights because some baby’s don’t make it home. I would trade my entire life and everything I own to have my beautiful baby girl back. \n","score":3962,"num_comments":371}
{"platform":"reddit","community":"r/pregnant","post_id":"1l6hxer","author_hash":"b2e384dd292d07e0ba90221a051abb5bab760093e7a0a01779d65d44e9131c70","created_utc":"2025-06-08T17:36:52+00:00","title":"My OB’s 3 rules of pregnancy","text":"1. It’s not a disease state. You can do basically anything you want and don’t let anyone tell you differently. People love to say “Are you sure you should do that?” and I’ve been using this line in response. It’s not a disease state. My body will tell me when I need to stop. You could go from couch to 5k during pregnancy if you wanted to. There’s nothing WRONG with you. You’re not ill. You’re not diseased. \n\n2. Don’t let anyone else steal your pregnancy. It’s YOUR baby. Not your mom’s, not your MILs, not the random aunt who thinks she knows everything. Ask for advice if you want it but don’t let anyone steal it from you.\n\n3. Don’t make it miserable. If you want a hot dog, eat it. If you want a Jimmy John’s sandwich, eat it. The chances of you getting any type of illness is so small that it’s not worth stressing over. Drink the caffeine. Do what you want. Don’t be miserable.\n\nAs a FTM, these 3 rules helped calm me so much and made me realize things we read on the internet as not as likely to happen as everyone wants us to believe! \n","score":2035,"num_comments":260}
{"platform":"reddit","community":"r/pregnant","post_id":"1in21um","author_hash":"50fd4b6562def48c0988e2908bbc8f05e7965b6b99332ab59a094b73957af618","created_utc":"2025-02-11T16:05:49+00:00","title":"Has anyone had a successful first pregnancy with no prior miscarriage?","text":"I am just curious because when you look up chemical pregnancy and miscarriage it seems like a majority of women do have the experience prior to their ultimate full term birth. \n\nI am 4 weeks 5 days and have not ever been pregnant previously. Just curious if I have good odds of it being a viable pregnancy. Also, is it normal to not be seen at all until 8 weeks? That is what my gyno set up when I called. Thank you ","score":747,"num_comments":2015}
{"platform":"reddit","community":"r/pregnant","post_id":"1mqwbem","author_hash":"6344f5dd433e4e6afe26a17593c2ec2abfd476c05782eff1476f2a369a66efc0","created_utc":"2025-08-15T12:25:25+00:00","title":"I lied to a friend about my pregnancy but now I don’t think I’ll ever share news with her….","text":"I always said if I got pregnant, I’d wait until after my scan to tell anyone. My partner and I agreed and we haven’t even told family yet.\n\nTwice now, a friend has directly asked if I’m pregnant, and I’ve said no. Not to be shady, just to keep our promise.\n\nThis same friend just announced her pregnancy at 4 wks and revealed she’s having a baby with a man she met two months ago (despite telling everyone she was doing IVF). I congratulated her, stayed quiet, and planned to share my own news at a later date.\n\nA couple of weeks later, I was feeling really sick, about to travel, and she asked to meet to talk baby stuff. I didn’t want to lie again but also wasn’t ready to share, so I said I was busy packing and suggested after my trip.\n\nSince then, she’s told our whole friend group I’m avoiding her because she’s pregnant, and that I “must not be happy” for her since it happened quickly for her while I’ve been TTC longer, plus other comments I’ve asked not to be told.\n\nI’m obviously in a sensitive place and don’t have the energy to confront her. When I do share my news, it won’t be with her.","score":1182,"num_comments":176}
{"platform":"reddit","community":"r/pregnant","post_id":"1n7igcz","author_hash":"ebde1cc618c249dff674148ffdbdcfcafbe34e4b37c5167bffd1d687227bc847","created_utc":"2025-09-03T15:49:04+00:00","title":"Sister made cruel “antinatalist” jokes after I shared my pregnancy ultrasound","text":"My older sister and her boyfriend are self-described antinatalists, meaning they’re strongly opposed to having children. Because of that, I wasn’t planning to tell my sister about my pregnancy at all. Unfortunately, my mom told her against my wishes.\n\nI’ve been trying to stay level-headed about it, but today pushed me over the edge. I just had an ultrasound done and got so excited that I sent a photo to my family with my sister included. I (stupidly) was thinking it would help bring all of us closer together. Instead of being happy for me, my sister started making a ton of “jokes.”\n\nAmong them: \n- She sent a meme that said “Congrats on a complete fail.” \n- She called herself a “special breed” who doesn’t want kids and made it about how different she is.\n\nI finally snapped and told her if she can’t say anything normal, just be quiet. She replied “Idk maybe if I was expecting a scripted reaction I would go to the people who usually follow scripts”\n\nMy mom keeps acting like I’m a bad sister because I don’t speak to her directly, then when I try to, this is what I get. \n\nHere’s where I’m stuck:\n- Should I block her on social media so she doesn’t eventually see my announcement photos?\n- Should I keep everything private so it doesn’t get back to her at all?\n- Or is there another way to navigate this without her constant negativity?\n","score":572,"num_comments":315}
{"platform":"reddit","community":"r/pregnant","post_id":"1mzrz3k","author_hash":"7061fba4933f5fe2a722af56bdd45004c79cbc7c1ca71052bbb5ebdba8f8de8d","created_utc":"2025-08-25T14:27:37+00:00","title":"What's the \"hard pill to swallow\" about pregnancy?","text":"I think it's the fact that we control alarming little when it comes to what happens to our body. \n\nI think this is especially hard for us who are very much planners. \n\nWe can't predict our symptoms. We can't predict when labor will start. And we can't predict how labor will even go. \n\nThere's an illusion that we can do all these things and it will lead to XYZ but the reality is: our body and our baby will do what it wants and we just have to accept it. ","score":717,"num_comments":242}
{"platform":"reddit","community":"r/pregnant","post_id":"1mwjoc7","author_hash":"b0f1eac5c432dd8d1e81a9021584568c697ac02c4155dd6e3f6d60cd3222fb1c","created_utc":"2025-08-21T18:50:18+00:00","title":"Hospitals don’t have to tell you if your postpartum pathology is abnormal - even if it’s dangerous.","text":"I unfortunately had to learn this information the hard way.  I recently discovered that after two of my births, my placenta pathology reports came back abnormal.\n\n**No one ever told me.  I didn't even realize my placenta had been sent to pathology and that there were pending results at the time of discharge.**\n\n    •\t**2021**: Placenta showed large infarcts — areas of dead tissue caused by inadequate blood flow.  *This can cause, among other bad outcomes, stillbirth.*\n    \n    •\t**2022**: Placenta showed fetal vascular malperfusion (FVM) — a dangerous condition where the fetus’ blood flow is blocked or reduced.  *FVM is linked to growth restriction, neurological damage, cerebral palsy, and stillbirth.*\n\nNeither I nor my providers knew these results existed before my twin pregnancy in 2024.  That lack of knowledge directly changed how my pregnancy was managed.\n\nI’m a lawyer.  I was horrified to learn that **no federal or state laws require hospitals to inform you of postpartum pathology results… even when they’re clinically significant.**\n\nOften, results are auto-released to an electronic medical record (EMR), but unless you are combing through pages of labs and notes, you could easily miss them.\n\n*Unless you specifically request your pathology report, you may never know.*\n\n👩‍🍼I wish I had:\n\n    •\tAsked if my placenta was sent to pathology.\n    \n    •\tRequested the report.\n    \n    •\tShared it with my provider.\n    \n    •\tIncorporated it in all of my prenatal records for any future pregnancies\n\nThen tell a friend, sister, stranger on the street - anyone and everyone - about this.  It will save lives.\n\nI am outraged. Maternal healthcare is… I honestly can’t find the words. It’s a crisis, an outrage, and, in time, will undoubtedly be considered one of the great shames of our time.\n\n***This is a systemic gap that leaves women uninformed about potentially life-threatening complications.***  And the solution is so simple: notice, communication, due diligence.\n\n**This is about giving women information about their bodies that they have a right to know, and need to know, so they can protect themselves and their babies.**\n\nWhen I find a spare moment (I have four kids under 3  - long story, told I was infertile, oldest is IVF, the other three natural), I intend to push for legislation mandating pathology notice to postpartum patients.\n\nUntil then?  **Tell every woman (and hey let’s just say** ***people*** **because this is not just a women’s issue it is a human issue) you know.**\n\n**Over & Out.**\n\n**Edit 1 (for clarity):** Thank you to those who pointed this out.  🙏.  It’s not technically the hospital that’s responsible for telling patients about pathology results.  **It’s the ordering provider.**\n\nThey’re the ones who should review, interpret, and directly communicate results. Unfortunately, that communication often doesn’t happen, which is why so many patients remain uninformed even when the findings are clinically significant.\n\n**Edit 2 (adding intention):**\nMy intention in posting this was not to alarm… quite the opposite in fact.  I posted to be helpful and maybe even prevent some potential harm from being becoming a reality.  Knowledge can feel heavy, but it can also save lives.  Women deserve full access to information about their own bodies.  Withholding it out of fear it may cause the woman “stress” underestimates us, and it takes our ability and right to choose for ourselves away- without our consent or knowledge.  That is something I can’t and won’t tolerate.\n\n**Edit 3: Apology**  For anyone who I have inadvertently harmed by alarming you, upsetting you, or causing you stress, please accept my sincere and most serious of apologies.  It is the farthest thing from what I set out to do.","score":1180,"num_comments":138}
{"platform":"reddit","community":"r/pregnant","post_id":"1mwtbmt","author_hash":"4df914324702e933c0602c8b3ee9e055d103367bab40867a15ee0e05bf025f2a","created_utc":"2025-08-22T01:27:55+00:00","title":"Pregnancy loss at 20weeks","text":"Heyy! Just wanted to vent.\n\nLast Thursday (08/14/25), I went in for a routine follow up appt. Which was also my 20week appointment. I was extremely excited since I get to see my son and his full anatomy. He was healthy! My cervix was checked as well as part of the 20week appointment and everything went downhill from there. They found out that my cervix was open. I did not feel any pain or any signs of labor.\n\nAfter my ultrasound, my doctor shared her concerns. Upon the initial ultrasound she said it can go two ways. 1) She keeps me pregnant and everything is fine. 2) The baby has to be delivered and that is the end of the pregnancy.\n\nI was rushed to L&D immediately. Upon further exams, there was no saving the pregnancy. I was dilating, membranes can be seen, and I had an infection. They drew blood to test C Reactive Protein and it came back 6x higher than normal. My doctor couldn’t determine whether the infection caused IC or if the IC caused the infection. Either way, my doctor said her job at that point was to save my life. Which was extremely heart breaking.\n\nAnyway, I had my son on 8/15/25 at 7:05a and died peacefully in my arms at 8:45a. Prior to delivering at 5:50a I asked my nurse if I can hear his heartbeat before I birth him. He had a heartbeat and hearing it for the last time broke my heart into a million pieces. We decided to name him Willow.🥺💙\n\nThis is the worst feeling ever! This is also my first pregnancy.\n\nHow did you cope with the loss? How long until you tried again?\n\n\nEdit: Wow. The amount of pouring support is truly appreciated! I felt so isolated because no one I know has really gone through the loss I went through and just hearing everyone’s story and then success stories after trying truly helped and is giving me hope. I truly appreciate all the responses! I was able to find comfort in everyone’s words. THANK YOU! ","score":1048,"num_comments":149}
{"platform":"reddit","community":"r/pregnant","post_id":"1j1qfjf","author_hash":"ad6dfbceca9434c5cf8fe13c576a81e314df7368eb50215fa116cebd727f635e","created_utc":"2025-03-02T13:06:40+00:00","title":"Don’t worry about postpartum and just love your babies.","text":"TW: Stillborn\n\nI lost my sweet beautiful boy two days ago at 36 weeks and 5 days to a cord accident. Before I was so scared of postpartum. I was terrified of the sleep deprivation and missing my “old” life. Now, I wish nothing more than to hold him. For him to wake me up and keep me up all night long. I can’t tell you the absolute emptiness I feel and the desire I have to just have him here in my arms. Mamas… when your babies come just love every single second with them. Don’t worry about anything else. Enjoy every cry and scream. All the good and bad. Giving birth and not hearing that cry when they are here is the most painful thing I have ever experienced. ","score":1525,"num_comments":216}
{"platform":"reddit","community":"r/pregnant","post_id":"1jwwrb2","author_hash":"5e0d2451ab720da05528d2e4d2239c4b751567e1246867c2b5b592626eb991c6","created_utc":"2025-04-11T18:21:08+00:00","title":"Nasty things my MIL (or family member) has done during my pregnancy MEGA THREAD.","text":"I’ll start: \n\n1. Sent me a long, critical text about nutrition and an Amazon cook book for pregnancy because she saw me drink one Diet Coke at Christmas. \n\n2. Asks me for bump photos then says nothing about them… why? What’s the point? How about saying I look cute…wtf? \n\n3. Asks me for ultrasound photos of the baby. Sent her some 3D ones. She then went behind my back and texted my husband asking him what was wrong with our baby because she has “never seen a picture like that.” Basically insinuating there is something developmentally wrong or she finds our baby ugly. \n\n4. Has stated multiple baby names we “cannot use” because of HER personal experiences with people who have this names. ","score":656,"num_comments":448}
{"platform":"reddit","community":"r/pregnant","post_id":"1lx71fu","author_hash":"b713715053bbf7d84b1057fcf04b04fe1858b081285e80247b0bccc41025a04e","created_utc":"2025-07-11T13:33:47+00:00","title":"People who don't think pregnancy is disabling","text":"I saw a Facebook post that Florida is now allowing pregnant women to get a disability parking permit which I thought was wonderful. Unfortunately 90% of the comments - including a shocking amount from women - seemed either furious about this or were just mocking the idea of pregnancy being a disability. I've had a relatively easy pregnancy personally, and I still have lots of days where I park as close as I possibly can because it literally hurts to walk! I can't imagine if I had actual significant complications! I just wish people would have more empathy for how difficult it is to grow a human being.\n\n  \nETA: there are definitely very valid concerns about disabled parking already being limited and that this would take away spots from disabled people who need them. I didn't mean to be dismissive of people with other disabilities and I agree that not every pregnancy is disabling or disabling to the same extent, I was just disappointed that so many people didn't even understand why this might be needed!","score":637,"num_comments":266}
{"platform":"reddit","community":"r/pregnant","post_id":"1mcqqqc","author_hash":"f9381d0ee36ef2d5476be31c23733782cd78018de7d71ff4be188d87f9d5dcaf","created_utc":"2025-07-29T23:17:09+00:00","title":"If you’re getting a c-section, read this!","text":"I’m writing this because I know it would’ve made me feel better to see prior to my c-section birth. \nThe entire process, start to finish and entirety of healing was seamless. And so much less than I thought it would be. The spinal block was 1/10 as painful as I thought. The tugging sensation was odd during the procedure, but I had no pain or chest tightness. The worst part of the entire process was when the nurse would come in to rub my uterus afterwards. But that got better every time. My pain was well controlled and honestly not that bad. I was carrying laundry up and down stairs on post op day 3. I’d do it over and over again if it meant I got to experience meeting my son again. \n\nI’d choose it over a vaginal birth every time. Don’t worry mommas. It’s not half as bad as you’ve probably built it up to be in your mind. ❤️ ","score":699,"num_comments":205}
{"platform":"reddit","community":"r/pregnant","post_id":"1k8hfos","author_hash":"63cd161f19c328b729b739f09620f05a80a1ac8d98e475844e29ef9d62fda797","created_utc":"2025-04-26T16:50:19+00:00","title":"Challenging weird comments about having girls is my favorite part of pregnancy","text":" Edit: Obligatory “this post blew up!” But in all seriousness I’ve come to the conclusion the only way to fight sexist comments and mindsets is to immediately challenge them in the most critical and direct way possible. Don’t flinch, stare folks down, force people confront their sexist views in real time. If they double down, triple down! \n\nFTM and I’m having a boy. Without fail when I tell someone I’m having a boy the conversation goes something like this:\n\nThem: “Omg your so lucky to have a boy first”\n\nMe: In the most deadpan voice I can muster “thank you, what’s so lucky about having a boy first?”\n\nThem: (they start to squirm) “well boys are just easier to have”\n\nMe: (while looking straight in their eyes) “how so?” Can you explain? \n\nThem:  (Forced to confront their misogyny in real time) “Girls have an attitude”\n\nMe: “Really?, I just watch that little boy throw his entire happy meal on the ground, is that having an attitude?”\n\nThem: looks away\n\nI’m so tired of the world discriminating against girls before they’re even born. Boy moms, we have to be a part of the fight back! \n\n \n\n","score":1060,"num_comments":198}
{"platform":"reddit","community":"r/pregnant","post_id":"1j7520c","author_hash":"3616e0f77d808102bd1e6fae2492dff88a8aaaf2184e5315f68a236c7793dbaa","created_utc":"2025-03-09T10:42:21+00:00","title":"What’s one pregnancy symptom no one talks about?","text":"One of them is skin tags around the nipple 😅","score":390,"num_comments":1197}
{"platform":"reddit","community":"r/pregnant","post_id":"1iy5f4c","author_hash":"3d44d6cb4d764f5a8c538bfdc66da22f00daff7b41d090d7fde38e38f4b5e50d","created_utc":"2025-02-25T20:48:55+00:00","title":"We listen and we don't judge - Pregnancy edition","text":"I go first-- I fart all day to the point that it could be a health hazard to my household","score":527,"num_comments":623}
{"platform":"reddit","community":"r/pregnant","post_id":"1mmwxn5","author_hash":"c4af4fb797ab397b46327c44d25f23b67b94eb51d6fc5bbbd06dca4b194c213c","created_utc":"2025-08-10T23:04:42+00:00","title":"MIL trying REALLY hard to convince my husband to sleep at home after my c section","text":"Having a c section next Monday and my Mother In Law keeps trying to convince my husband that during my 4-5 day hospital stay after my c section that he should go home to get \"good sleep\" at home instead of staying in the hospital. For reference, our hospital has pull out couches for dads to sleep on. So, he will have a mattress. We also live 45 mins for the hospital so it's not like he would be nearby. I'm also having a c section because I'm high risk and will need help getting up and getting the baby, etc. We have both told her absolutely not. And she keeps pushing it. I'm sorry, but what the ever loving fuck!?! This isn't the 1960s??? Why would he need good sleep but I'd be totally \"fine\" on my own caring for my 37 week newborn by myself less than 12 hours after major abdominal surgery and every night after that? Like who the hell even thinks like that!?! And why on earth would she think that my husband would even want to leave. He doesn't. He's terrified of leaving my side during this and does not want to be apart from the baby. Insanity! ","score":654,"num_comments":176}
{"platform":"reddit","community":"r/pregnant","post_id":"1lbcoab","author_hash":"dba155f78fcb8eda801687a86496450f404608b0eea626178e0f11a6f6b1a9e3","created_utc":"2025-06-14T16:25:38+00:00","title":"I’m having a great pregnancy 🤷🏼‍♀️","text":"I see a lot of miserable posts on here. I’m 25weeks on Tuesday. I’ve been scared of pregnancy my whole life. I’m honestly so surprised and relieved it’s been so chill. Of course there is the 3rd tri which may kick my butt. I don’t know. \n\nBut I have to say not everyone out there has to be miserable? Surely some are having happy pregnancies? \n\nI’m stilll able to work out and go to regular yoga classes. I haven’t been sick at all. Going to work every day but cannot wait to be on maternity leave. I haven’t had any mood swings, my emotions feel the same. No major cravings. My eating has been the same except increasing calories a bit to get more nutrients for the growing kid. The baby has been chilling low so far so that probably helps with my activity levels not really being affected yet. I just feel great and lucky and that is it.\n\nEdit: guys I’m still holding my breath for the other shoe to drop, don’t get me wrong. I’m well aware that there are high chances something will come up. But also I love seeing a bunch of other happy pregos here who are taking a moment to be supportive and grateful for some (so far) easy pregnancies ","score":492,"num_comments":332}
{"platform":"reddit","community":"r/pregnant","post_id":"1kz4rvu","author_hash":"d4ac17db6af96fcd32f3d1ecf8957223a514109f356227bbbc1bd86ccdce0745","created_utc":"2025-05-30T13:52:22+00:00","title":"When did you give birth with your first pregnancy?","text":"Hi, I’m 33 weeks now and just very curious as to soon baby girl will come. Please if you guys could reply with what week the baby came or when labor started. \n\n***Please keep negative experiences out of the comments (unless they have the happy ending for you & baby). I’ve had a few issues this pregnancy, been the hospital a few times (mostly HG, hypertension tho it’s been settled for a while now and severe dehydration due to to hg). Also I’ve been a huge hypochondriac my whole life so hearing the negative stories will make me spiral. \n\nUpdate: overwhelmed by all the replies 🩷🩷🥹Thank you much mamas for being so positive and answering w detail! It seems the general consensus is exactly what the stats say aha I thought it would be earlier for some reason since most ppl I know gave birth before 39 weeks but I want her to cook and stay in as long as possible so I can spend more time with her so I’m glad by the result of the replies! (I finish my school clinicals at exactly 40w). It’s also so nice and encouraging to hear so many good experiences, we often post about the bad/hard. ","score":246,"num_comments":819}
{"platform":"reddit","community":"r/pregnant","post_id":"1i35c1x","author_hash":"dd4c1f530015eab5f32ee87e80e2f1a38e4e2701054a2495233ee44d68082df8","created_utc":"2025-01-17T01:44:44+00:00","title":"Your favorite uncalled for comment on your pregnancy? ","text":"I walked into work today drinking coffee and my co worker makes the same comment I’ve heard from several others, “I thought you can’t drink coffee when pregnant?”, to which I say that I can in fact drink coffee, and guess what? I had sushi for dinner last night too. Her response- “that baby is gonna come running out to get away”. That’s not even my favorite comment I’ve heard either, my favorite was “you know you don’t have to have it right?”. After I announced that I was pregnant around 14 weeks. Because I’d be announcing that I’m pregnant if my intention was to terminate?? What are pregnant women treated this way?? ","score":544,"num_comments":586}
{"platform":"reddit","community":"r/pregnant","post_id":"1hz9x0p","author_hash":"c5e68e799d2fdc451be6745b04ffef23ed88fb44da907502c52364cd6a7ce91d","created_utc":"2025-01-12T00:12:11+00:00","title":"Does pregnancy actually fly by!??","text":"I’m a first time mom and am 14 weeks and I had the most hellish first trimester. I found out out 5 weeks and feel like this has been the SLOWEST 9 weeks of my LIFE! People keep telling me, “baby will be here before you know” and, “time will just fly by” but I feel like this baby will NEVER be here lol. ","score":521,"num_comments":624}
