{"platform":"reddit","community":"r/blackladies","post_id":"1ks8bqs","author_hash":"227efec5e62a1e47f99b2368afb871c6c1494a110abce3645afa8222f8be4a18","created_utc":"2025-05-21T20:32:35+00:00","title":"First in my family to get a doctorate/ MD!🥺","text":"My grandma, who immigrated here, no high-school education, and worked as a seamstress, saw her legacy today. I’m so emotional.","score":5956,"num_comments":196,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1kkq6u2","author_hash":"5f4bde3ecd87f751205d64f828839d40889a7873c2ba94352fa6fe699620ef23","created_utc":"2025-05-12T11:32:05+00:00","title":"Internalized Racism and FATPHOBIA within Black Women: Exhibit A: The Black Woman statue in NYC","text":"I have seen a myriad of think pieces on this statue & to say most of the comments I’ve seen coming from black women are abhorrent is an understatement. Is the statue necessary for a specified purpose? I don’t know? Could they have put her in maybe more flattering clothes? Maybe. But to say that the statue is painting the community of black women to be “conventionally unattractive”, “big”, “loud”, “ugly”, & “ghetto” is insane and honestly idiotic. Do you all think we’re homogenous? NOT EVERYONE IS BUILT THE SAME! THEY’RE ARE VERY MUCH BLACK WOMEN THAT LOOK LIKE THAT? You all say you want to divulge away from constant stereotyping when you actively feed into them with the rhetoric which if you really think about what you’re saying before you post sounds of the same rhetoric that has been used by oppressors in the first place. It’s only “black is beautiful” & “black from infinity to infinity” if they look like conventionally attractive. Shame on you. ","score":468,"num_comments":304,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1bi1oh1","author_hash":"a24f59a6708ff6f26db78672a95938c214c58dba7529772a16cf2413de56b97b","created_utc":"2024-03-18T20:55:50+00:00","title":"Who is she? A DOCTOR!","text":"I graduated with my doctorate recently, and I’m just really proud of myself and wanted to share photos🥰 Attached are a mix of post-defense, hooding, and grad party! Happy to talk with anyone about the process if you’ve been contemplating the journey!","score":2044,"num_comments":174,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1gwn71t","author_hash":"a85c8dacd38af9f092e0373d45804444a2609892adf604cec855cd41af72e94e","created_utc":"2024-11-21T18:58:08+00:00","title":"I experienced overt racism today","text":"Today I went to a coffee shop. I took the day off to relax, and I thought I’d treat myself to breakfast. I get sat next to a group of palm colored women. The woman next to me immediately puts her purse on, which as a black girl isn’t unusual. But her friend says “are you going somewhere?” To which the other woman says “no, I’ve lost too many purses and I don’t want to lose another.” And they all laugh. To add Insult to injury, me and this woman are carrying the same exact bag in different colors. \n\nI get the waiter’s attention, thankfully a black woman, and tell her and I ask to move. The staff were very accommodating and even comped my meal. And the manager said “we do not play that here” as the woman got up to leave I called her out. Told her what she said was ugly and racist and she immediately started defending herself saying that I misunderstood her. And we exchange back and forths until I say “okay thats all” and she leaves.  I don’t always stand up for myself the way that I should, and I knew that if didn’t today it’d really bug me. And I’m glad I did. She looked embarrassed and I’m glad. I hope she ruminates on it all day long.","score":1502,"num_comments":118,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1lsqre8","author_hash":"55838c51ca290a26bef09e8396488f35029ca624c4b8929eede43333ac323858","created_utc":"2025-07-06T02:42:33+00:00","title":"Getting back to myself postpartum","text":"I’m 30 days postpartum and am feeling like im built weird. Im breastfeeding my baby and am looking for tips to make my boobs appear smaller. I was more top heavy but not as disproportionate \nAs I am now. First two pics are b4 my sweet baby Maybe a new wardrobe I was thinking earthy black girl(locing) my hair soon. But I want some tips and advice on hair and wardrobe and feeling like me again after having a baby. Im 120 ish pounds im looking to build this booty so gym membership coming soon. And my mom said some plastic wrap and a waist trainer. But what else can I do? \n\nIm open to all positive tips and will post results in September b4 I go back to work ","score":1092,"num_comments":49,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1lim7nj","author_hash":"f41d536e788e189c836af20e87c83cd00d677ed1ba8630d9cb08bba9a19a6526","created_utc":"2025-06-23T17:07:58+00:00","title":"Can we stop asking where’s the ring on people’s pregnancy announcements?","text":"It’s so rude and tacky. \nI keep seeing people do it on folks posts and it’s so unnecessary. \nSame with a woman posting pictures of her and her kids and people asking where’s the dad.\nSocial media is rotting people brains","score":196,"num_comments":217,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1kasrlq","author_hash":"aa1f746cd22a88f1764f7d38f222ac44418e9d6d7beac6c47a7281bd35d33869","created_utc":"2025-04-29T16:51:15+00:00","title":"I love when racism backfires...","text":"So at my job we have a large demographic of Hispanic customers. Most of which are incredibly easy to communicate with because they're typically just coming and picking up a order that was placed by someone who speaks English a bit more fluently. But then there's times where we have DIY customers come in who speak English just fine, however for whatever reason they choose to work with a Hispanic employee.... \n\nNow I'm sure anyone reading this in this sub, can understand the vibe someone gives when they clearly don't want to work with you. Now there's a difference between me calling my coworker and having him translate and then fulfilling the order, which happens all the time. No, these are customers that specifically want to work with someone Hispanic and no longer want me involved in the situation.But little do they know, our Hispanic employee is currently our worst employee. He's been there almost a year at this point and is still making mistakes that he made on day one. \n\nI absolutely love when customers request him specifically. It has not failed once that he has not only messed up their order, but he takes no less than 2 hours working on it. On top of that, our manager is also a black woman.... So ultimately they still have to work with a black woman 😂 \n\nI've seen so many customers choose to work with him and leave disappointed or they leave and then call back and complain. \n\nI absolutely love it. \n\nUPDATE: the kid just sold the customer a random product because he didn't know how to do the color match the customer was asking for.....🤦🏾‍♀️","score":826,"num_comments":75,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1kk5wqn","author_hash":"09cdad09ba6f2f83a2bfc9d3a4afed19207d2b18a879d1d98f6f5b657bfa8561","created_utc":"2025-05-11T17:09:02+00:00","title":"Can’t believe some people deny racism exists in their country","text":"I was hanging out with some Moroccan friends, and we were talking about different cultures and which ones we imagine marrying into. They asked me if I could ever see myself marrying an Arab. I said no. When they asked why, I was honest and told them because of racism.\n\nI understand that not all Arabs are racist, but a part of me feels like even if the individual isn’t, their family might be. I worry they wouldn’t accept a marriage with someone who’s Black.\n\nMy friends were genuinely shocked. They insisted that Arabs aren’t racist and that they don’t look down on black people and dont see color. But guess what? I’ve been called the N-word,slave and more as an insult multiple times by Arabs.\n\nMaybe its because im self aware but i thought everyone knew there was racism in their country.","score":392,"num_comments":79,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1hc80f3","author_hash":"4599e6c151b1567d8aa535551282d89ee95f0a781c7af375c09d1e0fea2bff22","created_utc":"2024-12-12T00:01:47+00:00","title":"Racism as a Black woman in the Anime community","text":"I just really needed to vent about the racism in the anime community. I think it’s so fucking ridiculous. It’s hard being a woman and even harder being a black woman, but being both and liking anime? It feels like a target is on you for misogyny and/or racism. \n\nEven with men that try to talk to me. They try to quiz me on anime shit? I was literally at American Deli and the cashier was quizzing me on Naruto. I had a Naruto shirt on and he had one of the Akutsuki rings on. He said “Whose is this one?” I just starred at him. It was Itachi’s but I’m not feeding into that shit. Just give me my damn food.\n\nThe stuff that’s going on with DanDaDan right now is really blowing me. A 16 y/o made fan art of the two main characters and she made them\nBlack. The English VA’s (one of them is black) came to her rescue and made the art their pfp on Twitter. Someone from Japan made this long ass post about how the black one needs to be fired. Like wtf? The comments were INSANE. I’ve never heard of blackwashing a day in my life until this started. Mind you the intro is like Jersey Club. Apparently there’s some references to Rihanna and someone doing the Harlem shake but when the characters are made black by a fan it’s a problem???? Like you hate the culture but you want to take from it?\n\nThis shit is so disgusting and goofy as hell. I want black people to start gatekeeping so bad. I want people to realize they don’t really have the culture they think they do without the blueprint. I just want to watch them scurry and try to have fun without us being the butt of the joke. This shit is getting so old. It stresses me out and I hate being around stupid people. Elon Musk ruined Twitter. The election results ruined the rest of my year. Like this is just too much.","score":341,"num_comments":125,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1jczg65","author_hash":"7522b922b6028c9832dbc4668f520e5422ec8272e7913b9bbd07b52ebd35e21a","created_utc":"2025-03-16T23:56:10+00:00","title":"Walmart racism in the self check out lanes...","text":"On several occasions when I go to my local walmart, I notice that the workers will come nearby to where I am self checking out and watch me the whole time. I feel like this is covert racism to assume that because I am a poorly dressed black woman, that I plan on stealing stuff. Last time it was a teen black boy that came up close to me and started watching me! Like dude wtf you are black making another black person feel vilified. How dare you do that to your own kind? Well I guess it doesn't make a difference even if he is a Walmart employee. Regardless I'm pretty much done shopping in Walmart stores because I'm tired of the bs. Or the next time I do choose to shop in store I think I'm just going to make the employee uncomfortable af. I'm tired of feeling bad so maybe they can feel bad right there with me. Has anyone had a similar experience?","score":185,"num_comments":118,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"wbi9a6","author_hash":"67845722233b7242273a11e10b4527afb748fb23f7e74b8ccaee497cce9c6bf6","created_utc":"2022-07-29T23:00:09+00:00","title":"Yesterday I defended my Dissertation and became a Doctor!","text":"Just wanted to share this achievement with my fellow Black ladies!","score":1474,"num_comments":100,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1i9a30c","author_hash":"b108f040a3cd17aba203e83598b6897475fd8bf9b55a9bf55bb0802faf353a2f","created_utc":"2025-01-25T00:08:11+00:00","title":"This is probably just me, but it seems like reactions are bigger towards issues like anti-semitism vs. racism towards Black people.","text":"Twitter/X was always a place full of shit. With Elon Musk doing the Nazi salute, I’m seeing subreddits banning X/Twitter links, and that's great, but that should have happened a long time ago…\n\nWith the amount of racism, bigotry, etc., that I’ve seen from Musk and so on…why weren't Twitter links banned before? \n\nWhy aren't threats towards us taken seriously?","score":358,"num_comments":82,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1ehquxv","author_hash":"91c9aad47c5685f404649dc354d4f873ed0ec81bf9ed2e691ce4419f51372bd6","created_utc":"2024-08-01T20:26:24+00:00","title":"How y’all feel about Cardi B “divorcing” Offset for the 10th time and her announcing her pregnancy? 🤔","text":"The news just dropped today, what’s y’all’s honest opinions? You think she’s going through with it this time? ","score":183,"num_comments":211,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1dkr2ec","author_hash":"10689135a03f97f03e375690b614812610877432675c18e0237b51efab044f22","created_utc":"2024-06-21T00:34:18+00:00","title":"Do yall deal with racism in California as a black woman ? ","text":"I’m from nyc and I can’t help but to notice these ppl are mean and racist. I’m not looking for friends or boyfriends or anything in cali but just going at everyday life it’s weird over here being black. \n\nFor context I’ve been dealing with a lot of racism from other non-black women and non black gay men. Primarily Hispanic, Russian and Asian women. ","score":183,"num_comments":228,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1jkdyeq","author_hash":"532233ae98e5e7baae229df000de775d495e1af7e5346c9a877ea7bae518f0e3","created_utc":"2025-03-26T15:06:07+00:00","title":"Sick of white people's racism being excused at every life stage.","text":"I was perusing a sub about a popular kids' dance show and one of the posts discussed how two of the shows' stars were apparently racist and dropping N-bombs at 8, 9, and 10 years old, and everyone in the comments is excusing it. \"Oh, the early 2000s-2010s were a different time\" or \"Oh, when I was younger, we all said racial slurs and other racist things, we were just kids, we found it funny, we didn't know any better.\"\n\nIsn't it funny to y'all how white people get excused from that BS at every stage of life? When they're a kid, it's \"oh they're just kids, they don't know any better.\" When they're teens or young adults, it's \"oh didn't you say or do anything stupid at that age?\" Finally, as an older and/or elderly person, it's \"oh, they were raised in a different time.\"\n\nYeah, that's all well and good, but what does that say to the black people who had to bear the brunt of those things at every stage of life? When I was a kid, I had to move schools three times before even reaching high school because the racism was so bad, and it was always explained or excused away with things like the statements above. It's so funny how they constantly get excused for that, but our experience is constantly dealing with that at every life stage. What's also funny is that neither myself nor the other black people I knew growing up ever said or did anything like that to people growing up. Any time someone in school would get in trouble for saying or doing something ignorant or racist or prejudiced, it was always the white and nonblack kids (because, let's be real, there's no *pee oh cee* solidarity, and they partook in the casual \"jokey\" racism just as much as their white counterparts).\n\nIf we're just supposed to accept that white and nonblack kids and teens going through a racism phase is a fact of life, then that means that we're also supposed to accept that black kids just have to deal with it and grin and bear it. And for adults to keep making that tired ass excuse is so pathetic and I fear for the children they may be raising.","score":469,"num_comments":45,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1laj0ad","author_hash":"0b7dfc2219239c265023e2a75841bab310d91a3826b3cd524c15458ee64be29b","created_utc":"2025-06-13T15:34:52+00:00","title":"Something dawned on me about racism.","text":"Now I know I'm not reinventing the wheel here but something dawned on me the other day. I feel like this is a safe space to share my idea because I know I'll get some insight. I should have wrote it down sooner because it was much more eloquent in my head the other day but I'll try to keep it short and sweet.\n\nI think black women are always looking at other people as equals. While racists look around for people they can look down on. It's this pseudo social hierarchy that non-racist people don't subscribe to.\n\nThis is also why I think black men hate black women. Black women are the only people they feel they can punch down at. Putting other races on a pedestal leads to self hate which generates the hate towards the only group black men see as beneath them aka black women. \n\nI know what I'm saying is not a new concept but  reiterating that racism is a flawed mindset. Some of us only see others as equals while others live their lives assessing who they can treat worse than themselves. It's a miserable mindset but too many people refuse to break free from it. ","score":356,"num_comments":40,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1mpx19l","author_hash":"0af3907135d4ad2059ebfd871b80e68b28d1600466237f6382e6e99ccab64e2c","created_utc":"2025-08-14T10:40:47+00:00","title":"Random vent abt racism","text":"I complemented this girl in a comment section a couple days back. I just thought she was pretty, I said so, she replied with something along the lines of “Noo I look bad in that photo” and I reaffirmed my statement.\n\nSkip to today, I see a video about black woman.. there’s this comment on it and I open the replies. Some chick replied with the “Types Of Headaches” meme format, except on the bottom right it says “when a black woman speaks.” \n\nI click her profile.\nThe girl I complemented? She was in that comment section. A racists comment section. Not just in passing, no. Specifically having come from the same comment I did to tell her that the black woman of whom she was being racist to was wrong and that she was so much prettier and right. \n\nIdk this just really hit me for some reason. Like literally ANYONE can be racist, and that just makes my heart hurt so bad. Anyone. It’s not just the evil ass tripleKs, it’s women of color my own age. Girls who like what I like, talk how I talk. But they hate people like me! I just can’t wrap my head around it. ","score":239,"num_comments":39,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"17auz9g","author_hash":"7efd1f5cef79575a2583a5a4ecc51eb09375c962595408e482170877582e9d69","created_utc":"2023-10-18T16:32:49+00:00","title":"what do you guys think about the current criticism Halle’s about her pregnancy with DDG?","text":"I’ve seen so many tweets where people are acting like it’s the end of times, which I kind of have a neutral stance on, since we don’t really know these people and she seems extremely happy and excited!Plus she's said multiple times that she would love to have children\n\nwhat do y’all think?\n\nedit; I want to reiterate that I opened this post to discuss the criticism itself on social media and not her being pregnant, because that is her choice and hers alone, so I’m not encouraging any hate towards that!!\n\nedit2: i also wanted to make a point that halle has made so many accomplishments outside of her personal life, where people can still look to that and feel inspired, and there will be more milestones for her i'm sure, but i feel like people who think her pregnancy will affect her career life have to understand that its also public perception and criticism that can make or break a career (in addition to how much of her personal life she wants to put out there), not just the action of having a child alone!","score":158,"num_comments":322,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1iv2vzy","author_hash":"346a09808a4f9b15ee6bdd984625b65f77881d61b840ea2cf5776ad5b1509c35","created_utc":"2025-02-21T21:55:57+00:00","title":"Why does racism impact some of us more frequently than others?","text":"First, disclaimers: I have experienced personal racism, and I believe systemic racism exists. This is not a “racism doesn’t exist” 🦝 post. I’m genuinely sad for all my people who have experienced racism at a higher level than me and who have to carry the burden of racial trauma. \n\nI absolutely love this sub! But I have noticed that a lot of people seem to be having a totally different experience than me when it comes to intermingling with other races. \n\nSomeone has been directly racist to me very very few times. I’ve never felt like someone at work or in a social group had it out for me because of my race. It’s easy and feels natural to me to make friends of all races, and they have NEVER even toed the line of being problematic. \n\nBut I hear so many other Black people not feeling the same way, which makes me wonder… what’s going on? \n\nFor context, I’m born and raised in the south in predominantly white areas. I’m not biracial. I don’t allow “friends” to disrespect Black people or anything like that. I wear a variety of hairstyles — not just straight hair. \n\nCan anyone relate to me? Does anyone have ideas about why racism impacts some of us more intensely?","score":83,"num_comments":116,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1kgjz67","author_hash":"8b140561146886b3631ebb13a1e64e338061468bde5e61ac237ff01a0746910d","created_utc":"2025-05-07T00:14:56+00:00","title":"Kiandria Demone Leads Effort to Hold Racism Profiteers Accountable Online After $650K Donated to Viral Racist Woman from Rochester, MN","text":"\"This is not a situation where I just wanna cyberbully [Shiloh] and have people talking about her bad dye job. I want to actually get in this situation and make a difference,\" Kiandria said. \n\n“I cracked HTML web code to expose the payment processor funding the racist campaign that is rewarding a yt woman for calling a Black child the N-word,\" Kiandria wrote on Threads.","score":445,"num_comments":31,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1ej8qg8","author_hash":"d7a9d5973101bced41c7850b1cc448f60bedfd080e14e9945c6600ea8d574ab6","created_utc":"2024-08-03T17:19:59+00:00","title":"the unchecked racism, misogynoir, and unsportsmanship surrounding the imane khelif discourse makes me so mad","text":"How in the world is this acceptable behavior for an OLYMPIC ATHLETE?? Imane needs to lawyer up and sue sue sue for defamation, and this hungarian woman needs to be disqualified.\n\nhttps://preview.redd.it/6t4xapb6ghgd1.png?width=828&format=png&auto=webp&s=c760fc99f5ffca3ce3b13397e799f5b9d1f91803\n\n","score":421,"num_comments":81,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1guhoof","author_hash":"a551844246d369f5fbb054f7ce19070c99051f3c60ffaead155e2cb05002813e","created_utc":"2024-11-18T22:34:47+00:00","title":"The white mother of my biracial friend wrote a book called “Racism: a white woman’s perspective”….I’m feeling some type of way about it","text":"So the book hasn’t been released yet but I was trying to be positive & give it a chance. However, today we all went to lunch as a way for my biracial friend (44F - she identifies as a black woman because her father was black) to introduce us all to her mother. When we asked her mom what the book was about, her mom went off on to give the following synopsis:\n\n 1) The white mother was raised in Michigan/Ohio back in  1950s in rural areas with no black people. Her father was a minister. Her father & mother always taught her and her siblings that racism was wrong\n2) the first black people she ever met and was around in mass was working a factory job in Ohio. I’m 1978 She was charmed by a black man who worked at GM and was married + pregnant by 1979 (my friends father)\n3) she moved into a black neighborhood in Cleveland and lived there but nobody (as in the black people) gave her trouble & everybody was always nice to her\n4) the book is ultimately about her experience as a white woman married to a black man & raising black kids 😒😑\n\nThere was nothing profound that I heard about this book or her story/racial activism in the 45mins of the mother talking…\n\nAnd Supposedly my biracial friend is the editor/co-author of the book, and this is supposedly book 1 of 2.\n\nAll I can say is what in the world?!?! Now I’m side-eyeing both my friend and her mother cuz WHY?!?!? what/who made them think it was appropriate in any climate but def not todays climate to release a book centered around racism and white women?!?!? Seems a bit tone deaf to me but I guess I should keep my opinions to myself\n\nI will not be purchasing the book.\n\nETA: yes I did ask the mother if she knew who Rachel Dolezal was…she didn’t 🤣 ","score":238,"num_comments":80,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1ki57sm","author_hash":"469c7b6bbc980b069c9e261e345182133d9a44ea75c679712aaee78184f77e9f","created_utc":"2025-05-09T00:07:36+00:00","title":"I have a question- is it normal to start hating everyone else due to their racism?","text":"I get not everyone is racist but this just doesn’t feel like enough. Like truly i feel like there is a bubble of hot contempt, rage and hatred for the anti blackness. And honestly I feel it’s justified. I didn’t ask to be black but it’s one of the most beautiful things about me and I’ll own it and flaunt it and appreciate and admire it until my dying breath. In every life time I don’t want to be anything but a black woman. We are gods/the universe/mother nature/etc’s greatest gift to this racist fuck hole planet. And the most hated. \n\nI’m starting to look at absolutely everyone with disdain and contempt. You hate us so badly but you want to be us. Oh I get it. I’d be bitter and jealous too seeing the beauty, integrity, intelligence and ingenuity that we hold as a whole; ESPECIALLY black women. But my god like the older I get the more I want the rest of the world to disappear. I want to be surrounded by ppl who love and support and uplift us. The downside is that I feel a very hard wall going up that I didn’t know I’d ever live to see. I never understood the outrage and that was because I always was in my own bubble. I had friends and me being black was never a topic of discussion, I was just me ya know. Then I get older and I have an entirely different view and I hate absolutely EVERYONE except those who look like me and even then not all skin folk is kin folk. I feel myself becoming so much angrier and in that anger I feel so much contempt for the world. I was already cynical as it is and this makes it so much worse. Way worse. \n\nA lot of goals in therapy center/ed around coming OUT of my shell and giving the world a chance, but I’ve seen enough. And I’m sick of this shit. I see no reason to give the world a chance- NONE! I see no reason to give ppl a chance. I just am so angry and sad and I hate this planet I live on. I didn’t do anything wrong. WE didn’t do anything wrong and they hate us. I fucking hate being here. I feel like I’m living in the same space I did when I was a kid and was hated and talked about and judged by ppl I wanted to be my friends. That is such a deep wound and to know it doesn’t get better, it actually gets WORSE as I age is one of the most heartbreaking things I’ve come to realize 😞. ","score":217,"num_comments":46,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"113chby","author_hash":"c4b86d732528ef1136f5167db1ab9e06251806c35620b6845e33298cfe48ca5d","created_utc":"2023-02-15T23:56:29+00:00","title":"I exposed racism in my town, collected stories and bound this book","text":"","score":861,"num_comments":66,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"183tkbe","author_hash":"a3e505168e2b08b6c5fceda2be9f10c0c64dc98d1ea604de21a69f375d92d6af","created_utc":"2023-11-25T21:07:45+00:00","title":"The doctors office is the most fatphobic place I’ve ever been to","text":"The last time I was at a normal weight I was 6 yet no medical professional has ever inquired about me enough to understand why that is. It’s always “your fat and at risk for diabetes” and then I’m like okay through tears. Everything else is always perfectly fine yet I still leave feeling like shit every time. If I have any other concerns they won’t get addressed bc they’ll just blame it on my weight. It’s to the point where I dread going there. I hate it so much its such a huge waste of my time. Honestly I probably won’t unless I need emergency medical attention. I feel if time was taken to actually want to provide care I could understand my relationship with food and physical activity better and make adjustments. My diet isn’t even the problem I love veggies and drinking water I just hate exercising. It makes me sweat even more and feel worse after. I throw up every time my body moves too much. \n\nThe medical community is fatphobic as fuck. And I hate how it’s all guised under “caring about your health”. That is bs. Caring about my health would be addressing my mental health & promoting healthy lifestyle changes. Not sitting in my face insulting me, ignoring my needs, and providing no solutions. I shouldn’t have to change my appearance or lose a bunch of weight to receive proper care, but they way they treat and dismiss plus size patients that’s unfortunately the way it is. To them all of us are just obese and can’t stop eating when there are many reasons someone is overweight. None of us are the same. I will never be skinny (I don’t want to). My metabolism isn’t going to speed up over night. I have accepted this and love myself despite this yet society continuously reminds me of this. No one bothers to investigate obesity the same way they would for mental health. It shouldn’t be this dreadful & difficult for me to get the care I need..\n\nJust venting hope I’m not alone. I’m not asking for health advice thats all.","score":232,"num_comments":131,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1cim4bt","author_hash":"62093624d628c81ff400a77d6fbdcf7dca283582d9db5e3be265dec4d30282e8","created_utc":"2024-05-02T17:55:07+00:00","title":"Does it irk anyone else that black people are always the go to example when it comes to discrimination analogies?","text":"For example, somebody will be talking about the gender divide or any kind of discrimination really, and then they'll jump to \"Well if a black person did XYZ\" and then they make their point. What did that have to do with us?? It feels like all of a sudden \"black person\" is the worst case scenario, and then that opens us up to discrimination because we're getting \"victimized\" when we were never involved in the original topic of discussion. Am I crazy here?","score":436,"num_comments":59,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1f52hjq","author_hash":"d96c736438dd8746dd103856e64fc7374ee0b7a07ec0d2fdd2193ced224f0a62","created_utc":"2024-08-30T18:30:59+00:00","title":"hang out ruined bc of racism","text":"so today i went out with my friends after school to hang out at this cool arcade place it was fun but when we left on the way my friend got cat called she ignored them so they picked on me instead.\n\ni was wearing pink and this guy said infront of his big friend group \"she's wearing pink but if you rip of her clothes her ***** is all dark and burnt\" i felt so embarrassed and humiliated cause his friend group is big my friend comforted me but what he said still keeps replying over and over i can't believe such awful people exist..","score":315,"num_comments":58,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"15j3mmc","author_hash":"c3897e1113069d3a20d2836b986548f9a7de6fe0b3afb32deb8e08046cc9e2aa","created_utc":"2023-08-05T18:58:36+00:00","title":"Male OBGYN questioning why women only want to work with a female OBGYN","text":"For the women that saw the TikTok video created by Dr. Johnson complaining about women only wanting to work with a female clinician, what are your thoughts?\n\nAll of my clinicians are female. The only reason my dentist is male is because female dentists are scarce. I’m currently trying to find a female orthopedist.","score":291,"num_comments":122,"likely_black_context":true}
{"platform":"reddit","community":"r/blackladies","post_id":"1djhon2","author_hash":"dbd86f5195ddbfef28695f2530727116c6188a160269e055297bb8ce7e9d6f6d","created_utc":"2024-06-19T12:14:44+00:00","title":"a lot of African Countries offering Blk ppl around the world (American, Caribbeans, Brazilian, etc etc) dual citizenship, if u ever want to escape racism or possible Ww3, would you accept the offer","text":"There is a lot of African Countries offering Blk ppl around the world (American, Caribbeans, Brazilian, etc etc) dual citizenship, if u ever want to escape racism or possible Ww3, would you accept the offer? You don't have to move there permantly, but just get dual citizenship/double passports.\n\nWould you ever do this? Or have you already done This?\nI know some ppl went to Sierra Leone  ","score":134,"num_comments":104,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1127beo","author_hash":"995d25aefe4475a0e5c28be7a96726c106f357ee95dace6dd2da5ff499181bc0","created_utc":"2023-02-14T14:55:50+00:00","title":"Do you feel that white woman and black woman receive the same type of comments regarding pregnancy?","text":"I purposely was not open about my pregnancy at my job because I knew a slew of unsolicited comments would accompany the announcement. I told the few co workers I am close with early on personally. I am now 34 weeks and very visibly pregnant. The issue I am having is the number of inappropriate comments I am receiving. I tend to role my eyes at the \"you're not allowed to have caffeine\" while drinking an 8 oz diet coke or the \"wow you can really see it in your face\" regarding my weight gain. I even had someone pinch my thighs when talking about my weight gain. \n\nBut some of the comments I have received are completely uncalled for. \n\nI have numerous people ask me if my pregnancy was unplanned, who the dad was (I am married), and I even had a co worker assume that my pregnancy was from a one night stand. I work in a very large department with over 100 co workers. I would never personally ask someone those questions because either A. We are close enough and I already know the answer or B. We are not close, so it is none of my business. I am black and not young (but appear younger for my age). I just wonder do other pregnant woman receive these type of comments? I can't help but think that if I was white, people would not be asking me these questions..","score":333,"num_comments":271,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"kvwbkc","author_hash":"b2dd2d2cd82557fb36069153d2ba265a2a6dbeff0586d2cfde29597aa0d9c1ca","created_utc":"2021-01-12T17:36:00+00:00","title":"WaPo article: Mortality rate for Black babies is cut dramatically when delivered by Black doctors, researchers say","text":"[Source](https://www.washingtonpost.com/health/black-baby-death-rate-cut-by-black-doctors/2021/01/08/e9f0f850-238a-11eb-952e-0c475972cfc0_story.html?=)\n\nRachel Hardeman has dedicated her career to fighting racism and the harm it has inflicted on the health of Black Americans. As a reproductive health equity researcher, she has been especially disturbed by the disproportionately high mortality rates for Black babies.\n\n\nIn an effort to find some of the reasons behind the high death rates, Hardeman, an associate professor at the University of Minnesota School of Public Health, and three other researchers combed through the records of 1.8 million Florida hospital births between 1992 and 2015 looking for clues.\n\n\nThey found a tantalizing statistic. Although Black newborns are three times as likely to die as White newborns, when Black babies are delivered by Black doctors, their mortality rate is cut in half.\n\n\"Strikingly, these effects appear to manifest more strongly in more complicated cases,\" the researchers wrote, \"and when hospitals deliver more Black newborns.\" They found no similar relationship between White doctors and White births. Nor did they find a difference in maternal death rates when the doctor's race was the same as the patient's.\n\n\n“It is the first empirical evidence to describe the impact of the physician’s race on an outcome such as infant mortality,” Hardeman says.\n\n\nWith 5.7 deaths per 1,000 live births, the United States has a high infant mortality rate, and Black babies are in the gravest danger, with an infant mortality rate in 2018 of 10.8 deaths per 1,000 live births, compared to a rate of 4.6 White babies per 1,000 live births.\n\nInfant mortality is defined as death during the first year of life, and 66 percent of those deaths, for all races, occur in the neonatal period in the first 28 days of life, with 14 percent within the first hour and another 26 percent within one to 23 hours.\n\nUnder the care of Black doctors, Black babies’ mortality rate was more than halved from 430 per 100,000 live births to 173 per 100,000, Hardeman says.\n\n\nAlthough infant mortality in the United States has been decreasing, the gap between Black and White infants has persisted, Hardeman says. The root, she says, lies in structural racism.\n\n\nShe defines structural racism as the “normalization and legitimization of an array of dynamics — historical, cultural, institutional and interpersonal — that routinely advantage Whites while producing cumulative and chronic adverse outcomes for people of color.”\n\nHardeman and the other researchers — Brad N. Greenwood, associate professor of information systems and operations management at George Mason University; Laura Huang, an associate professor at Harvard Business School; and Aaron Sojourner, an associate professor at the University of Minnesota’s Carlson School of Management — wrote that more research was needed to understand why Black physicians outperform their White counterparts.\nThey cautioned that it wasn’t practical for all Black families to seek Black doctors to deliver their babies, not only because there are too few of them but also because the reasons for the disparity in care need to be understood and addressed.\n\n\n“Key open questions include the following: 1) whether physician race proxies for differences in physician practice behavior, 2) if so, which practices, and 3) what actions can be taken by policymakers, administrators, and physicians to ensure that all newborns receive optimal care,” they wrote. \n\n“Reducing racial disparities in newborn mortality will also require raising awareness among physicians, nurses, and hospital administrators about the prevalence of racial and ethnic disparities, their effects, furthering diversity initiatives, and revisiting organizational routines in low-performing hospitals.”\n\nCommon causes of infant mortality are premature birth, low birth weight, maternal complications and sudden infant death syndrome, according to the Centers for Disease Control and Prevention. Some of these deaths are caused by complications related to the mother’s health. Historically, Black maternal health has always been concerning, with Black women four to five times more likely to die during pregnancy and childbirth than White women, regardless of income, education or lifestyle. A Black woman does not have to be poor for her life or her baby’s life to be at stake.\n\n\nThe most recent figures, for 2016, show 40.8 pregnancy related deaths per 100,000 live births for Black women and 12.7 per 100,000 for White women. Most pregnancy related deaths, the CDC says, are preventable.\n\n\nHealth disparities have been well documented in the medical literature. In 2002, the Institute of Medicine published Unequal Treatment: Confronting Racial and Ethnic Disparities in Health Care, a book-length study that concluded that: “A large body of published research reveals that racial and ethnic minorities experience a lower quality of health services, and are less likely to receive even routine medical procedures than are White Americans.”\n\nCiting numerous examples, the authors wrote: “Significantly, these differences are associated with greater mortality among African-American patients.”\nMore recent studies show bias is still being documented, and that people of color have disproportionate rates of preventable death and illness than Whites.\n\nHardeman says that by adulthood so many disadvantages have accumulated to affect a Black woman’s health that the race of the doctor may not make a difference.\n\n\nShe says that, by adulthood, structural racism has already been at play, and that racial concordance is not enough to counteract the “cumulative” disadvantages that often benefit White women and lead to adverse outcomes for Black women.\n\n“It also means the cumulative experience of racism and sexism, throughout the lifecourse, can trigger a chain of biological processes, known as weathering, that undermine Black women’s physical and mental health.”\n\n\nHardeman recognizes that most babies and mothers statistically will be cared for by White physicians, but she says that they are equally responsible for “divesting from health care inequities.”\n\n\nIn a report from July, she writes, “We believe that medical schools and training programs should equip every clinician, in every role, to address racism. And licensing, accreditation, and qualifying procedures should test this knowledge as an essential professional competency.”\n\nThis could look like mandating education about implicit bias and social justice, which can better prepare doctors of any race to properly treat at-risk patients, regardless of their socioeconomic backgrounds or race. Medical schools have come under increasing pressure to include such education and counteract training that in the past wrongly taught doctors that there were genetic differences among different races.\n\n\nAnd the health of babies, even before conception, can be improved by addressing the needs of Black mothers and creating programs that improve prenatal care and provide timely interventions to alter the course of the health of Black babies and their mothers, according to the National Birth Equity Collaborative.\n\n\nAnd it remains important, Black doctors say, to increase their numbers.\n\n“Government doesn’t have your back, neither does health care,” says Khayriyyah Chandler, a Black doctor practicing in New Jersey.\nAccording to the Association of American Medical Colleges, only 5 percent of doctors identify as Black, and 4.9 percent of pediatricians do so. That is compared to the 579,174 Black babies born in 2018, 15 percent of all births. While medical schools are seeing a steady increase of Black students, as of 2020 they only make up 7 percent of students.\nEnrollment is affected by the wealth gap of Black households, Chandler says, as well as the cost of maintaining a private practice.\n\n\n“It is harder to keep a private practice, particularly based on higher percentages of Medicaid and Medicare, especially when you have more debts than your predecessors,” she says. “When there’s more debt, there tends to be less risk, and I suspect it is harder to find abundant practices, and a variety of practices, in Black neighborhoods. That is why authentic efforts must be made with Black people, and they must lead efforts in their own communities.”\n\n\nMany factors play into a student’s career choice, and for a child of color, especially in low-income areas, not seeing Black professionals may make certain career choices seem unattainable. Organizations such as the Big Homie Project are hoping to bridge the gap. Founder Jacqueline Diep knows what the lack of positive influences can feel like. A child of the foster care system, she credits a teacher for changing her life’s trajectory, as she went from having a modest GPA to eventually getting an MBA and landing jobs at companies like Google.\n\n\n“People helped me, success didn’t just magically happen,” she says. “And what I realized was that a lot of these kids in the community aren’t hopeless, but it’s just much harder. And I realized that I’m an example of what is possible if you just surround yourself around the right people.”\n\n\nThe Big Homie Project pairs professionals, including doctors, with children of color. One of the mentors, Fernandino Vilson, a resident urologist at Stanford, knows what it is like to be told you can’t succeed by those in a position to help you.\n\n\n“My love for anatomy, physiology and science sparked my interest in medicine, along with being told that I wouldn’t be a doctor and to choose another route,” he says. High school guidance counselors and career advisers discouraged him, he says, but instead of changing course, he was determined to prove them wrong. His mentoring includes his two young brothers, who are now pursuing medicine.\nVilson says that, throughout his journey, mentorship has always been on his mind and he began acting on it in medical school: “We’ve put on premed conferences inviting underrepresented minorities in North Carolina. We’d give mock interviews, put them in front of recruiters for med schools. The Big Homie Project is a way for me to continue.”\n\n\nWhile creating channels for more Black doctors is a major step for survival of Black infants, Hardeman says, change is needed throughout the health-care system.\n\n\nOrganizations such as the National Birth Equity Collaborative are advocating for more research into the health concerns of Black families as well as for governmental agencies to provide more resources to address health disparities.\n\n\nHardeman and the other three researchers put it this way:\n“We hope this study provides a basis for additional work that advances our understanding of inequality, its origins and how practitioners can work toward creating better and more-equitable birth outcomes.”","score":639,"num_comments":57,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"16qava3","author_hash":"f3bce55e86a421ca33fe81e26370310a990929ce438bd68a905102fef53d9f2e","created_utc":"2023-09-23T17:57:25+00:00","title":"Inspired by Jack Black’s Mom — how are you spending your last days of pregnancy?","text":"Jack Black’s Mom, Judith Love Cohen, was a bada$$ who worked for NASA (among other endeavors!) and created the Abort-Guidance system, which helped save the Apollo-13 astronauts…on the day she gave birth to Jack! \n\nI’ve had a rough pregnancy. Six days to go til my c section (complete previa, breech baby measuring big, previous pelvic trauma) and alternate between okay and not okay days, but then I think of Judith and try to power through as best as I can. I don’t work for NASA, but I’ve decided to work up until my surgery on some special projects in between nesting and *trying* to rest. \n\nWhat are you doing during your final days of pregnancy? Who or what is inspiring you on the really rough days?","score":57,"num_comments":35,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"14k74ao","author_hash":"837c2126a4f91abf629358c6f03aa2abf9b9cd32148ff185091c36a249d87d9b","created_utc":"2023-06-27T07:52:06+00:00","title":"Mother's South African traditional approach to postpartum care in conflict with my modern approach","text":" FTM (26)Graduated to my new mommy title 22/06/23 at 40w induction which went super smooth. Had a quick labor that lasted about 5 hours, 2 quick pushes and baby was here weighing at 3,72 Kg with no stitches needed.   \n\n\nI’m based in South Africa and of mixed race descent - dad is European and mom is African specifically of the Batswana tribe.  \nAccording to her customs postnatal care is done in a specific way and lately we’re butting heads on all her approaches vs my modern approach which I’ve been researching my entire 9 months.  \nA few of the things are :  \n\\- The umbilical cord is seen as very sacred so mom & baby are to be kept away from people until it has fallen off and discarded of traditionally. This means total isolation and no leaving the room, only your carer is to enter your room. Not even the dad can enter or see the baby until the cord stump has fallen off.   \n\\- you can’t eat anything for that duration but porridge made from Sorghum/ Maize and drink coffee, water and milk. LOTS OF IT as it helps with milk production. My issue is that these are mostly things I avoided as they caused constipation and I am trying to go number 2 as early as possible and this is just going to make this harder. Also, I did my own research and would like to eat certain foods that’ll ease with the constipation, milk production and weight loss. She’s not having any of that.  \n\\- Being cooped up in a room in a sedentary state isn’t going to help with the constipation as well. I’m in no pain besides occasional period-pain like pains so I’d like to do a few stretches etc. However she insists on bed rest.   \n\\- She wraps baby up with so many blankets I feel like she’s suffocating him lol. I would like to do skin to skin sessions but nope, the baby is not to get any air.   \n\\- There’s certain traditional medicine that must be used to wipe the cord. While I see how she’s done this multiple times before and no harm came from it, mom, the Dr said only surgical spirits!!  \n\\- everything I do she sees as wrong, whilst I noticed my milk coming in with her diet, she still says I am not producing enough and that’s because I’m not drinking enough porridge. She’s like a hawk telling me to wake up and feed every 5 minutes and my boobs hurt so bad I just want to cry.  \n\n\nGosh I could go on for days lol. All these just frustrate me and I pray I don’t fall into a depressive state as I feel so out of control of the bonding stages, and not really getting the experience I would like in those first few weeks. I appreciate her presence and help but her “old school/ traditional way” of doing things is just super in conflict with how I would have loved to approach things, but I guess it’s been passed down from one generation to the next and I should just accept it and be grateful for the ancient knowledge.   \n\n\nJust a lil rant, did anyone experience anything similar to this ? How did you deal with the conflicting approaches ?  \n\n\nHow do I ensure I go to the bathroom as It’s been 3 days so far and the pregnancy constipation already traumatized me so I don’t want to go through that again ?","score":34,"num_comments":37,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1agm6ro","author_hash":"31b0c019ac2733f5f29ac2e882c73f07e38587c3b9bd477de05bdfee8b454c05","created_utc":"2024-02-01T21:29:21+00:00","title":"Should I go down the pregnancy advice book black hole?","text":"Trying to get pregnant. Do I NEED to read pregnancy / parenting advice books?\n\nI don’t want to go down a black hole of excessive content and information. I want things to unfold naturally and without stress.\n\nI have ADHD, depression, anxiety, and can be a control freak. I want to try to approach this differently. I’m worried if I read too many pregnancy books I will get stressed and overwhelmed instead of living in the moment and having a chill pregnancy. I don’t want to read judgmental or contrasting theories, worried about things that probably won’t happen. Everybody has their own opinion.\n\nOBVIOUSLY I should talk to my OB and psychiatrist, eat healthy, not drink alcohol, take some vitamins. This should go without saying. Isn’t that enough? \n\nI accept that unexpected and unpleasant things will happen, and maybe they won’t. Can’t I just take it a day at a time??? I consider myself a resilient person… Can’t I just be confident in my natural maternal abilities??\n\nA calm mom means a calm baby, right?","score":1,"num_comments":26,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"vz6t9g","author_hash":"c8010242e1f7ca26e2c2194f596d13f27397986bb7a17a091ddef07740471d06","created_utc":"2022-07-14T21:23:33+00:00","title":"I regret having my son.","text":"Throw away account because I'm super ashamed. I know this is a taboo subject. My son is 10 days old. And I regret having him. Let me start this off by saying he was planned and very much wanted. I'd be disappointed whenever I'd get a negative pregnancy test. I just wanted my baby. Well, I finally got pregnant and was overjoyed. For the first few weeks at least. My pregnancy was hell. I lost a ton of weight from vomiting, me and my sons father grew apart, I was in and out of the hospital, and I was bed bound. \n\nHalf way through my pregnancy my sons father got evicted from his house and had to move in with his grandmother in another city. He promised he'd get his shit together and get a place before baby was born. Spoiler, he didn't. So I'm doing this solo. Just me and a baby who refuses to sleep unless held in a tiny warm little apartment. \n\nI dont have 2 seconds to myself. I've barely eaten or slept since he's been born. And I have constant anxiety he's stopped breathing or something is wrong with him. \n\nAlthough I DESPISED being pregnant, I'm also mourning my bump which is all kinds of confusing to me. I was in so much pain. I begged to be induced. But I feel...empty now. Like my body has no purpose. \n\nI sob every day. I feel nothing but despair. Like I've been swallowed by a black hole. I wanna run away but at the same time I couldn't imagine leaving my baby. I love him so much it's painful, but at the same time I wish I never had him. \n\nI feel so much guilt for feeling this way. My heart hurts in a way I've never experienced before. I hope everyone doesn't think I'm a horrible person. I had to get this off my chest and there's no way I could admit this out loud to anyone around me. \n\nI just want my old life back.","score":1393,"num_comments":359,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1mto45l","author_hash":"4bec103825db847fd7e2e418511436c0733bfb671aa1758b0fd93ed2399dbf26","created_utc":"2025-08-18T14:47:32+00:00","title":"The Reddit Post I Wish I Had When I Thought We Lost Our Baby (TW)","text":"Trigger warning: Discussion of (suspected) miscarriage\n\nLast summer, my husband and I decided to try to have a baby. Fortunately, it happened very quickly, and by late September, we found out I was 4 weeks pregnant. \n\nJust two weeks later, on October 11th at midnight, I was making overnight oats in preparation for a roadtrip we were taking in the morning. I needed to pee badly, but I was just trying to finish what I was doing. Then, I felt a sudden gush and thought I had peed my pants. I touched my pants and when I looked at my hand, it was covered in blood. I absolutely panicked and called my husband upstairs. Naturally, I thought I was having a miscarriage.\n\nI went to the bathroom, and there was so much blood. I was extremely upset, and after getting cleaned up, I went to bed and immediately started googling to figure out if whatever was happening was truly a miscarriage. I ended up scouring Reddit posts to find similar situations to mine, praying whatever post I found was updated and that the OP didn’t have a miscarriage. It was a mixed bag of loss stories and not-loss stories, but most were not updated with the outcome, and I came away not feeling very hopeful. I did see something about subchorionic hematomas, and sometime in the middle of the night when my husband rolled over, I mentioned it to him as a possibility because I felt fine — no cramping or any symptoms besides the bleeding. But I was doubtful, especially since my bleeding was so heavy.\n\nThe next morning, we decided to go on our roadtrip anyways (I cried for much of it) because there was no point staying home and being sad and unsure. I couldn’t go to the doctors until Tuesday because it was a holiday weekend, so the trip was a nice distraction. However, on Saturday afternoon, I started having intense cramping, which in my mind confirmed this was not a subchorionic hematoma and was indeed a miscarriage, as that was how people had distinguished the two online. I spent the rest of our trip just trying to make the best of it.\n\nFinally, on Tuesday, I was able to go to the doctor’s for an ultrasound to confirm the miscarriage. I didn’t have my husband come because he’d have to miss work, and I thought it would just be a sad confirmation of what we already knew. However, as soon as the ultrasound tech put the wand on my belly, she joyfully said, “You didn’t have a miscarriage! Your baby is right there!” I was incredulous, and I burst into tears. It was the first time I had seen the baby (at the time, more of a blob) on ultrasound. I immediately messaged my husband (he doesn’t have his phone at work so I couldn’t call him), and we were both confused, but ecstatic. The doctor had no explanation of why I had so much bleeding, but put me on pelvic rest (not bed rest) for the rest of my first trimester as a precaution. The bleeding tapered off over the next week or so.\n\nTwo weeks later, we were in Disney World for a wedding (yes, we did lots of traveling for some reason at this time). I was riding only rides that were safe for pregnant women and generally being cautious, although we did walk 20,000 steps (as you tend to do in Disney). Around 4pm, my husband and my brother went on a rollercoaster that I couldn’t go on, so I went and sat at a table and took a break. I sat there for a while waiting for them, and then they came back and we were just resting at the table until our reservation. While we were sitting there, I felt a sudden gush and sure enough, I had bled through my pants again. I rushed off to the bathroom, leaving my phone behind accidentally.\n\nOnce in the bathroom, I realized I was in a logistical nightmare. I was covered in blood, including my hands (it had even dripped on the floor), and I didn’t have a change of clothes. I brought a pad but was wearing a (now blood-soaked) thong, which I promptly threw out in the stall. I cleaned myself and the stall up the best I could, put my bloody pants back on (fortunately, black leggings so you couldn’t really see), and then realized I had to walk out into the crowded bathroom and use the trough style sink with my hands covered in blood. I was able to do it without being noticed (I think), and then I went to find my husband and brother. From their perspective, I’m sure they had no idea what to do and they couldn’t get in touch with me because they had my phone and I was in the women’s bathroom. Anyways, I found them and told them I was okay, which I was — I felt perfectly fine except for the bleeding. I told them I was going to go change at the hotel, and I’d come back. They offered to come with, but because I felt fine and didn’t want them to miss out on the park, I said no. I called my mom (a nurse practitioner) as I left the park, and our discussion made me realize I didn’t want to go the whole weekend again not knowing if I had had a miscarriage. I had the same heavy bleeding as before, but there were also clots in it, which made me even more nervous. And I never got an explanation for why it happened to first time. So I decided to go to the emergency room, and my husband left the park and came with.\n\nWe spent hours at the (very nice) hospital in Celebration, Florida, just waiting for news after blood tests and an ultrasound. Finally, around 11pm, the doctor told us that we did not have a miscarriage, but that I had two small subchorionic hematomas. A subchorionic hematoma is basically a collection of blood between the uterine wall and the membrane where the embryo is developing. Bigger hematomas can cause much more serious issues, but smaller ones are generally not even noticed, although they can cause bleeding. \n\nThe bleeding I had lasted a few weeks, and it eventually tapered off. I remained on pelvic rest until the end of my first trimester, and I never had another instance of bleeding. On May 16th, I had our beautiful baby girl, and I’m holding her (now three months old and thriving) as I type this. \n\nI promised myself last October that I’d write this post so that someone who is in the same boat I was in might have some hope. I understand many will not be as fortunate as we were, and I don’t wish to give anyone false hope. I just want people to know that it’s possible to have heavy bleeding and cramping and still have a really positive outcome. If you’re in this situation, I wish you the best of luck and hope you hang in there until you can get some information from your doctor.\n\nTL/DR: I thought I had a miscarriage (twice) during my first trimester due to heavy bleeding and cramping, but it turned out to be subchorionic hematomas, and I now have a beautiful and healthy baby girl. \n\nEdited to add: I also found out my mom had a similar thing happen with her first pregnancy! She never got the answer of what it was, but when she told me, it made me wonder if there isn’t some genetic component as well.\n\nSecond edit: This post is not intended to be medical advice or to minimize subchorionic hematoma, as an SCH can pose significant risks. Even in my case, I was put on pelvic rest to prevent further complications, and I was limited until the hematomas cleared, as advised by my OB. My only intent was to raise awareness of other causes of bleeding in pregnancy besides miscarriage to potentially give a panicked mom (like me) something to hold onto until she is able to get medical care. If you have bleeding during pregnancy and suspect miscarriage or SCH (or any other complication), please consult a medical professional as soon as possible. ","score":379,"num_comments":98,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"18lpwad","author_hash":"3cdc80b7bc500ea2fd0326560dffe4a540ef3d6f7aa54d34be4a07f265419a52","created_utc":"2023-12-19T01:44:29+00:00","title":"Doctor made me feel crazy for going to l&d for reduced movement","text":"So my baby’s movement changed a lot over the last two days. Yesterday I kind of pushed it off because I felt him… just not as much as normal. Today was the same . I always feel him in the morning lots today hardly nothing.\nSo I went to the hospital 🏥. The doc told me I can’t just go to the hospital every time I feel reduced movement?! (Been once before at 25 weeks, I’m almost 30). Made me feel completely crazy for going and shamed me. I had a friends sister lose her baby full term for ignoring reduced movement, so why would I risk that? \n\nI told her look , if I need to come in 35 times to make sure my son is okay, I will!\nI hate feeling like I need to advocate for myself, especially being a black woman.  How incredibly inappropriate to say to a pregnant woman. Even the nurses were stunned.\n\n** update \nI am also a first time mom who struggles with anxiety. This is such a wanted pregnancy . I struggled to conceive, been with my husband 10 years and this is my first time being pregnant. \nI do see a therapist for my anxiety as it is enhanced during pregnancy. \nDoctor did a great job at making me feel stupid for going in because of course, my baby was kicking at the monitor lol. But I know his movements, and even with an anterior, I feel him strong. That is why I went in. I thought we were supposed to for reduced and changed movement.\n\nI will be filing a formal complaint tomorrow because even though I’m shameless and will continue to go in whenever I feel necessary, the next person might not after her comments. She’s not my doctor, but she’s a doctor with my clinic as one is always on site at my delivering hospital. \nThe comments are so appreciated!!!! Makes me feel not so crazy .\n\n**UPDATE NO.2\nI have filed the complaint against the doctor for being so obviously annoyed and dismissive in such a sensitive time.\nThey were absolutely disgusted and are escalating the situation. \nThe lady thanked me for calling because the next  person might not have the voice to do so and feel embarrassed to come in and get checked next time. I’m hoping something comes of this. ","score":761,"num_comments":162,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1f0zfbg","author_hash":"490f201400add04f3244af1b5c3fa4e10024e9e875bcacbdb8d52f6e285ddeff","created_utc":"2024-08-25T15:48:18+00:00","title":"What are you doing to simplify your life before the baby comes?","text":"My husband and I have been on a quest to simplify our lives before our son is born. I’m curious if other families have done this and might have some inspo for us to consider! I’ll share what we’ve done to get the convo started.\n\n- Sold our camper\n- Sold our hot tub\n- Decluttered pretty much the entire house, from our clothes closets to the shed to the kitchen cabinets\n- Unsubscribed from every single thing we aren’t actively using\n- Combined as many accounts as possible so everything is all at one bank\n- Got rid of most of our socks and replaced them with like 50 pairs of plain black socks so we dont have to think about matching, pairing, etc\n- Started a new “family” email account that we will not use for anything besides doctors, banking, insurance, etc so it doesn’t get lost in our regular emails","score":410,"num_comments":170,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"tthsdq","author_hash":"85a8c23f62d95a0eb874c300457de8e3554c9cc109b5db8d9493f8a1270ba064","created_utc":"2022-04-01T04:02:08+00:00","title":"Things I wish someone had told me when I was pregnant","text":"1. You’ll be bored with a newborn- probably a lot.\n2. You’ll feel guilty for feeling bored.\n3. You’ll be reaaaalllly tired, and may “hallucinate” things like hearing the baby cry while you’re in the shower, thinking a pillow is the baby, etc. (Note that this is different than postpartum psychosis, which is very real and needs immediate medical attention.) \n4. You may have the “mommy jitters” after birth and be shaky and have a hard time sleeping. It’s not pleasant but it passes. \n5. Assuming you have a healthy newborn in a safe sleeping environment, you do NOT need to watch them 24/7. It’s ok to rest. \n6. Take home allllll the goodies in your postpartum room- especially the pads and knit underwear. It’s free and they’re just going to trash it anyway.\n7. Breastfeeding is NOT reliable birth control, as you will ovulate before your period returns. There ARE birth control options you can take immediately postpartum that don’t interfere with breastfeeding. \n8. Your period may return a lot faster than you expect, even if you are nursing. \n9. You may not be able to produce enough breast milk, or your baby may not be able to nurse for some other reason. It doesn’t mean you failed in any way, and it’s not at all uncommon. Don’t let anyone make you feel guilty about this. \n10. You may not feel very bonded to your baby right away, or even for a while. This is normal and does not mean you’re a “bad mom.” Every woman is different in how and when they bond with their baby, but trust your process and know that the love you’ve dreamed of WILL come.\n11. Your body is always going to look a little (or a lot) different than before. It’s ok to have a hard time coping with that fact, it doesn’t make you vain or conceited. \n12. A C section is not a failure. You still gave birth in a beautiful and miraculous way. \n13. When you’re in the middle of intense labor pain, an epidural won’t seem so scary at all. (And getting an epidural is also not a failure. If our ancestors had had access to epidurals, I’m damn sure they would have said “hell yeah gimme the drugs.”)\n14. You and your partner WILL fight. You WILL have disagreements on parenting and baby care. It doesn’t mean your partnership is doomed to failure- it just means you are 2 exhausted people with unique pasts and upbringings that are shaping your thought processes. Communication (and forgiveness) are key. \n15. Babies fart like old men with a bean addiction. \n16. You don’t have to change your baby’s diaper every time they pee. Poopy diapers, however, should be changed ASAP to prevent diaper rash. \n17. “Dressing baby up” in fancy or impractical clothes actually isn’t much fun. Tiny babies are a challenge to dress, and going to that trouble just to have them poop or spit up on their outfit isn’t ideal. \n18. Take everything you read on the internet about birth and babies with a very large grain of salt. Same with what you see on social media- it’s mostly not real. \n19. Even tiny newborns that seem like immobile potatoes can still sometimes roll. Never leave a baby unattended on a changing table or other elevated surface. \n20. Your baby’s first poop will most likely be black and sticky. That’s normal. \n21. Your baby’s hair may fall out.\n22. Do. Tummy. Time. Seriously do it. \n23. There is no such thing as a perfectly normal baby. \n24. You will probably drop your phone on your baby’s head at least once if you breastfeed. Welcome to Parenting a la Milennials. \n25. You may not feel like a mom right away. It’s a huge identity shift and it takes time. After all what does it mean to “feel like a mom” anyway?! \n26. Not all moms get PPD or PPA, but many do. There are lots of resources available that really do help. \n27. Your baby DGAF what the nursery looks like. Sorry but it’s true. \n28. A lot of motherhood is learning to set boundaries with family, friends, strangers etc. It’s uncomfortable but it gets easier. \n29. A newborn baby getting an infection or virus can be a pretty big deal. While modern medicine is awesome, just be mindful of this as you think about who and what to expose your newborn to during those first few weeks. \n30. Your back and neck will probably hurt a lot. I know it’s tempting to hunch over baby while you’re feeding her, but try to think about your posture as much as you can to prevent this pain. \n31. Babies are unpredictable. Just as you get one routine down, they’ll throw a wrench into it. It’s not a sign you’re doing something wrong, it’s just the First Law of Babyhood.","score":1110,"num_comments":177,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1hm7l1u","author_hash":"0c0d19131fe118aa09df22fd23ecf4c25c9b91b6bffbbb901e057f4d395ff25e","created_utc":"2024-12-25T19:49:07+00:00","title":"Why is my family making me and my husband feel like bad guys for actually planning before we try for a child ","text":"\nSo, it’s Christmas, and my husband and I hosted breakfast for his family. Of course, the child conversation came up (don’t they all at family gatherings?). This time, it was sparked by a little “baby plans” list I have pinned to our fridge. The list goes something like this:\n\t1.\tHave $5,000 in savings\n\t2.\tDo genetic testing since my husband is a carrier for certain conditions.\n\t3.\tLower my blood sugar and eat healthier because I’m a Black woman with diabetes, which already puts me at high risk.\n\t4.\tFind the right OB who aligns with my health goals.\n\t5.\tCall our insurance to figure out exactly what’s covered.\n\t6.\tAim for 2027 before I turn 31, so we have time for a few vacations and to enjoy life as a couple.\n\nSeems reasonable, right? Apparently not. The consensus from family was that we’re “waiting for perfection” and “there will never be a perfect time.”\n\nI get that there’s no such thing as the perfect time, but is it really asking for perfection to want a little nest egg? To ensure our child won’t have preventable illnesses through genetic testing? To want to improve my health for what’s already considered a high-risk pregnancy?\n\nAnd let’s not even talk about daycare. I work from home, but with layoffs happening everywhere, I can’t rely on that being a forever option. Plus, our parents (who said they’d “help with childcare”) are getting older. I don’t want to put that burden on them, especially since anything could happen—illness, caregiving for each other, or just life. Having daycare savings is my way of preparing for the unexpected, yet somehow, this is “doing too much.”\n\nIt feels insane to me that NOT having a plan for bringing a whole human into the world is seen as the normal thing to do. Am I overthinking this? Are we actually being unreasonable, or does wanting to plan make sense in 2024? I’m seriously starting to feel like I’m losing it here.\n\nThoughts?","score":339,"num_comments":106,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"dgdwgt","author_hash":"56d5da007ba6ea147a4686235f2775b1bb46e640057b120d5fb13e7de24d6ec5","created_utc":"2019-10-11T11:39:00+00:00","title":"Saving Black Mothers: New California Law Requires Bias Training for Doctors, Medical Providers","text":"","score":185,"num_comments":11,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1ltpysv","author_hash":"2c6c583fbbbce67a9de893dc958f7198f45dad55d321c759102eb42eb428b074","created_utc":"2025-07-07T09:44:33+00:00","title":"This is a bit of an embarrassing post…","text":"So I'm currently pregnant with my first baby and one thing I'm concerned about is labor and delivery. I'm a bit of a chubbier woman so my issue is that the doctors and nurses are going to see the black marks that have built up along my inner thighs (I suppose because their is no air passing through, they trap moisture and results in the color). It's made me really self conscious because I've seen L&D videos and your legs are spread wide open for all the nurses and doctor to see. Is there anything I can way that I can make the skin there lighter? I've tried applying baking soda on the black area and it's helped. Am I just overreacting? Will the doctors and nurses even care? Is my lower body going to be covered with a tissue or exposed? Like I said, I'm pretty self conscious about this whole issue. ","score":75,"num_comments":99,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1i5eb6n","author_hash":"94846ca1b7b8326b610bcbf8eb9e1230942aa4b99911b2cfa74676a6cfa57c49","created_utc":"2025-01-20T01:03:50+00:00","title":"Those unmedicated, pain free birth videos on social media made me so disappointed with my birth experience ","text":"Before I was even pregnant I knew I wanted to do it unmedicated, ever since I was a teenager. The thought of epidurals freaked me out and a lot of people I know used nitrous and no epidural so I was fairly confident. I had 0 fear of labour and childbirth, none at all, even up until I was in labour. I have a very high pain tolerance and can get through a lot with just relaxing and breathing so I was like \"this will be no problem, I have confidence in myself and my body\". I would watch these videos about how people got through their labours pain free and I did in person classes with my husband.\n\nWell, my waters broke at 39 weeks my contractions were fine but they wouldn't get regular enough after 12 hours so my midwife was concerned. I thought they were fine because I was getting a lot that were 2 mins apart but then it would stagger to like 10 mins. I had to take castor oil and that's when things got rough af. \n\nI took a nap and woke up with such bad contractions, then having to crap my guts out. I was jumping between the shower and the toilet because the contractions were too bad to even wipe my butt so I would have to shower and then poop again. I was fine though and coping well. \n\nI made it to my birth center and the contractions were still so bad but bareable. I would stop and breathe and be fine. Then when I was admitted I had another nap and woke up screaming and having back to back contractions. They were lasting long with only a few seconds break between them. It was the worst pain and I kept blacking out. I got on the nitrous and I lived on that thing through my whole labour. \n\nI couldn't use a single technique or anything I learned at my classes. I was barely even conscious throughout the whole thing. When I got into the labour tub it helped sooooo much but it was still so bad. I was screaming and grunting through the whole timing. Pushing out my 9lb baby was so much easier than going through the contractions. \n\nI had to be coached how to push too because I wasn't making progress and that was getting me down too. I thought my baby would never come out. \n\nAnyway, how I pictured my birthing experience was nothing like what actually happened. I was so extremely disappointed. I wanted my husband to be more involved but I could barely even make eye contact with him. I wanted him to be in the tub with me but there was no point because I was mentally not even in the room with everyone. I was disappointed I used the nitrous even though if took nothing from the pain, just made me even more disconnected. I got even more upset then when everyone who was at my labour told me that the castor oil doesn't make contractions worse and what I experienced was a very normal labour. I'm not convinced, considering my grandfather worked in the maternity ward and he was shocked that I took castor oil and the first thing he said was about the horrible contractions because he was around births like that and my grandmother took it for one of her labours. I feel like I'm being gaslighted into thinking it was normal labour pain but what do I know, it was my first. \n\nI feel lost now after it and still processing everything 2 weeks later. I'm scared to have another baby now \n\n\nEdit: thank you everyone for your kind words. I know nobody comes back and reads the edits but there's just too many comments to get back to. It was really nice to share my experience and to read everyone here's experiences. \n\nAlso I will add, I didn't just take the castor oil, it was advised to me by my midwife and it worked I guess. No meconium or anything. I took the time to think on it before I took it and decided that I wanted to try it to avoid a hospital birth\n","score":96,"num_comments":148,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1giaf40","author_hash":"e933b0e4a25b8cead620b7ffb0b04bef299ac59cb049951a9701983bfb9df7c6","created_utc":"2024-11-03T00:14:17+00:00","title":"Reality check needed- baby shower inequality with golden child sister","text":"I have a sister who is 8 years older than me and always seemed to be more of a peer/friend to my mom than a child. I on the other hand was always the black sheep not afraid to push back against ‘keeping sweet’ and refusing to keep up the family’s conservative religious image. As a result my parents and my sister would gang up and tease me. It seemed to be a bonding activity for them, smirking to each other as they embarrassed or ridiculed me.\nI spent most of my tween and teen years locked in my room reading away from them. \n\nNow at age 30 I’ve spent years in therapy trying to get past the trauma of this dynamic. My sister and I do not communicate other than a quick hello at holidays. My mother and I had a semi-decent relationship up until a few months ago when she announced my sisters first IVF cycle was successful. \nI myself was 4 weeks pregnant at the time but we decided to keep it to ourselves as my parents had had a lackluster reaction to our pregnancy news in the past (I’ve had 3 miscarriages). We waited until I was 15 weeks to tell them. \n\nNow I am due in the spring and my sister is due 8 weeks before me in January. Both are girls and our first babies. All my mother can talk about is my sisters baby shower. She has visited me twice since our announcement and couldn’t shut up about the venue hall she booked, the flowers she is ordering, the decorations, the food etc. I found it a little annoying but figured she’d be equally excited about my shower closer to my due date. \n\n\nShe let it slip today that she asked a cousin (that I don’t particularly care for) to host my baby shower in her apartment living room. The date is set for two and a half weeks before my due date so it wouldn’t be too soon after my sister’s birth. (2.5 hours away from my home and hospital btw). I am stunned and can’t stop crying at the lack of care and blatant favoritism. It’s bringing back all the bad memories of dealing with this BS when I was younger and living with them. My husband is furious on my behalf and is encouraging me to skip my sister’s shower and just throw a coed bbq to celebrate our baby with our friends. \n\nAm I overreacting? I can’t tell if my previous hard feelings and hormones are making me biased but this feels so crappy.","score":458,"num_comments":72,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1cw6nb3","author_hash":"99b797b65414a228aa430fe91cd6560e1c6bd38452848f3c12ec859035c41dcd","created_utc":"2024-05-20T04:01:33+00:00","title":"Demoralized re: maternity clothing, nothing to wear","text":"First-time mom. I went into this thinking I'd be great at sticking to a budget, using FB marketplace... and was also half in denial about truly needing maternity clothing. I'm due in September, which also doubled my sense of denial, because I thought \"oh great it'll be a summer pregnancy\" so I could wear my one non-maternity but large Uniqlo tent/shift dress + maybe rummage around to see if I had any other larger/flowy dresses. I've read a number of posts on reddit, etc, from people who said they never bought any maternity clothing and \"just sized up\" and resolved to be one of them. \n\nSooo... I bought some nicer higher-end wrap dresses two sizes up. Didn't fit right. I learned quickly that maternity wear isn't just about sizing up (at least for me) because I'm mostly gaining weight in the belly and boobs in a specific way. Hopefully the dresses will still be somewhat useful for nursing once I am postpartum. \n\nI did all the things with FB marketplace, got some free and cheap secondhand clothes from local moms, but the truth is a lot of the stuff that is passed around for free is also quite worn and/or lower quality. \n\nI got some nursing tops at H&M - I liked the idea of their before & after line, but I am finding them a bit annoying to wear with all the nursing layers especially as the weather warms up. \n\nI got two pairs of maternity scrubs from Mandala Scrubs for work - not a bad buy, good quality, but this doesn't really solve my problem for non-work, non-home situations. \n\nI am looking at Thredup but I find the ?seemingly daily price changes quite frustrating and haven't been able to actually check out a cart. Poshmark is annoying, too, since you have to pay $8 shipping (in the US) for each item which makes it almost as expensive as buying new in some cases, and a lot of things are marked up because of the Poshmark culture of sending an offer. In both cases, buying used maternity clothing has a learning curve because you need to get familiar with each brand's sizing (some brands do numerical 2 4 6 8, others do XS S M L, and others still do this 0 1 2 3 thing that makes it VERY hard to search for used clothing because who knows how the seller will describe the garment?). Plus, some brands are like \"oh pick your pre-pregnancy size!\" and other brands are all \"measure yourself as you are now to determine your size!\" It's a lot to keep track of. \n\nI haven't even mentioned that it seems like ALL MATERNITY CLOTHING is either black, has stripes, or cheesy florals. It's also kind of overpriced for viscose?\n\nThe pieces I have been able to continue wearing at 25 weeks:\n\n- Uniqlo easy / relaco shorts one size up (I had these for years and they might be stretched out which is why it might work)\n\n- Husband's stretched out boxer shorts\n\n- One shirred / smock waist midi/maxi skirt (afraid I'll stretch this out though, and it's one of my favorite pieces, so I might just avoid wearing it too much)\n\n- Uniqlo linen dress, kind of similar to this one https://www.uniqlo.com/us/en/products/E464772-000/00 - I don't think it's flattering but the pockets are so nice and the material is decent quality. I'm usually an XS and have my dress in a S. \n\n\nOne other point of confusion I have experienced is just the fact that when I was new to pregnancy, I didn't fully understand the purpose of different maternity pieces. There seems to be a preponderance of maternity jumpsuits (when one has to urinate every 30 minutes, _why make your life harder_?) and overalls. There's a bunch of nursing tops floating around, but nobody really explains why these are better (if they are) than a button-down shirt or surplice top. (Apparently part of it is that the multiple layers prevent milk stains once you are nursing?). At the beginning of pregnancy, I did not understand what the full panel on pants would do for me. It looked like an ugly abomination in my mind so I didn't want to buy anything with the panel. Now in the second trimester I feel like it's much more supportive and comfortable to have a full panel rather than an under-the-bump pant. But maybe different people are different. It is hard to know what you'll want, what you'll want to buy. I have even seen maternity thongs - I don't wear thongs at baseline but it was ... interesting to know that there is a market for this. \n\nBetween all the maternity bras (I got the Auden Target bra that everyone raves about - it was interesting in that earlier on in pregnancy, I was like \"huh I don't see what the big deal is\" but now it's the most comfortable option I have, so I bought more), maternity underwear (some people have said they don't need it, but I am finding it really annoying that my bump is stretching out my non-maternity underwear), failed attempts at buying maternity clothing... I am finding it really challenging to dress myself and stick to my budget! I think I also partly have a perception that buying maternity clothing is something \"for me\" whereas I would much rather spend money on my baby. I'm also trying to declutter before the baby arrives, so buying a whole new separate wardrobe in the midst of this feels vaguely wrong as well. Four months or so is a \"short\" period of time to truly need maternity clothing, but I'm finding that pregnancy is already demanding in so many ways that it still feels like a long period of time to slog things out. \n\nI'm even afraid to buy shoes because people say their foot size changes in pregnancy.  \n\nAll this on top of bodily changes that fluctuate weekly ... it's been quite challenging!","score":163,"num_comments":219,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1k3im3s","author_hash":"eb99b4cb5050bc615977060d07c41aef746c1ec9b56d4db40809a0f177764621","created_utc":"2025-04-20T09:12:24+00:00","title":"How did y'all make it through unmedicated childbirth?","text":"I want this for me, I had an epidural with my first and it slowed my labor immensely which led to them giving me more medication and medical intervention that eventually led to baby distress and an emergency C-section. Which the the epidural didn't work all the way - I felt everything and just ended up blacking out completely. So I don't wanna repeat that situation all over again.\n\nI just wanna know how y'all did unmedicated childbirth without losing it or the motivation to keep going. My support person is my husband, and possibly my mil if he freaks out/stresses me out. I keep reading all these articles and things about pain management and labor positions and how to relax, etc. but my brain isn't processing the information. I have look at this for weeks, hours and hours of reading and prepping and I can't remember a single thing! \n\nI have chronic pain and I can tell you when it gets bad... I completely shut down and my brain shuts off. There's no way I can remember all this information during childbirth. Especially when I can't retain 90% of it now.","score":54,"num_comments":117,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"v6r9jk","author_hash":"69dbebaf012717e8ad8e0e7e1bff5d58889266a71347deb896a4f1faaa672d09","created_utc":"2022-06-07T09:42:24+00:00","title":"AITA for going off on my partner in front of his family?","text":"I know this isn’t AITA, but I wanted to hear from other Mum’s on if I am TA. \nI am (25F) and I’m five and half months postpartum, and this weekend we went on our first mini vacation with our son and our families. \nThe entire trip they mainly spent their time taking photos of each other, but never included my family (even after I brought it up). On our last day they (his Mum, sister and BIL) walked off from me and my family for a walk with our son, that doesn’t bother me. What did bother me was what I watched. We’re in Australia, it’s winter, but our sun still packs a punch. They were standing on the cliff-side stationary for fifteen minutes where there was no shade, just taking photos — just photos, nothing else. My Mum instinct kicked in telling me something wasn’t right, and I marched myself up there and what I saw shocked me. Not only does our son have a singlet and a long sleeved onesie on, he also had a jacket, his hands covered and thick blanket over his chest (I always carry a thinner one in his nappy bag to regulate him to different climates) his pram is also black and let me tell you our son was asleep and his face was bright tomato red. I touched him and he was boiling. I lashed out my partner that they shouldn’t have been just having a photo shoot and should have continued to walk with him to circulate the air flow, I tried walking our son away when my partner told me to give him back to him because nothing was wrong, I just said leave it and walked off and his Mum just yelled “Oh stop it Op!” in a harsh tone. Just walked until his cheeks were cream coloured again and sat down to cry. I have seen babies get heat stroke in all types of weather here in Australia and I was scared. I don’t want my son to end up back in hospital that could be completely avoided (our son was diagnosed with Hydrocephalus at 3 weeks old). Now I’m the monster, the bad guy, which to always be the case — at least that’s how it feels. \nSo Reddit, am I TA?","score":562,"num_comments":205,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"x4d0b9","author_hash":"8e55d38403aa1c78c250c33bcd8e6c65617414af4b03b153f9f0b409a462b31f","created_utc":"2022-09-02T21:29:38+00:00","title":"Grossest thing a man has said about your pregnancy?","text":"My husband's uncle asked \"is DH giving him a bunch of black eyes?\"\n\nTook me a solid minute to understand. \n\nWhat's the weirdest thing a man has said about your pregnancy? Some people are just so audacious!","score":310,"num_comments":320,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1evqry5","author_hash":"f5bfb1daa44b4d55a13b560189de3d37584176f12f29ff56c6cd8ef18122b036","created_utc":"2024-08-19T02:23:48+00:00","title":"Fell, went to hospital, weird experience with the social worker who seems to think it was DV. (It wasn’t)","text":"CW: talk of DV (no actual DV/IPV), pregnancy complications \n\nSo I have just had an extremely weird and stressful weekend and I kind of just want to put this out there. Day care is closed for the week, so my MIL visits to take care of my toddler, I’m working from home. Husband is at work. After I go and sit with my son a bit for lunch, I go back to the basement where I’m working, and I lose my balance on the final stair and fall forward, hitting my eye and head against a shelf, otherwise catch myself (no impact to abdomen — I’m 32W). Immediately call my nurse line, who advise me to go to an ER. So I do. No signs of concussion or altered vision, but I’ve got a nasty black eye and some bruising on my arms and legs where I caught myself. \n\nI am asked about 100 times if I am safe at home. This is fine, of course, I understand that pregnant women are at high risk of abuse and I’ve got a black eye. But I repeatedly tell them I’m safe, that my husband wasn’t even home when it happened, etc. (my husband had come for a few hours, but after it became clear that things seemed to be fine, he left to go take care of our toddler so his mom could catch her flight). \n\nI’m held for 24 hours due to an abnormal test result, and near the end of this a woman comes into my room and explains she’s a social worker. She asks me about the circumstances of my injury and I explain, and explain that my husband wasn’t even home but my MIL was and heard my fall, that I was alone. She just clearly doesn’t believe me and immediately takes an aggressive tone. Starts asking all these specific questions about my husband. Where he works. Mental health history. Any history of depression? Anxiety? Really, none at all? Among any of you in the home? Why did you wait a day after the fall to get checked out? (I DID NOT, i went to the hospital IMMEDIATELY?!) At one point I nervously say “I know how it looks to be pregnant with a black eye” and kind of laugh and she says in a nasty tone “do you think it’s funny that you are speaking with a social worker?” And like honestly lady if you knew my husband KIND OF, he literally won’t even kill spiders in our house, he picks them up and puts them outside. \n\nThe whole thing just felt like an interrogation?? It was extremely uncomfortable and I definitely felt like I was in trouble? Like, look, obviously DV is a scourge on American society and pregnancy is a high risk time, but WHO does this approach work for?? Are social workers just incredibly jaded? Like should I have asked for a lawyer???? And again, falls in pregnancy are common! Your center of gravity and balance have changed! \n\nIdk, it was horrible, and if I had known how awful it would be I probably would have asked her to leave as soon as she walked in. Kind of just want to hear if anyone else has had an experience like this or can share some perspective. (Baby and I are fine from the fall btw)","score":488,"num_comments":71,"likely_black_context":true}
{"platform":"reddit","community":"r/BabyBumps","post_id":"1ljbrxg","author_hash":"4d45943438be63cc280c0d317d6118fba9cfbf2dfb613369ac2e1aedb4ca94e7","created_utc":"2025-06-24T13:56:14+00:00","title":"PSA: My bump is not a free pass to comment on my body like it's public property","text":"I'm 27 weeks pregnant and something I didn’t prepare for was just *how much people think they’re entitled to comment on your body.* Like, nonstop. Random acquaintances, coworkers, family, even strangers at the store. It’s like my belly is now some community art piece and everyone has an opinion.\n\nYesterday I went to a small get-together with some extended family. I was wearing a basic black maxi dress, and my aunt (who I haven’t seen in a while) immediately said, “Wow, I thought you’d be *bigger* by now!” 🙃\n\nThen someone else chimed in with, “Oh I love how you’re carrying! All belly, no fat anywhere else!” Like… what even are these comments? Why are we talking about my fat? Why do you think this is okay?\n\nI know people think they’re being kind or funny or whatever but I’m over it. Growing a human is already mentally and physically exhausting without having my body treated like it’s up for review. I’m not a billboard for pregnancy aesthetics. I’m a person.\n\nAlso side note *I feel huge.* I’m out of breath all the time, I can barely tie my own shoes, and I haven’t slept properly in weeks. So hearing commentary on my size, even if it’s “positive,” just makes me feel extra weird and self-conscious.\n\nJust a reminder that pregnant people don’t owe you a specific shape, size, glow, or vibe. We’re all just out here trying to get through each day with as much grace (or caffeine) as possible.\n\nAnyway, thanks for coming to my TED talk. 😅","score":174,"num_comments":51,"likely_black_context":true}
